{
  "id": "ch.2-14",
  "gates": [
    2,
    14
  ],
  "centers": [
    "center.g",
    "center.sacral"
  ],
  "circuit": "circuit.individual",
  "stream": "stream.knowing",
  "voice": "I have the power to go this way.",
  "display_name": "Channel of the Beat (2–14) — Keeper of the Keys",
  "keynotes": [
    "individual direction powered by resources",
    "sacral fuel serving the self’s geometry",
    "the one who knows where the power goes",
    "the beat: fixed rhythm, fixed direction",
    "can hold or release resources for others",
    "generator channel — respond, don’t initiate",
    "magnetic, often materially empowered",
    "melancholy when direction has no outlet"
  ],
  "notes": "Overview: Channel 2–14 links Gate 2 (The Direction of the Self / The Driver) in the G Center with Gate 14 (Power Skills) in the Sacral. In Human Design this is the classic Individual ‘Beat’ — the pulse of the Knowing stream. It is often described as “the design of a keeper of the keys” because this configuration knows who the energy and resources are for, and in what direction they should move.\n\nMechanics:\n- Gate 2 provides the **direction** — the correct geometry for the vehicle, guided by the Magnetic Monopole in the G.\n- Gate 14 provides the **fuel** — the sacral power to do the work, to accumulate, to sustain, to make resources available.\n- Together they create a person who is not only resourced but also **correctly guided**, so the power doesn’t spill into the wrong places.\n\nLine Companion / Jovian-style pulls (≤25 words):\n1) \"Gate 2 is the driver of the vehicle.\" — Ra Uru Hu, Line Companion (Gate 2)\n2) \"Receptive to the direction of the Self.\" — Ra Uru Hu, Line Companion (Gate 2)\n3) \"Gate 14 is the power to sustain direction.\" — Ra Uru Hu, Line Companion (Gate 14)\n4) \"This is the keeper of the keys.\" — Ra Uru Hu, Channel 2–14\n5) \"Resources are for those who are correct.\" — Ra Uru Hu, Line Companion (Gate 14)\n\nInterpretation of these quotes:\n- The **2** does not invent direction; it receives the correct one from the Self.\n- The **14** does not chase money for ego; it fuels what the Self has already oriented toward.\n- The channel’s gift is not merely to have energy, but to **steward** energy.\n\nAura / type considerations:\n- This is a Generator channel (G ↔ Sacral, no Throat), so the purest strategy is to **wait to respond** and then apply power to the correct direction.\n- If it initiates without response, it can waste its very potent resources or empower the wrong person.\n\nHigh expression:\n- Reliable, rhythmic, materially capable.\n- Knows which projects deserve power and which do not.\n- Can materially support a collective or tribe while remaining individually directed.\n\nLow expression / distortion:\n- Hoarding resources out of fear.\n- Power feeding the wrong direction (distraction, other people’s agenda).\n- Feeling stuck because there is no outer opportunity to move in the correct geometry.\n\nNotes on ‘the Beat’:\n- “Beat” here is both literal and symbolic — an internal, fixed frequency that does not like to be pushed off time.\n- When the world’s rhythm matches the 2–14 rhythm, there is a sense of effortless movement and prosperity.\n- When it doesn’t, sadness or melancholy can arise — classic Individual chemistry.\n\nIdeal environment / role:\n- Roles where you **direct resources**: operations, provisioning, patronage, guardians of assets, people who say “yes” or “no” to projects.\n- Roles where your **inner compass** matters more than outer trends.\n",
  "last_updated": "2025-10-28"
}
