{
  "id": "ch.34-10",
  "gates": [
    34,
    10
  ],
  "centers": [
    "center.sacral",
    "center.g"
  ],
  "circuit": "circuit.integration",
  "stream": "stream.integration",
  "voice": "I empower myself through correct behavior.",
  "display_name": "Channel of Exploration (34–10) — Design of Following One’s Convictions",
  "keynotes": [
    "integration: empowerment through individuality",
    "sacral power (34) fuels G-center behavior (10)",
    "self-empowered action guided by personal correctness",
    "the power to be oneself in action",
    "lives according to inner truth, not external rules",
    "purely individual, existential, and self-directed",
    "magnetic when aligned; disruptive when not",
    "distortion: acting from ego or proving worth"
  ],
  "notes": "Overview: Channel 34–10 connects Gate 34 (Power / Great Strength) in the Sacral to Gate 10 (Behavior of the Self / Love of Self) in the G Center. It is part of the **Integration Circuit**, the most self-referential and existential group of channels in Human Design. Ra Uru Hu called it the **Channel of Exploration** — the design of following one’s convictions. It represents the pure power to live as oneself, empowered by correct behavior aligned with self-love and authenticity.\n\nLine Companion / Jovian-style pulls (≤25 words):\n1) \"Gate 34 is the gate of power and self-empowerment.\" — Ra Uru Hu, Line Companion (Gate 34)\n2) \"Gate 10 is the behavior of the self — love of self.\" — Ra Uru Hu, Line Companion (Gate 10)\n3) \"This is the design of following one’s convictions.\" — Ra Uru Hu, 34–10\n4) \"Integration is self-empowerment; it is not about others.\" — Ra Uru Hu, Integration teaching\n5) \"To be oneself is the greatest power.\" — Ra Uru Hu, 34–10 commentary\n\nMechanics:\n- **Sacral (34)** provides sustainable life-force power — the ability to act, build, and respond.\n- **G (10)** provides behavioral correctness — how the form expresses its true nature through movement and interaction.\n- Together, they form **self-empowered action**: the ability to act authentically and spontaneously from one’s own truth, not through external conditioning.\n\nHigh expression:\n- Lives by internal conviction; acts when it feels correct, not when pressured.\n- Inspires others through authentic example, not instruction.\n- Moves through life with self-trust and instinctive correctness.\n\nLow expression / distortion:\n- Acting impulsively or to prove power → misalignment.\n- Trying to lead or fix others instead of focusing on self-behavior.\n- Losing self-love and collapsing into guilt or conformity.\n\nEnergetic nature:\n- Integration circuitry is **existential**, not moral, tribal, or collective. Its function is **to survive and thrive through correctness of self**.\n- The 34–10 does not care about pleasing or saving others — its power is internal, and that **self-containment is its gift.**\n- When aligned, it embodies natural grace and confidence; when misaligned, it can appear reckless or self-absorbed.\n\nSymbolism:\n- **10**: Behavior of the Self — how the form walks, talks, and moves correctly.\n- **34**: Power — the sacral motor that fuels and animates that behavior.\n- The synthesis: **embodied authenticity** — “I am myself in motion.”\n\nStrategy & usage:\n- As a Sacral channel, its correctness arises from **response**, not initiation.\n- It thrives in freedom — any external control dulls its power.\n- Ideal for those living as examples of individual truth, sovereignty, and self-leadership.\n\nPractical notes for your HD JSON corpus:\n- Tag for: empowerment, individuality, correct behavior, existential self-love, sacral-to-G integration, conviction, authenticity, sovereignty.\n- Connects closely with 57–10 (instinctive alignment) and 20–34 (power in the now) for the full Integration framework of self-empowered survival.\n",
  "last_updated": "2025-10-28"
}
