{
  "id": "ch.35-36",
  "gates": [
    35,
    36
  ],
  "centers": [
    "center.throat",
    "center.solar_plexus"
  ],
  "circuit": "circuit.abstract",
  "stream": "stream.sensing",
  "voice": "I feel and I experience.",
  "display_name": "Channel of Transitoriness (35–36) — Design of a Jack of All Trades",
  "keynotes": [
    "collective abstract: experience through emotion",
    "solar plexus (36) fuels throat (35) with desire to live and share",
    "hunger for new experiences and emotional diversity",
    "storytelling through lived experience",
    "experiential awareness — learns by doing, not theorizing",
    "restless and adventurous; seeks meaning in change",
    "projected emotional channel — needs clarity before action",
    "distortion: chasing experiences to escape emptiness"
  ],
  "notes": "Overview: Channel 35–36 connects Gate 36 (Crisis / Darkening of the Light) in the Solar Plexus to Gate 35 (Progress / Change) in the Throat. It is part of the **Collective Abstract (Sensing) Circuit** and represents the full **emotional experiential wave** — the human desire to taste, explore, and evolve through experience. Ra Uru Hu called it the **Channel of Transitoriness**, also known as the **Design of a Jack of All Trades**, because it learns through trial, error, and feeling, not through fixed rules.\n\nLine Companion / Jovian-style pulls (≤25 words):\n1) \"Gate 36 is the gate of crisis and the depth of feeling.\" — Ra Uru Hu, Line Companion (Gate 36)\n2) \"Gate 35 is the gate of change and progress.\" — Ra Uru Hu, Line Companion (Gate 35)\n3) \"This is the Channel of Transitoriness.\" — Ra Uru Hu, 35–36\n4) \"Humanity’s experiential wave begins here.\" — Ra Uru Hu, Sensing Stream commentary\n5) \"There is no truth in the now for the emotional being.\" — Ra Uru Hu, Emotional Authority teaching\n\nMechanics:\n- **Solar Plexus (36)** provides emotional fuel — the longing for new experiences and the pain or passion that comes with them.\n- **Throat (35)** expresses the story — the articulation of what has been lived, what has been learned.\n- The 35–36 is **Collective Abstract**, meaning its process is **experiential**: live → feel → reflect → share.\n- It does not seek proof (Logic) or power (Tribal); it seeks **meaning** and **growth** through emotional experience.\n\nHigh expression:\n- Wise storyteller who learns from each experience, no matter how chaotic or beautiful.\n- Brings emotional depth to the human story; teaches compassion through lived lessons.\n- Waits for emotional clarity before diving into new experiences.\n\nLow expression / distortion:\n- Restless thrill-seeking without integration.\n- Creating drama just to feel something new.\n- Oversharing experiences before emotional clarity is reached.\n\nEmotional wave dynamics:\n- As an **emotional channel**, this wave is powerful — from highs of excitement to lows of despair.\n- True understanding emerges only **after** the wave completes — never in the heat of emotion.\n- Melancholy between experiences is normal and creative — it’s when integration happens.\n\nCollective storytelling:\n- 36 feels the **crisis** and chaos of new experience.\n- 35 turns it into **progress** and story.\n- Together, they produce **human history** — the emotional narrative that defines the collective memory.\n\nPractical notes for your HD JSON corpus:\n- Tag for: experience, emotion, storytelling, change, adventure, abstract circuit, emotional wave, humanity’s experiential cycle.\n- Often active in empaths, artists, performers, and travelers who process emotion through lived stories.\n- Completes the emotional sensing arc (41–30 → 36–35 → 12–22 → 13–33).\n",
  "last_updated": "2025-10-28"
}
