{
  "id": "hx10",
  "number": 10,
  "unicode_hexagram": "䷉",
  "name": "Treading / Conduct (履, Lǚ)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "(U suggests the idea of) one treacling on the tail of a tiger, which does not bite him. There will be progress and success. kingdom of Yin or Shang, the China of the twelfth century b.c., the era of king Wan. Rain coining and moistening the ground is the cause of the beauty and luxuriance of the vegetable world, and the emblem of the blessings flowing from good training and good government. Here therefore in the west, the hereditary territory of the house of Mu, are blessings which might enrich the whole kingdom; but they are somehow restrained. The dense clouds do not empty their stores. P. Regis says:—'To declare openly that no rain fell from the heavens long covered with dense clouds over the great tract of country, which stretched from the western border to the court and on to the eastern sea, was nothing else but leaving it to all thought ful minds to draw the conclusion that the family of Wkn was as worthy of the supreme seat as that of Shau, the tyrant, however ancient, was unworthy of it (vol. i, p. 356).' The intimation is not put in the Text, however, so clearly as by P. Regis. Line 1 is undivided, the first line of A 7 iien, occupying its proper place, Its subject, therefore, notwithstanding the check of line 4, resumes his movement, and will act according to his strong nature, and go forward. Line 2 is also strong, and though an even place is not appropriate to it, that place being central, its subject will make common cause with the subject of line 1; and there will be good fortune. Line 3, though strong, and in a proper place, yet not being in the centre, is supposed to be less able to resist the restraint of line 4; and hence it has the ill omens that are given. The subject of line 4, one weak line against all the strong lines of the hexagram, might well expect wounds, and feel apprehension in trying to restrain the,others; but it is in its proper place; it is the first line also of Sun, whose attribute is docile flexibility. sect. 1 . 1. The first line, undivided, shows its subject treading his accustomed path. If he go forward, there will be no error. 2. The second line, undivided, shows its subject treading the path that is level and easy;a quiet and solitary man, to whom, if he be firm and correct, there will be good fortune. 3. The third line, divided, shows a one-eyed man (who thinks he) can see; a lame man (who thinks he) can walk well; one who treads on the tail of a tiger and is bitten. (All this indicates) ill fortune. We have a (mere) bravo acting the part of a great ruler. 4. The fourth line, undivided, shows its subject treading on the tail of a tiger. He becomes full of apprehensive caution, and in the end there will be good fortune. 5. The fifth line, undivided, shows the resolute tread of its subject. Though he be firm and correct, there will be peril. 6. The sixth line, undivided, tells us to look at (the whole course) that is trodden, and examine the The strong lines are moved to sympathy and help, and ‘there is no mistake.’ Line 5 occupies the central place of Sun, and converts, by the sincerity of its subject, 4 and 6 into its neighbours, who suffer themselves to be used by it, and effect their common object. In line 6, the idea of the hexagram has run its course. The harmony of nature is restored. The rain falls, and the onward march of the strong lines should now stop. But weakness that has achieved such a result, if it plume itself on it, will be in a position of peril; and like the full moon, which must henceforth wane. Let the superior man, when he has attained his end, remain in quiet. 80 THE Y$ KING. TEXT. presage which that gives. If it be complete and without failure, there will be great good fortune. X. The character giving its name to the hexagram plays an im portant part also in the symbolism; and this may be the reason why it does not, as the name, occupy the first place in the Thwan. Looking at the figure, we see it is made up of the trigrams Tui, representing a marsh, and /sf/nen, representing the sky. Tui is a yin trigram, and its top line is divided. Below A 7 hen, the great symbol of strength, it may readily suggest the idea of treading on a tiger's tail, which was an old way of expressing what was hazardous (Shu V, xxv, 2). But what suggests the statement that ‘the tiger does not bite the treader?’ The attribute of Tui is pleased satisfaction. Of course such an attribute could not be predicated of one who was in the fangs of a tiger. The coming scatheless out of such danger further suggests the idea of ‘ progress and success' in the course which king Wan had in his mind. And according to Appendix VI, that course was ‘ propriety,’ the observance of all the rules of courtesy. On these, as so many stepping-stones, one may tread safely amid scenes of disorder and peril. Line 1 is an undivided line in an odd place; giving us the ideas of activity, firmness, and correctness. One so characterised will act rightly. Line 2 occupies the middle place of the trigram, which is sup posed to symbolise a path cut straight and level along the hill-side, or over difficult ground. Line 5 is not a proper correlate, and hence the idea of the subject of 2 being 1 a quiet and solitary man.’ Line 3 is neither central nor in an even place, which would be proper to it. But with the strength of will which the occupant of an odd place should possess, he goes forward with the evil results so variously emblemed. The editors of the imperial edition, in illustration of the closing sentence, refer to Analects VII, x. Line 4 is in contiguity with 5, whose subject is in the place of authority; but he occupies the place proper to a weak or divided line, and hence he bethinks himself, and goes softly. Beneath the symbolism under line g, lies the principle that the most excellent thing in ‘ propriety ’ is humility. And the subject of the line, which is strong and central, will not be lacking in this, but bear in mind that the . higher he is exalted, the greater may be his fall. SECT. I. THE THAI HEXAGRAM. 8 1",
    "normalized_summary": "Walking in danger. You’re moving through power structures where one wrong move could get you killed, socially or literally. Success depends on correct conduct, alert humility, and constant self-checking."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject treading his accustomed path. If he go forward, there will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：素履，往无咎。"
        }
      ],
      "normalized_meaning": "Stay simple and true to your natural way of moving. Proceed straightforwardly and you’re fine.",
      "keywords": [
        "simplicity",
        "authentic conduct",
        "no blame",
        "safe forward motion",
        "uncomplicated action"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows its subject treading the path that is level and easy;a quiet and solitary man, to whom, if he be firm and correct, there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：履道坦坦，幽人贞吉。"
        }
      ],
      "normalized_meaning": "Walk calmly, modestly, without needing attention. Quiet correctness brings good fortune.",
      "keywords": [
        "inner steadiness",
        "low-profile integrity",
        "calm discipline",
        "unshowy virtue",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows a one-eyed man (who thinks he) can see; a lame man (who thinks he) can walk well; one who treads on the tail of a tiger and is bitten. (All this indicates) ill fortune. We have a (mere) bravo acting the part of a great ruler.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。"
        }
      ],
      "normalized_meaning": "Overconfidence with partial ability is dangerous. Pretending to have authority you don’t actually have gets you bitten.",
      "keywords": [
        "false confidence",
        "overreach",
        "ego performance",
        "impersonating authority",
        "misfortune"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows its subject treading on the tail of a tiger. He becomes full of apprehensive caution, and in the end there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：履虎尾，愬愬，终吉。"
        }
      ],
      "normalized_meaning": "You’re in direct danger. Hyper-awareness, humility, and respectful conduct get you through intact.",
      "keywords": [
        "high alert",
        "respect for danger",
        "nervous caution",
        "careful navigation",
        "eventual good fortune"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows the resolute tread of its subject. Though he be firm and correct, there will be peril.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：夬履，贞厉。"
        }
      ],
      "normalized_meaning": "This is decisive, exposed leadership. You might be right, but it’s still risky — authority at this level is watched and tested.",
      "keywords": [
        "decisive action",
        "leadership under scrutiny",
        "high stakes",
        "peril despite correctness",
        "pressure at the top"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, tells us to look at (the whole course) that is trodden, and examine the The strong lines are moved to sympathy and help, and ‘there is no mistake.’ Line 5 occupies the central place of Sun, and converts, by the sincerity of its subject, 4 and 6 into its neighbours, who suffer themselves to be used by it, and effect their common object. In line 6, the idea of the hexagram has run its course. The harmony of nature is restored. The rain falls, and the onward march of the strong lines should now stop. But weakness that has achieved such a result, if it plume itself on it, will be in a position of peril; and like the full moon, which must henceforth wane. Let the superior man, when he has attained his end, remain in quiet. 80 THE Y$ KING. TEXT. presage which that gives. If it be complete and without failure, there will be great good fortune. X. The character giving its name to the hexagram plays an im portant part also in the symbolism; and this may be the reason why it does not, as the name, occupy the first place in the Thwan. Looking at the figure, we see it is made up of the trigrams Tui, representing a marsh, and /sf/nen, representing the sky. Tui is a yin trigram, and its top line is divided. Below A 7 hen, the great symbol of strength, it may readily suggest the idea of treading on a tiger's tail, which was an old way of expressing what was hazardous (Shu V, xxv, 2). But what suggests the statement that ‘the tiger does not bite the treader?’ The attribute of Tui is pleased satisfaction. Of course such an attribute could not be predicated of one who was in the fangs of a tiger. The coming scatheless out of such danger further suggests the idea of ‘ progress and success' in the course which king Wan had in his mind. And according to Appendix VI, that course was ‘ propriety,’ the observance of all the rules of courtesy. On these, as so many stepping-stones, one may tread safely amid scenes of disorder and peril. Line 1 is an undivided line in an odd place; giving us the ideas of activity, firmness, and correctness. One so characterised will act rightly. Line 2 occupies the middle place of the trigram, which is sup posed to symbolise a path cut straight and level along the hill-side, or over difficult ground. Line 5 is not a proper correlate, and hence the idea of the subject of 2 being 1 a quiet and solitary man.’ Line 3 is neither central nor in an even place, which would be proper to it. But with the strength of will which the occupant of an odd place should possess, he goes forward with the evil results so variously emblemed. The editors of the imperial edition, in illustration of the closing sentence, refer to Analects VII, x. Line 4 is in contiguity with 5, whose subject is in the place of authority; but he occupies the place proper to a weak or divided line, and hence he bethinks himself, and goes softly. Beneath the symbolism under line g, lies the principle that the most excellent thing in ‘ propriety ’ is humility. And the subject of the line, which is strong and central, will not be lacking in this, but bear in mind that the . higher he is exalted, the greater may be his fall. SECT. I. THE THAI HEXAGRAM. 8 1",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：视履考祥，其旋元吉。"
        }
      ],
      "normalized_meaning": "Do an honest audit of your path. If every step has actually been in integrity, the culmination is profoundly auspicious.",
      "keywords": [
        "self-audit",
        "legacy of conduct",
        "completion cycle",
        "earned blessing",
        "supreme good fortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.544205Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 77,
      "leaf_end": 80,
      "page_candidates": [
        "125",
        "126",
        "3",
        "128",
        "6",
        "130",
        "5"
      ],
      "page_confidence": 0.0
    }
  }
}