{
  "id": "hx19",
  "number": 19,
  "unicode_hexagram": "䷒",
  "name": "Approach / Nearing (臨, Lín)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Lin (indicates that under the conditions supposed in it) there will be great progress and success, while it will be advantageous to be firmly correct. In the eighth month there will be evil. 1. The first line, undivided, shows its subject advancing in company (with the subject of the yet great. By giving heed to the cautions in the Text, he will accomplish what is promised. The ruler in line 5 is represented by a weak line, while 2 is strong. Thus the symbolism takes the form of a son dealing with the prevailing decay induced somehow by his mother. But a son must be very gentle in all his intercourse with his mother, and espe cially so, when constrained by a sense of duty to oppose her course. I do not think there is anything more or better to be said here. The historical interpretation adopted by Regis and his friends, that the father here is king Wan, the mother Thfii-sze, and the son king Wfi, cannot be maintained. I have searched, but in vain, for the slightest Chinese sanction of it, and it would give to Kfi the mean ing of misfortunes endured, instead of troubles caused. Line 3 is strong, and not central, so that its subject might well go to excess in his efforts. But this tendency is counteracted by the line’s place in the trigram Sun, often denoting lowly submission. Line 4 is weak, and in an even place, which intensifies that weakness. Hence comes the caution against going forward, The weak line 5, as has been said, is the seat of the ruler; but its proper correlate is the strong 2, the strong siding champion minister, to whom the work of the hexagram is delegated. Line 6 is strong, and has no proper correlate below. Hence it suggests the idea of one outside the sphere of action, and taking no part in public affairs, but occupied with the culture of himself. second line). Through his firm correctness there will be good fortune. 2. The second line, undivided, shows its subject advancing in company (with the subject of the first- line). There will be good fortune; (advancing) will be in every way advantageous. 3. The third line, divided, shows one well pleased (indeed) to advance, (but whose action) will be in no way advantageous. If he become anxious about it (however), there will be no error. 4- The fourth line, divided, shows one advancing in the highest mode. There will be no error. 5. The fifth line, divided, shows the advance of wisdom, such as befits the great ruler. There will be good fortune. 6. The sixth line, divided, shows the advance of honesty and generosity. There will be good fortune, and no error. XIX. In Appendix VI Lin is explained as meaning 1 great.’ The writer, having misunderstood the meaning of the previous KCi, sub joins-'He who performs such services may become “great.”’ But Lin denotes the approach of authority,-to inspect, to comfort, or 0 rule. When we look at the figure, we see two strong undivided nes advancing on the four weak lines above them, and thence follows the assurance that their action will be powerful and suc- cess ul That action must be governed by rectitude, however, and and event! Th\" “ the hanging character of all conditions and events. The meaning of the concluding sentence is given in Appendix I as simply being—that, < the advancing power will decay , no long time. L 4 Zin-iii (Ming dynasty) jays The aim (or the da,) is ,h e symbol of what is Vang. i T 7” bo1 ° f is Y '»' Eght is the number of the second e 'IT T (t i’ £ Yi ”>' - “ helm S oilT <lh ; T« n T “«> Bte .0 Indicate eilhi m„„ b - Tf?** “ Yi ”' \" * 1 * Phrase, '•the ,htb “ nth i >°\"** the pedod Of the coming of what£ SECT. I,",
    "normalized_summary": "Approach. Power draws near, leadership comes down to the people, and things move forward with momentum. This moment of closeness between authority and those below is hugely favorable — if guided by integrity. But it won’t last forever; if self-satisfaction creeps in later, decline sets in (‘in the eighth month, there will be misfortune’)."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject advancing in company (with the subject of the yet great. By giving heed to the cautions in the Text, he will accomplish what is promised. The ruler in line 5 is represented by a weak line, while 2 is strong. Thus the symbolism takes the form of a son dealing with the prevailing decay induced somehow by his mother. But a son must be very gentle in all his intercourse with his mother, and espe cially so, when constrained by a sense of duty to oppose her course. I do not think there is anything more or better to be said here. The historical interpretation adopted by Regis and his friends, that the father here is king Wan, the mother Thfii-sze, and the son king Wfi, cannot be maintained. I have searched, but in vain, for the slightest Chinese sanction of it, and it would give to Kfi the mean ing of misfortunes endured, instead of troubles caused. Line 3 is strong, and not central, so that its subject might well go to excess in his efforts. But this tendency is counteracted by the line’s place in the trigram Sun, often denoting lowly submission. Line 4 is weak, and in an even place, which intensifies that weakness. Hence comes the caution against going forward, The weak line 5, as has been said, is the seat of the ruler; but its proper correlate is the strong 2, the strong siding champion minister, to whom the work of the hexagram is delegated. Line 6 is strong, and has no proper correlate below. Hence it suggests the idea of one outside the sphere of action, and taking no part in public affairs, but occupied with the culture of himself. second line). Through his firm correctness there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：咸臨，貞吉。"
        }
      ],
      "normalized_meaning": "Advance together with the right ally. Move forward in integrity and you get good fortune.",
      "keywords": [
        "joint advance",
        "aligned partnership",
        "firm correctness",
        "good fortune",
        "early momentum"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows its subject advancing in company (with the subject of the first- line). There will be good fortune; (advancing) will be in every way advantageous.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：咸臨，吉，無不利。"
        }
      ],
      "normalized_meaning": "Mutual approach. The two strong forces coordinate and move as one. This is broadly favorable in all directions.",
      "keywords": [
        "mutual support",
        "cooperation",
        "all-around advantage",
        "shared direction",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows one well pleased (indeed) to advance, (but whose action) will be in no way advantageous. If he become anxious about it (however), there will be no error. 4- The fourth line, divided, shows one advancing in the highest mode. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：甘臨，無攸利；既憂之，無咎。"
        }
      ],
      "normalized_meaning": "It feels good to push ahead — but it’s not actually helpful. If you catch yourself, worry about the consequences, and correct, you avoid blame.",
      "keywords": [
        "complacent advance",
        "over-eagerness",
        "self-check",
        "preventing error",
        "no lasting blame"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The fourth SIX, divided, shows one advancing in the highest mode. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：至臨，無咎。"
        }
      ],
      "normalized_meaning": "Approach carried out in the most elevated, appropriate way. This kind of presence — respectful, correct, not arrogant — brings no fault.",
      "keywords": [
        "noble approach",
        "proper conduct",
        "high standard",
        "no error",
        "dignified presence"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows the advance of wisdom, such as befits the great ruler. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：知臨，大君之宜，吉。"
        }
      ],
      "normalized_meaning": "Wise, thoughtful leadership comes forward. The ruler approaches with insight, not force. That brings good fortune.",
      "keywords": [
        "wise leadership",
        "ruler’s insight",
        "appropriate authority",
        "good fortune",
        "right use of power"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, divided, shows the advance of honesty and generosity. There will be good fortune, and no error. XIX. In Appendix VI Lin is explained as meaning 1 great.’ The writer, having misunderstood the meaning of the previous KCi, sub joins-'He who performs such services may become “great.”’ But Lin denotes the approach of authority,-to inspect, to comfort, or 0 rule. When we look at the figure, we see two strong undivided nes advancing on the four weak lines above them, and thence follows the assurance that their action will be powerful and suc- cess ul That action must be governed by rectitude, however, and and event! Th\" “ the hanging character of all conditions and events. The meaning of the concluding sentence is given in Appendix I as simply being—that, < the advancing power will decay , no long time. L 4 Zin-iii (Ming dynasty) jays The aim (or the da,) is ,h e symbol of what is Vang. i T 7” bo1 ° f is Y '»' Eght is the number of the second e 'IT T (t i’ £ Yi ”>' - “ helm S oilT <lh ; T« n T “«> Bte .0 Indicate eilhi m„„ b - Tf?** “ Yi ”' \" * 1 * Phrase, '•the ,htb “ nth i >°\"** the pedod Of the coming of what£ SECT. I,",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：敦臨，吉，無咎。"
        }
      ],
      "normalized_meaning": "The culmination of approach is sincere, open-hearted presence. Come forward with integrity and generosity and you're clear of blame.",
      "keywords": [
        "honesty",
        "generosity",
        "benevolent presence",
        "good fortune",
        "no error"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.548226Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 105,
      "leaf_end": 108,
      "page_candidates": [
        "180",
        "i",
        "6",
        "182",
        "183",
        "1",
        "184",
        "185",
        "5",
        "ii",
        "186",
        "187"
      ],
      "page_confidence": 0.0
    }
  }
}