{
  "id": "hx20",
  "number": 20,
  "unicode_hexagram": "䷓",
  "name": "Contemplation / Viewing (觀, Guān)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Kwan shows (how he whom it represents should be like) the worshipper who has washed his hands, but not (yet) presented his offerings;—with sincerity Yang, we use the phrase, “the seventh day. 1 ” The Khang-hsi editors say that this is the best explanation of the language of the I ext that can be givenThe Yang numbers culminate in 9, the influence then receding and producing the 8 of the smaller Yin. 1 lie \\ in numbers culminate in 6, and the next advance produces the 7 of the smaller \\ ang; so that 7 and 8 are the numbers indicating the first birth ol what is Yin and wluit is Yang.’ 'Ifwe go to seek,’ they add, ‘any other explanation of the phraseology of the Text, and such expressions as “ 3 days,” “ 3 years,” “ 10 years,” &c„ we make them unintelligible.’ Lin is the hexagram of the twelfth month. Line 1 is a strong line in its proper place. The danger is that its subject may he more strong than prudent, hence the caution in requiring firm correctness. Line 2, as strong, should he in an odd place; but this is more than counterbalanced by the central position, and its correlate in line 5. Line? 3 is weak, and neither central, nor in its correct position, 3 loiiee its action will not be advantageous; but being at the top of the trigram Tui, which means being pleased, its subject is repre sented as 1 well pleased to advance.’ Anxious reflection will save him from error. Line 4, though weak, is in its proper place, and has for its cor relate the strong 1, Hence its advance is ‘ in the highest style.’ Line 5 is the position of the ruler. It is weak, but being central, and having for its correlate the strong and central 2, we have in it , vinbol of authority distrustful of itself, and employing fit agents;-— characteristic of the wise ruler. Line 6 is the last of the trigram Khw&n, the height therefore of docility. Line 2 is not its correlate, but it belongs to the Yin to seek for the Yang; and it is so emphatically in this case. Hence the characteristic and issue as assigned. THE SHUT HO HEXAGRAM. ior and an appearance of dignity (commanding reverent regard). 1. The first line, divided, shows the looking of a ladnot blamable in men of inferior rank, but matter for regret in superior men. 2. The second line, divided, shows one peeping out from a door. It would be advantageous if it were (merely) the firm correctness of a female. 3. The third line, divided, shows one looking at (the course of) his own life, to advance or recede (accordingly). 4. The fourth line, divided, shows one contem plating the glory of the kingdom. It will be ad vantageous for him, being such as he is, (to seek) to be a guest of the king. 5. The fifth line, undivided, shows its subject contemplating his own life(-course), A superior man, he will (thus) fall into no error. 6. The sixth line, undivided, shows its subject contemplating his character to see if it be indeed that of a superior man. He will not fall into error. XX. The Chinese character Kwfm, from which this hexagram isnamed, is used in it in two senses. In the Thwan, the first paragraph of the treatise on the Thwan, and the paragraph on the Great Symbolism, it denotes showing, manifesting; In all other places it denotes contemplating, looking at. The sub ject of the hexagram is the sovereign and his subjects, how lie manifests himself to them, and how they contemplate him. The two upper, undivided, lines belong to the sovereign; the four weak lines below them are his subjects,-ministers and others who look up at him. Kw&n is the hexagram of the eighth month. In the Thwan king Wan symbolises the sovereign by a wor shipper when he is most solemn in his religious service, at the commencement of it, full of sincerity and with a dignified carriage. Line 1 is weak, and in the lowest place, improper also for it *— j i t !",
    "normalized_summary": "Ritual readiness, not performance. You are being seen. True authority is built by visible sincerity and inner dignity. The hexagram teaches contemplative self-examination, because others will follow what you are, not what you claim. Leadership begins with looking at yourself clearly."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows the looking of a ladnot blamable in men of inferior rank, but matter for regret in superior men.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：童觀，小人無咎，君子吝。"
        }
      ],
      "normalized_meaning": "Naive, shallow looking. For ordinary people, limited vision is fine. For someone in a higher role, it's embarrassing to see only like a child.",
      "keywords": [
        "childlike view",
        "limited perspective",
        "inexperience",
        "no blame for the lowly",
        "humiliation for the noble"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows one peeping out from a door. It would be advantageous if it were (merely) the firm correctness of a female.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：闚觀，利女貞。"
        }
      ],
      "normalized_meaning": "Cautious, partial view from behind the door. That kind of reserved watching is acceptable in a protected/yin position — but it's not enough for open public responsibility.",
      "keywords": [
        "cautious observation",
        "peeking from safety",
        "proper reserve",
        "limited scope",
        "feminine/yin correctness"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows one looking at (the course of) his own life, to advance or recede (accordingly).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：觀我生，進退。"
        }
      ],
      "normalized_meaning": "Turn the gaze inward. Study your own path and choose whether to go forward or pull back. Observation guides timing.",
      "keywords": [
        "self-examination",
        "deciding advance / retreat",
        "situational awareness",
        "adaptive timing",
        "introspection"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows one contem plating the glory of the kingdom. It will be ad vantageous for him, being such as he is, (to seek) to be a guest of the king.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：觀國之光，利用賓于王。"
        }
      ],
      "normalized_meaning": "You witness the radiance of rightful rule — the larger order. It's favorable now to approach and serve that center with respect.",
      "keywords": [
        "seeing the realm",
        "aspiration to serve",
        "audience with the ruler",
        "aligning with higher order",
        "advantageous approach"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows its subject contemplating his own life(-course), A superior man, he will (thus) fall into no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：觀我生，君子無咎。"
        }
      ],
      "normalized_meaning": "The one in power reflects on their own conduct. This self-audit keeps the leader from going off track.",
      "keywords": [
        "leader self-reflection",
        "accountability",
        "noble introspection",
        "no error",
        "integrity in power"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, shows its subject contemplating his character to see if it be indeed that of a superior man. He will not fall into error. XX. The Chinese character Kwfm, from which this hexagram isnamed, is used in it in two senses. In the Thwan, the first paragraph of the treatise on the Thwan, and the paragraph on the Great Symbolism, it denotes showing, manifesting; In all other places it denotes contemplating, looking at. The sub ject of the hexagram is the sovereign and his subjects, how lie manifests himself to them, and how they contemplate him. The two upper, undivided, lines belong to the sovereign; the four weak lines below them are his subjects,-ministers and others who look up at him. Kw&n is the hexagram of the eighth month. In the Thwan king Wan symbolises the sovereign by a wor shipper when he is most solemn in his religious service, at the commencement of it, full of sincerity and with a dignified carriage. Line 1 is weak, and in the lowest place, improper also for it *— j i t !",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：觀其生，君子無咎。"
        }
      ],
      "normalized_meaning": "At the very top: examine not just actions, but your character itself. Stay humble and keep testing yourself, and you avoid blame.",
      "keywords": [
        "character audit",
        "ongoing humility",
        "ethical vigilance",
        "no blame",
        "final self-inspection"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.548586Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 108,
      "leaf_end": 111,
      "page_candidates": [
        "186",
        "187",
        "189",
        "190",
        "191",
        "5",
        "192",
        "1"
      ],
      "page_confidence": 0.0
    }
  }
}