{
  "id": "hx21",
  "number": 21,
  "unicode_hexagram": "䷔",
  "name": "Biting Through (噬嗑, Shì Hé)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Shill Ho indicates successful progress (in the condition of things which it supposes). It will be advantageous to use legal constraints. 1. The first line, undivided, shows one with his feet in the stocks and deprived of his toes. There will be no error. 2. I he second line, divided, shows one biting through the soft flesh, and (going on to) bite off the nose. There will be no error. the symbol of a thoughtless lad, who cannot see far, and takes only superficial views. Line 2 is also weak, but in its proper place, showing a woman, living retired, and only able to peep as from her door at the subject of the fifth line. But ignorance and retirement are proper in a woman. Line 3, at the top of the lower trigram Khwhn, and weak, must belong to a subject of the utmost docility, and will wish to act only according to the exigency of time and circumstances. Line 4, in the place proper to its weakness, is yet in immediate proximity to 5, representing the sovereign. Its subject is moved accordingly, and stirred to ambition. Line 5 is strong, and in the place of the ruler. He is a superior man, but this does not relieve him from the duty of self-contempla tion or examination. There is a slight difference in the 6th paragraph from the 5th, which can hardly be expressed in a translation, By making a change in the punctuation, however, the different significance may lie brought out. Line 6 is strong,’and should be considered out of the work of the hexagram, but its subject is still possessed by the spirit of its idea, and is led to self-examination. i r.v r. THE VI KING. 3. The third line, divided, shows one <$n;twm<>' dried flesh, and. meeting with what is disagreeable. There will be occasion for some small regret, but no (great) error. 4. The fourth line, undivided, shows one gnawing the flesh dried on the bone, and getting the pledges of money and arrows. It will be advantageous to him to realise the difficulty of his task and be firm,.. in which case there will be good fortune. 5. The fifth line, divided, shows one. gnawing at dried flesh, and finding the yellow gold. Let him lie firm and correct, realising the peril (of his posi tion). There will be no error. 6. The sixth line, undivided, shows one wearing the cangue, and deprived of his ears. There will be evil. XXI. Shih Ho means literally ‘Union by gnawing/ We »•»? in the figure two strong lines in the first and last plan's, u-liih; all tin* others, with the exception of the fourth, are divided. This suggests the idea of the jaws and the mouth between them kept open by something in it. Let that be gnawed through ami the tumuli will dose and the jaws come together, So in the body politic, Remove the obstacles to union, and high and low will come together with a good understanding. And how are those obstacles to be remoml? I?y force, emblemed by the gnawing ; that is, by legal constraints. And these are sure to be successful. The auspice of the figure is favourable. There will be success. Lines 1 and 6 are much out of the game or action described in the figure. Hence they are held to represent parties receiving punishment, while the other lines represent parties inflicting it. The punishment in line 1 is that of the stocks, administered for a small offence, and before crime has made much way. But if the ‘depriving' of the toes is not merely keeping them in restraint, but cutting them off, as the Chinese character suggests, the punish ment appears to a western reader too severe. Line 2 is weak, appropriately therefore in an even place, ami it is central besides. The action therefore of its subject should sect. I. TUI', ft HEXAGRAM. 10$ XXI1. Tim II Hexagram. Pi indicates that there should be free course (in what it denotes). There will be little advantage (however) if it be allowed to advance (and take the lead). be effective; and this is shown by the ‘biting through the soft flesh,’ an easy thing. Immediately below, however, is a strong offender represented by the strong line, and before lie will submit it is necessary to 'bite off bis nose;’ for punishment is the rule;. it; must be cimiimied and increased till the end is secured. bine 3 is weak, and in an even place, The action of its subject will lie ineffective; and is emblemed by the hard task of gnawing through dried flesh, ami encountering, besides, what is distasteful and injurious in it, But again comes in the consideration that here punishment is the rule, ami the auspice is not all bad, Of old, in a civil case, both parties, before they were heard, brought in the court an arrow (or a bundle of arrows), in testimony of their rectitude, after which they were heard; in a criminal case, they in the same way deposited each thirty pounds of gold, or some other metal. See the Official Book of Ian, ay, 14,15. The subject of the fourth line's getting those pledges indicates liis exercising his judicial functions; and what he gnaws through indi cates their dibit idly. Moreover, though the line is strong, it is in an even place; and hence comes the lesson of caution, The fifth line represents' the lord of judgment.' As it is a weak line, he will be disposed to leniency; and bis judgments will he correct. This is declared by bis finding the ‘ yellow metal; 1 for yellow is one of the five 1 correct ’ colours. The position is in the centre ami that of rule; hut the line being weak, a caution is given, as under the previous Hue. The action til the figure has passed, and still we have, in the sub ject of line 6, one persisting in wrong, a strong criminal, wearing the cangue, ami deaf to counsel. Of course the auspice is evil. ; THE Yl KING. 1. The first line, undivided, shows one adorning (the way of) his feet. He can discard a carriage and walk on foot. 2. The second line, divided, shows one adorning his beard. 3. The third line, undivided, shows its subject with the appearance of being adorned and bedewed (with rich favours). But let him ever maintain his firm correctness, and there will be good fortune. 4. The fourth line, divided, shows one looking as if adorned, but only in white. As if (mounted on) a white horse, and furnished with wings, (he seeks union with the subject of the first line), while (the intervening third pursues), not as a robber, but in tent on a matrimonial alliance. 5. The fifth line, divided, shows its subject adorned by (the occupants of) the heights and gar dens. He bears his roll of silk, small and slight. He may appear stingy; but there will be good fortune in the end. 6. The sixth line, undivided, shows one with white as his (only) ornament. There will be no error. ‘ S the Symbo1 of vvhat is ornamental , ?! f e aC . ° f , adon ! mg ‘ As th ere is ornament in nature, so a qu . ieie e. m society; but its place is secondary to that of \\v at is substantial, This is the view of king Wan in his Thwan The symbolism of the separate lines is sometimes fantastic. Line 1 is strong, and in an odd place. It is at the very bottom of he hexagram, and is the first line of Lt, the trigram for fire 0^ light, and suggesting what is elegant and bright. Its subject has nothing to do but to attend to himself. Th s £ \" adorns—himself in his humble position; but if need be riZuT ness requiring it, he can give up every luxury and indulgence SECT, I.",
    "normalized_summary": "Biting Through = decisive justice. When something is stuck between people — obstruction, deceit, crime — it must be bitten through, even harshly, so that order can be restored. The hexagram says: apply firm, appropriate correction. When justice is clear and proportional, the system can unite and move forward."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows one adorning (the way of) his feet. He can discard a carriage and walk on foot.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：屨校滅趾，無咎。"
        }
      ],
      "normalized_meaning": "Early-stage offense gets a light restraint. Movement is stopped before worse harm is done. Accept the warning — it's corrective, not a condemnation.",
      "keywords": [
        "early discipline",
        "minor punishment",
        "prevent escalation",
        "restraint",
        "no blame"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows one adorning his beard.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：噬膚，滅鼻，無咎。"
        }
      ],
      "normalized_meaning": "Swift, forceful action. It's a bit brutal, but it subdues defiance. Sometimes justice has to go far enough that resistance stops.",
      "keywords": [
        "decisive enforcement",
        "firm justice",
        "controlled severity",
        "no blame",
        "stopping defiance"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows its subject with the appearance of being adorned and bedewed (with rich favours). But let him ever maintain his firm correctness, and there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：噬臘肉，遇毒；小吝，無咎。"
        }
      ],
      "normalized_meaning": "You’re dealing with a nasty, sticky situation. It's gross, politically or morally. You may feel some regret, but handling it is still basically right.",
      "keywords": [
        "unpleasant duty",
        "toxic situation",
        "small regret",
        "necessary correction",
        "no major error"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows one looking as if adorned, but only in white. As if (mounted on) a white horse, and furnished with wings, (he seeks union with the subject of the first line), while (the intervening third pursues), not as a robber, but in tent on a matrimonial alliance.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：噬乾胏，得金矢，利艱貞，吉。"
        }
      ],
      "normalized_meaning": "Serious judicial work. You secure evidence and authority (money, arrows), but it's hard work. Know it's difficult, stay steady, and you'll succeed.",
      "keywords": [
        "judicial responsibility",
        "evidence and mandate",
        "firm perseverance",
        "difficult task",
        "good fortune"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows its subject adorned by (the occupants of) the heights and gar dens. He bears his roll of silk, small and slight. He may appear stingy; but there will be good fortune in the end.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：噬乾肉，得黃金，貞厲，無咎。"
        }
      ],
      "normalized_meaning": "At the center of power: applying law reveals truth (‘yellow gold’). Stay upright and aware of danger. That vigilance keeps you free of blame.",
      "keywords": [
        "just governance",
        "truth revealed",
        "integrity under pressure",
        "aware of danger",
        "no error"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, shows one with white as his (only) ornament. There will be no error. ‘ S the Symbo1 of vvhat is ornamental , ?! f e aC . ° f , adon ! mg ‘ As th ere is ornament in nature, so a qu . ieie e. m society; but its place is secondary to that of \\v at is substantial, This is the view of king Wan in his Thwan The symbolism of the separate lines is sometimes fantastic. Line 1 is strong, and in an odd place. It is at the very bottom of he hexagram, and is the first line of Lt, the trigram for fire 0^ light, and suggesting what is elegant and bright. Its subject has nothing to do but to attend to himself. Th s £ \" adorns—himself in his humble position; but if need be riZuT ness requiring it, he can give up every luxury and indulgence SECT, I.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：何校滅耳，凶。"
        }
      ],
      "normalized_meaning": "This is the extreme end: total disgrace, punishment, and refusal to listen. If things get this far, it's already gone bad.",
      "keywords": [
        "severe penalty",
        "public shame",
        "deaf to counsel",
        "final consequence",
        "misfortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.548889Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 111,
      "leaf_end": 114,
      "page_candidates": [
        "192",
        "1",
        "194",
        "195",
        "3",
        "196",
        "197",
        "6",
        "198"
      ],
      "page_confidence": 0.0
    }
  }
}