{
  "id": "hx24",
  "number": 24,
  "unicode_hexagram": "䷗",
  "name": "Return / Turning Back (復, Fù)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "h u indicates that there will be free course and progress (in what it denotes). (The subject of it) finds no one to distress him in his exits and too strong; but the fashion of political life passes away. If he wait, a change for the better will shortly appear. Tim lesser symbolism is chiefly that of a bed or couch with its occupant. Tlu: idea of the hexagram requires this occupant to be overthrown, or at least that an attempt be made to overthrow him. Accordingly the attempt in line 1 is made by commencing with the legs of the couch. The symbolism goes on to explain itself, The object of the evil worker is the overthrow of all firm correctness. Of course there will lie evil, Line 2 is to the same effect as 1; only the foe has advanced from the legs to the frame of the couch. Line 3 also represents an ovcrlhrower; but it differs from the others in being the correlate of 6. The subject of it will take part with hint. His association is with the subject of 6, and not, as in the other weak lines, with one of its own kind. From line 4 the danger is imminent. The couch has ken overthrown. The person of the occupant is at the mercy of the destroyers. With line 5 the symbolism changes. The subject of 5 is ‘lord of all the other weak lines,' and their subjects are at his disposal. He and they are represented as fishes, following one another as if strung together, All fishes come under the category of yin. Then the symbolism changes again. The subject of 5, representing and controlling all the yin lines, is loyal to the subject of the yang sixth line. He is the rightful sovereign in his palace, and 5 leads all the others there to enjoy the sovereign’s favours, We have still different symbolism under line 6. Its strong subject, notwithstanding the attempts against him, survives, and acquires fresh vigour. The people again cherish their sovereign, and the plotters have wrought to their own overthrow. ioS THE Vi KING. entrances; friends come to him, and no error is committed. He will return and repeat his (proper) course. In seven days comes his return, There will be advantage in whatever direction movement is made. 1. The first line, undivided, shows its subject returning (from an error) of no great extent, which would not proceed to anything requiring repentance, There will be great good fortune. 2. The second line, divided, shows the admirable return (of its subject). There will be good fortune. 3. The third line, divided, shows one who has made repeated returns. The position is perilous, but there will he no error. 4. The fourth line, divided, shows its subject moving right in the centre (among those represented by the other divided lines), and yet returning alone (to his proper path). 5. The fifth line, divided, shows the noble return of its subject. 1 here will be no ground for repentance, 6. The topmost line, divided, shows its subject all astray on the subject of returning. There will be evil. There will be calamities and errors. If with his views he put the hosts in motion, the end will be a great defeat, whose issues will extend to the rulei of the state. Even in ten years he will not be able to repair the disaster, XXIV, Ffi symbolises the idea of returning, coming back or over again. 'I lie last hexagram showed us inferior prevailing over superior men, all that is good in nature and society yielding before what is bad. But change is the law of nature and society. When decay has reached its climax, recovery will begin to take place, in 10 we had one strong topmost line, and five weak lines below THE Wf) WANG HEXAGRAM.",
    "normalized_summary": "The turning point after breakdown. Vital energy comes back online. You correct course and return to right conduct. Quiet, honest re-alignment is fully supported. Acting aggressively from confusion — especially trying to mobilize others — backfires hard and creates long-term damage."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject returning (from an error) of no great extent, which would not proceed to anything requiring repentance, There will be great good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：不遠復，無祗悔，元吉。"
        }
      ],
      "normalized_meaning": "You turn back before you've gone too far off-path. Because the course correction happens early, there's no real guilt — and it's hugely auspicious.",
      "keywords": [
        "early course correction",
        "minimal regret",
        "turning back",
        "great good fortune",
        "self-honesty"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows the admirable return (of its subject). There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：休復，吉。"
        }
      ],
      "normalized_meaning": "A calm, voluntary return. No drama, no force. You come back to what’s right in a rested, natural way — and that’s lucky.",
      "keywords": [
        "quiet reset",
        "restful return",
        "voluntary correction",
        "inner peace",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows one who has made repeated returns. The position is perilous, but there will he no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：頻復，厲，無咎。"
        }
      ],
      "normalized_meaning": "You keep slipping and having to come back again and again. That pattern is risky — but if you stay aware and keep correcting, you aren’t blamed.",
      "keywords": [
        "relapse and recovery",
        "repeating patterns",
        "danger zone",
        "caution",
        "no blame"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows its subject moving right in the centre (among those represented by the other divided lines), and yet returning alone (to his proper path).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：中行獨復。"
        }
      ],
      "normalized_meaning": "You walk the middle path and still choose to realign even if no one else does. Personal integrity overrides group drift.",
      "keywords": [
        "walk the middle path",
        "independent integrity",
        "return alone",
        "centered movement",
        "self-guided correction"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows the noble return of its subject. 1 here will be no ground for repentance,",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：敦復，無悔。"
        }
      ],
      "normalized_meaning": "A sincere, steady return to truth. This is morally solid and leaves nothing to apologize for.",
      "keywords": [
        "sincere repentance",
        "solid virtue",
        "mature leadership",
        "no regret",
        "stability"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, divided, shows its subject all astray on the subject of returning. There will be evil. There will be calamities and errors. If with his views he put the hosts in motion, the end will be a great defeat, whose issues will extend to the rulei of the state. Even in ten years he will not be able to repair the disaster, XXIV, Ffi symbolises the idea of returning, coming back or over again. 'I lie last hexagram showed us inferior prevailing over superior men, all that is good in nature and society yielding before what is bad. But change is the law of nature and society. When decay has reached its climax, recovery will begin to take place, in 10 we had one strong topmost line, and five weak lines below THE Wf) WANG HEXAGRAM.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：迷復，凶，有災眚。用行師，終有大敗，以其國君，凶。至於十年，不克征。"
        }
      ],
      "normalized_meaning": "Lost, refuses to come back. If you try to act from that delusion — especially leading others — it ends in ruin that can take years to recover from.",
      "keywords": [
        "refusing to return",
        "delusion",
        "disaster in action",
        "failed campaign",
        "long-term damage"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.549842Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 121,
      "leaf_end": 124,
      "page_candidates": [
        "1",
        "5",
        "214",
        "215",
        "3",
        "M",
        "216",
        "4",
        "218",
        "219",
        "6",
        "68"
      ],
      "page_confidence": 0.0
    }
  }
}