{
  "id": "hx25",
  "number": 25,
  "unicode_hexagram": "䷘",
  "name": "Innocence / No Falsehood (無妄, Wú Wàng)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Wfi Wang indicates great progress and success, while there will be advantage in being firm and it; here we have one strong line, and five weak lines above it, To illustrate the subject from what we see in nature,—Po is the hexa gram of the ninth month, in which the triumph of cold and decay in the year is nearly complete. It is complete in the tenth month, whose hexagram is Khwan EE EE; then follows our hex agram Ffi, belonging to the eleventh month, in which was the winter solstice when the sun turned back in his course, and moved with a constant regular progress towards the summer solstice. In harmony with these changes of nature are the changes in the political and social stale of a nation. There is nothing in the Yi to suggest the hope of a perfect society or kingdom that cannot be moved. The strong bottom line is the first of Jan, the trigram of move ment, and the upper trigram is Khwan, denoting docility and capa city. The strong returning line will meet with no distressing obstacle, and the weak lines will change before it into strong, and be as friends. The bright quality will be developed brighter and brighter from day to day, and month to month. The sentence, ‘ In seven days comes his return,’ occasions some perplexity. If the reader will refer to hexagrams 44,33, 12,20, 23, and 2, he will see that during the months denoted by those figures, the 5th, 6th, )th, 8th, ytb, and 10th, the yin lines have gradually been prevailing over the yang, until in Khwan (2) they have extruded them entirely from the lineal figure. Then comes our Ffi, as a seventh figure, In which the yang line begins to reassert itself, and from which it goes on to extrude the yin lines in their turn. Explained therefore of the months of the year, we have to take a day for a month. And something analogous—we cannot say exactly what—must have place in society and the state. iro correct. If (its subject and his action) be not correct, he will fall into errors, and it will not be advantageous for him to move in any direction. 1. The first line, undivided, shows its subject free from all insincerity. His advance will be accom panied with good fortune. 2. The second line, divided, shows one who reaps without having ploughed (that he might reap), and gathers the produce of his third year's fields without having cultivated them the first year for that end. To such a one there will be advantage in whatever direction he may move. 3. The third line, divided, shows calamity hap pening to one who is free from insincerityas in The concluding auspice or oracle to him who finds this Fd by divination is what we might expect. The subject of line 1 is of course the undivided line, meaning here, says .ffing-jze,‘ the way of the superior man.’ There must have been some deviation from that, or ‘returning' could not be spoken of. Line 2 is in its proper place, and central; but it is weak. This is more than compensated for, however, by its adherence to line x, the fifth line not being a proper correlate. Hence the return of its subject is called excellent or admirable. Line 3 is weak, and in the uneven place of a strong line. It is the top line, moreover, of the trigram whose attribute is move ment. Hence the symbolism; but any evil issue may be prevented by a realisation of danger and by caution. Line 4 has its proper correlate in x ; different from all the other weak lines; and its course is different accordingly. f ^ ine 5 is in (he central place of honour, and the middle line of Khwan, denoting docility. Hence its auspice. Line 6 is weak; and being at the top of the hexagram, when its action of returning is all concluded, action on the part of its subject will lead to evils such as are mentioned. ‘ Ten years' seems to be a round number, signifying a long time, as in hexagram 3,2. THE Wt> WANG HEXAGRAM. Ill the case of an ox that has been tied up. A passer by finds it (and carries it off), while the people in the neighbourhood have the calamity (of being accused and apprehended). 4. The fourth line, undivided, shows (a case) in which, if its subject can remain firm and correct, there will be no error. 5. The fifth line, undivided, shows one who is free from insincerity, and yet has fallen ill. Let him not use medicine, and he will have occasion for joy (in his recovery). 6. The topmost line, undivided, shows its subject free from insincerity, yet sure to fall into error, if he take action. (His action) will not be advan tageous in any way. XXV. Wan g is the symbol of being reckless, and often of being insincere; W ft Wan g is descriptive of a state of entire freedom from such a condition; its subject is one who is entirely simple and sin cere. The quality is characteristic of the action of Heaven, and of the highest style of humanity. In this hexagram we have an essay on this noble attribute. An absolute rectitude is essential to it. The nearer one comes to the ideal of the quality, the more powerful will be bis influence, the greater his success. But let him see to it that he never swerve from being correct. The first line is strong; at the commencement of the inner trigram denoting movement, the action of its subject will very much characterise all the action set forth, and will itself be fortunate. Line 2 is weak, central, and in its correct place. The quality may be predicated of it in its highest degree. There is an entire freedom in its subject from selfish or mercenary motive. He is good simply for goodness' sake. And things are so constituted that his action will be successful. But calamity may also sometimes befal the best, and where there is this freedom from insincerity; and line 3 being weak, and in the place of an even line, lays its subject open to this misfortune. ‘The people of the neighbourhood’ are of course entirely innocent. Line 4 is the lowest in the trigram of strength, and x is not THE vf ICTNG.",
    "normalized_summary": "Act from clean intent and correct conduct. Don’t scheme or force outcomes. When you are aligned, momentum returns; when you’re not, any push misfires."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject free from all insincerity. His advance will be accom panied with good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：无妄，往吉。"
        }
      ],
      "normalized_meaning": "Move forward only from a clear, uncontrived place. Innocent advance meets favorable conditions.",
      "keywords": [
        "pure intent",
        "clean advance",
        "good fortune",
        "no ulterior motive",
        "green light"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows one who reaps without having ploughed (that he might reap), and gathers the produce of his third year's fields without having cultivated them the first year for that end. To such a one there will be advantage in whatever direction he may move.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：不耕穫，不菑畬，則利有攸往。"
        }
      ],
      "normalized_meaning": "Results arrive without manipulation. Accept the simple gains and proceed—benefit in any direction when you’re not forcing it.",
      "keywords": [
        "effortless yield",
        "non-forcing",
        "unexpected gain",
        "go any direction",
        "natural timing"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows calamity hap pening to one who is free from insincerityas in The concluding auspice or oracle to him who finds this Fd by divination is what we might expect. The subject of line 1 is of course the undivided line, meaning here, says .ffing-jze,‘ the way of the superior man.’ There must have been some deviation from that, or ‘returning' could not be spoken of. Line 2 is in its proper place, and central; but it is weak. This is more than compensated for, however, by its adherence to line x, the fifth line not being a proper correlate. Hence the return of its subject is called excellent or admirable. Line 3 is weak, and in the uneven place of a strong line. It is the top line, moreover, of the trigram whose attribute is move ment. Hence the symbolism; but any evil issue may be prevented by a realisation of danger and by caution. Line 4 has its proper correlate in x ; different from all the other weak lines; and its course is different accordingly. f ^ ine 5 is in (he central place of honour, and the middle line of Khwan, denoting docility. Hence its auspice. Line 6 is weak; and being at the top of the hexagram, when its action of returning is all concluded, action on the part of its subject will lead to evils such as are mentioned. ‘ Ten years' seems to be a round number, signifying a long time, as in hexagram 3,2. THE Wt> WANG HEXAGRAM. Ill the case of an ox that has been tied up. A passer by finds it (and carries it off), while the people in the neighbourhood have the calamity (of being accused and apprehended).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：无妄之災，或繫之牛。行人之得，邑人之災。"
        }
      ],
      "normalized_meaning": "Undeserved trouble can still occur. Stay innocent; don’t internalize blame for events outside your control.",
      "keywords": [
        "undeserved misfortune",
        "external factors",
        "innocence tested",
        "avoid self-blame",
        "contain fallout"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows (a case) in which, if its subject can remain firm and correct, there will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：可貞，无咎。"
        }
      ],
      "normalized_meaning": "Hold steady in rectitude. Staying true prevents mistakes as things shift around you.",
      "keywords": [
        "firm correctness",
        "self-command",
        "no blame",
        "stay the course",
        "stability"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows one who is free from insincerity, and yet has fallen ill. Let him not use medicine, and he will have occasion for joy (in his recovery).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：无妄之疾，勿藥有喜。"
        }
      ],
      "normalized_meaning": "Temporary setback despite innocence. Don’t over-treat or meddle; allow the natural correction and recovery.",
      "keywords": [
        "non-interference",
        "natural recovery",
        "patience",
        "benign setback",
        "trust the process"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, undivided, shows its subject free from insincerity, yet sure to fall into error, if he take action. (His action) will not be advan tageous in any way. XXV. Wan g is the symbol of being reckless, and often of being insincere; W ft Wan g is descriptive of a state of entire freedom from such a condition; its subject is one who is entirely simple and sin cere. The quality is characteristic of the action of Heaven, and of the highest style of humanity. In this hexagram we have an essay on this noble attribute. An absolute rectitude is essential to it. The nearer one comes to the ideal of the quality, the more powerful will be bis influence, the greater his success. But let him see to it that he never swerve from being correct. The first line is strong; at the commencement of the inner trigram denoting movement, the action of its subject will very much characterise all the action set forth, and will itself be fortunate. Line 2 is weak, central, and in its correct place. The quality may be predicated of it in its highest degree. There is an entire freedom in its subject from selfish or mercenary motive. He is good simply for goodness' sake. And things are so constituted that his action will be successful. But calamity may also sometimes befal the best, and where there is this freedom from insincerity; and line 3 being weak, and in the place of an even line, lays its subject open to this misfortune. ‘The people of the neighbourhood’ are of course entirely innocent. Line 4 is the lowest in the trigram of strength, and x is not THE vf ICTNG.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：无妄，行有眚，无攸利。"
        }
      ],
      "normalized_meaning": "Even with clean intent, acting now misfires. Stand down; forcing movement brings only loss.",
      "keywords": [
        "do not act",
        "misstep risk",
        "stand still",
        "no advantage",
        "restraint"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.550176Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 124,
      "leaf_end": 127,
      "page_candidates": [
        "218",
        "219",
        "6",
        "68",
        "220",
        "221",
        "3",
        "222",
        "223",
        "1",
        "224",
        "225",
        "14",
        "I"
      ],
      "page_confidence": 0.0
    }
  }
}