{
  "id": "hx26",
  "number": 26,
  "unicode_hexagram": "䷙",
  "name": "Great Accumulating / Taming Power of the Great (大畜, Dà Xù)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Under the conditions of Ti Khix it will be advan tageous to be firm and correct. (If its subject do not seek to) enjoy his revenues in his own family (without taking service at court), there will be good fortune. It will be advantageous for him to cross the great stream. 1. The first line, undivided, shows its subject in a position of peril. It will be advantageous for him to stop his advance. 2. The second line, undivided, shows a carriage with the strap under it removed. 3. The third line, undivided, shows its subject urging his way with good horses. It will be ad vantageous for him to realise the difficulty (of his course), and to be firm and correct, exercising him self daily in his charioteering and methods of defence; a proper correlate, nor is the fourth the place for a strong line. Hence the paragraph must be understood as a caution, Line 5 is strong, in the central place of honour, and has its proper correlate in 2. Hence its subject must possess the quality of the hexagram in perfection. And yet he shall be sick or in distress. But he need not be anxious, Without his efforts a way of escape for him will be opened. Line 6 is at the top of the hexagram, and comes into the field when the action has run its course, He should be still, and not initiate any fresh movement. SECT. I. THE tA KBt HEXAGRAM. Ill then there will be advantage in whatever direction he may advance. 4. The fourth line, divided, shows the young bull, (and yet) having the piece of wood over his horns. There will be great good fortune. 5. The fifth line, divided, shows the teeth of a castrated hog. There will be good fortune. 6. The sixth line, undivided, shows its subject (as) in command of the firmament of heaven, There will be progress. XXVI. WM has two meanings. It is the symbol of restraint, and of accumulation, What is repressed and restrained accumu lates its strength and increases its volume. Both these meanings are found in the treatise on the Thwan; the exposition of the Great Symbolism has for its subject the accumulation of virtue. The different lines are occupied with the repression or restraint of move ment. The first three lines receive that repression, the upper three exercise it, The accumulation to which all tends is that of virtue; and hence the name of Tfi, Kh% ‘the Great Accumulation.’ What the Thwan teaches, is that he who goes about to accumulate his virtue must be firm and correct, and may then, engaging in the public service, enjoy the king's grace, and under take the most difficult enterprises. Line 1 is subject to the repression of 4, which will be increased if he try to advance. It is better for him to halt. Line 2 is liable to the repression of 5, and stops its advance of itself, its subject having the wisdom to do so through its position in the central place. The strap below, when attached to the axle, made the carriage stop; he himself acts that part. Line 3 is the last of WAien, and responds to the sixth line, the last of Kan, above, But as they are both strong, the latter does not exert its repressive force. They advance rapidly together; but the position is perilous for 3. By firmness and caution, how ever, its subject will escape the peril, and the issue will be good. The young bull in line 4 has not yet got horns. The attaching to their rudiments the piece of wood to prevent him from goring is an instance of extraordinary precaution; and precaution is always good. THE Yl KING.",
    "normalized_summary": "Store power and virtue. Halt impulsive motion, train, and gather resources. Decline comfort and accept duty; then you can take on great crossings."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject in a position of peril. It will be advantageous for him to stop his advance.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：有厲，利已。"
        }
      ],
      "normalized_meaning": "Stop before danger. Standing down preserves strength and prevents escalation.",
      "keywords": [
        "halt",
        "risk awareness",
        "self-restraint",
        "preserve strength",
        "caution"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows a carriage with the strap under it removed.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：輿說輹。"
        }
      ],
      "normalized_meaning": "Apply a deliberate brake. A self-imposed stop prevents premature movement.",
      "keywords": [
        "pause mechanism",
        "self-control",
        "delay is wise",
        "prevention",
        "restraint"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows its subject urging his way with good horses. It will be ad vantageous for him to realise the difficulty (of his course), and to be firm and correct, exercising him self daily in his charioteering and methods of defence; a proper correlate, nor is the fourth the place for a strong line. Hence the paragraph must be understood as a caution, Line 5 is strong, in the central place of honour, and has its proper correlate in 2. Hence its subject must possess the quality of the hexagram in perfection. And yet he shall be sick or in distress. But he need not be anxious, Without his efforts a way of escape for him will be opened. Line 6 is at the top of the hexagram, and comes into the field when the action has run its course, He should be still, and not initiate any fresh movement. SECT. I. THE tA KBt HEXAGRAM. Ill then there will be advantage in whatever direction he may advance.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：良馬逐，利艱貞。曰閑輿衛，利有攸往。"
        }
      ],
      "normalized_meaning": "Power wants to run. Accept hardship, train daily, and discipline the drive—then movement prospers.",
      "keywords": [
        "training",
        "disciplined power",
        "endurance",
        "prepared action",
        "advantage ahead"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows the young bull, (and yet) having the piece of wood over his horns. There will be great good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：童牛之牿，元吉。"
        }
      ],
      "normalized_meaning": "Muzzle raw force early. Preventive restraint brings great good fortune.",
      "keywords": [
        "early restraint",
        "safety guard",
        "prevent harm",
        "great good fortune",
        "prudence"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows the teeth of a castrated hog. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：豶豕之牙，吉。"
        }
      ],
      "normalized_meaning": "Strong tendencies are rendered harmless. Right restraint yields good fortune.",
      "keywords": [
        "neutralized threat",
        "control",
        "benign strength",
        "good fortune",
        "prudence"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, shows its subject (as) in command of the firmament of heaven, There will be progress. XXVI. WM has two meanings. It is the symbol of restraint, and of accumulation, What is repressed and restrained accumu lates its strength and increases its volume. Both these meanings are found in the treatise on the Thwan; the exposition of the Great Symbolism has for its subject the accumulation of virtue. The different lines are occupied with the repression or restraint of move ment. The first three lines receive that repression, the upper three exercise it, The accumulation to which all tends is that of virtue; and hence the name of Tfi, Kh% ‘the Great Accumulation.’ What the Thwan teaches, is that he who goes about to accumulate his virtue must be firm and correct, and may then, engaging in the public service, enjoy the king's grace, and under take the most difficult enterprises. Line 1 is subject to the repression of 4, which will be increased if he try to advance. It is better for him to halt. Line 2 is liable to the repression of 5, and stops its advance of itself, its subject having the wisdom to do so through its position in the central place. The strap below, when attached to the axle, made the carriage stop; he himself acts that part. Line 3 is the last of WAien, and responds to the sixth line, the last of Kan, above, But as they are both strong, the latter does not exert its repressive force. They advance rapidly together; but the position is perilous for 3. By firmness and caution, how ever, its subject will escape the peril, and the issue will be good. The young bull in line 4 has not yet got horns. The attaching to their rudiments the piece of wood to prevent him from goring is an instance of extraordinary precaution; and precaution is always good. THE Yl KING.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：何天之衢，亨。"
        }
      ],
      "normalized_meaning": "The way opens wide. With power well-stored and guided, you move freely and succeed.",
      "keywords": [
        "open thoroughfare",
        "release of power",
        "progress",
        "great passage",
        "success"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.550479Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 127,
      "leaf_end": 130,
      "page_candidates": [
        "224",
        "225",
        "14",
        "I",
        "226",
        "227",
        "16",
        "1",
        "229",
        "20",
        "230",
        "22",
        "9",
        "2"
      ],
      "page_confidence": 0.0
    }
  }
}