{
  "id": "hx33",
  "number": 33,
  "unicode_hexagram": "䷠",
  "name": "Retreat / Strategic Withdrawal (遯, Dùn)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "1 hun indicates successful progress (in its circum stances). To a small extent it will (still) be advan tageous to be firm and correct. 1. The first line, divided, shows a retiring tail. The position is perilous. No movement in any direction should be made. being. The sixth Appendix makes it a sequel of the previous figure. As that treats, it is said, of the relation between husband and wife, so this treats of the continuous observance of their respective duties. Hsien, we saw, is made up of Ivan, the symbol of the youngest son, and Tui, the symbol of the youngest daughter, attraction and influence between the sexes being strongest in youth. II&ng consists of Sun, ‘the oldest daughter' and K an, the oldest son. The couple are more staid. The wife occupies the lower place; and the relation between them is marked by her submission, This is sound doctrine, especially from a Chinese point of view; bull doubt whether such application of his teaching was in the mind of king' Wfin. Given two parties, an inferior and superior in correlation. If both be continuously observant of what is correct, the inferior being also submissive, and the superior firm, good fortune and progress may be predicated of their course. Line 1 has a proper correlate in 4; but between them are two strong lines; and it is itself weak. These two conditions are against its subject receiving much help from the subject of 4. He should be quiet, and not forward for action. Line 2 is strong, but in the place of a weak line. Its position, however, being central, and its subject holding fast to the due mean, the unfavourable condition of an even place is more than counteracted. Line 3 is strong, and in its proper place; but being beyond the centre of the trigram, its subject is too strong, and coming under THE yf KING. 2. The second line, divided, shows its subject holding (his purpose) fast as if by a (thong made from the) hide of a yellow ox, which cannot be broken. 3. The third line, undivided, shows one retiring but bound,—to his distress and peril. (If he were to deal with his binders as in) nourishing a servant or concubine, it would be fortunate for him. 4. The fourth line, undivided, shows its subject retiring notwithstanding his likings. In a superior man this will lead to good fortune; a small man cannot attain to this. 5. The fifth line, undivided, shows its subject retiring.in an admirable way. With firm correctness there will be good fortune. 6. The sixth line, undivided, shows its subject retiring in a noble way. It will be advantageous, in every respect. the attraction of his correlate in 6, he is supposed to be ready to abandon his place and virtue. He may try to be firm and cor rect, but circumstances are adverse to him. Line 4 is strong in the place of a weak line, and suggests the symbolism of the duke of Zau. The weak 5th line responds to the strong 2nd, and may be sup posed to represent a wife conscious of her weakness, and docilely submissive; which is good. A husband, however, and a man gene rally, has to assert himself, and lay down the rule of what is right. In line 6 the principle of perseverance has run its course; the motive power of Zan is exhausted. The line itself is weak. The violent efforts of its subject can only lead to evil. XXXIII. Thun is the hexagram of the sixth month; the yin influence is represented by two weak lines, and has made good its footing in the year, The figure thus suggested to king Wan the growth of small and unprincipled men in the state, before whose advance superior men were obliged to retire. This is the theme of his essay,—how, 'when small men multiply and increase in power, sect. ir. THE TA KWANG HEXAGRAM. I29",
    "normalized_summary": "Strategic withdrawal. You pull back to preserve strength, authority, and position rather than wasting force in a losing situation. Retreat done with discipline is not cowardice — it’s wisdom. Chasing, clinging, or retreating in panic invites danger. Calm, dignified withdrawal creates long-term advantage."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows a retiring tail. The position is perilous. No movement in any direction should be made. being. The sixth Appendix makes it a sequel of the previous figure. As that treats, it is said, of the relation between husband and wife, so this treats of the continuous observance of their respective duties. Hsien, we saw, is made up of Ivan, the symbol of the youngest son, and Tui, the symbol of the youngest daughter, attraction and influence between the sexes being strongest in youth. II&ng consists of Sun, ‘the oldest daughter' and K an, the oldest son. The couple are more staid. The wife occupies the lower place; and the relation between them is marked by her submission, This is sound doctrine, especially from a Chinese point of view; bull doubt whether such application of his teaching was in the mind of king' Wfin. Given two parties, an inferior and superior in correlation. If both be continuously observant of what is correct, the inferior being also submissive, and the superior firm, good fortune and progress may be predicated of their course. Line 1 has a proper correlate in 4; but between them are two strong lines; and it is itself weak. These two conditions are against its subject receiving much help from the subject of 4. He should be quiet, and not forward for action. Line 2 is strong, but in the place of a weak line. Its position, however, being central, and its subject holding fast to the due mean, the unfavourable condition of an even place is more than counteracted. Line 3 is strong, and in its proper place; but being beyond the centre of the trigram, its subject is too strong, and coming under THE yf KING.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：遯尾，厲，勿用有攸往。"
        }
      ],
      "normalized_meaning": "You’re late to withdraw and exposed in the open. It’s dangerous. Don’t force movement now — any attempt to act just increases risk.",
      "keywords": [
        "late retreat",
        "exposed position",
        "high risk",
        "do not advance",
        "stall and survive"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows its subject holding (his purpose) fast as if by a (thong made from the) hide of a yellow ox, which cannot be broken.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：執之用黃牛之革，莫之勝說。"
        }
      ],
      "normalized_meaning": "You bind yourself to restraint. You refuse to be provoked or chased back into the fight. Your resolve holds, and cannot be pulled apart.",
      "keywords": [
        "disciplined restraint",
        "unyielding resolve",
        "refusing provocation",
        "controlled withdrawal",
        "unbreakable hold"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows one retiring but bound,—to his distress and peril. (If he were to deal with his binders as in) nourishing a servant or concubine, it would be fortunate for him.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：係遯，有疾厲，畜臣妾吉。"
        }
      ],
      "normalized_meaning": "You’re trying to withdraw but still entangled. Stress and danger are real. The move here is: keep loyal support, manage what’s close, don’t posture grandly. That’s what keeps it favorable.",
      "keywords": [
        "entangled retreat",
        "stress load",
        "manage inner circle",
        "protect dependents",
        "contained good fortune"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows its subject retiring notwithstanding his likings. In a superior man this will lead to good fortune; a small man cannot attain to this.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：好遯，君子吉，小人否。"
        }
      ],
      "normalized_meaning": "Voluntary retreat. The principled person steps back cleanly and thrives. The petty person can’t let go and therefore suffers.",
      "keywords": [
        "honorable withdrawal",
        "choosing to step back",
        "virtue vs ego",
        "superior man prospers",
        "small man fails"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows its subject retiring.in an admirable way. With firm correctness there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：嘉遯，貞吉。"
        }
      ],
      "normalized_meaning": "Refined retreat. You withdraw with dignity and moral clarity, not bitterness. Holding that stance brings good fortune.",
      "keywords": [
        "dignified exit",
        "moral clarity",
        "clean disengagement",
        "integrity preserved",
        "good fortune"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, shows its subject retiring in a noble way. It will be advantageous, in every respect. the attraction of his correlate in 6, he is supposed to be ready to abandon his place and virtue. He may try to be firm and cor rect, but circumstances are adverse to him. Line 4 is strong in the place of a weak line, and suggests the symbolism of the duke of Zau. The weak 5th line responds to the strong 2nd, and may be sup posed to represent a wife conscious of her weakness, and docilely submissive; which is good. A husband, however, and a man gene rally, has to assert himself, and lay down the rule of what is right. In line 6 the principle of perseverance has run its course; the motive power of Zan is exhausted. The line itself is weak. The violent efforts of its subject can only lead to evil. XXXIII. Thun is the hexagram of the sixth month; the yin influence is represented by two weak lines, and has made good its footing in the year, The figure thus suggested to king Wan the growth of small and unprincipled men in the state, before whose advance superior men were obliged to retire. This is the theme of his essay,—how, 'when small men multiply and increase in power, sect. ir. THE TA KWANG HEXAGRAM. I29",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：肥遯，無不利。"
        }
      ],
      "normalized_meaning": "Master-level withdrawal. You exit with full strength intact, on your own terms. This kind of retreat actually upgrades your long-term position.",
      "keywords": [
        "strategic exit",
        "power preserved",
        "complete disengagement",
        "advantage in all respects",
        "long-game positioning"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.553161Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 149,
      "leaf_end": 152,
      "page_candidates": [
        "268",
        "269",
        "M",
        "270",
        "271",
        "4",
        "1",
        "272",
        "273",
        "5",
        "2",
        "274",
        "275",
        "6"
      ],
      "page_confidence": 0.0
    }
  }
}