{
  "id": "hx35",
  "number": 35,
  "unicode_hexagram": "䷢",
  "name": "Progress / Advancement (晉, Jìn)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "In 3 in we see a prince who secures the tranquil lity (of the people) presented on that account with numerous horses (by the king), and three times in a day received at interviews. This is the lesson of the hexagram, as sententiously expressed in the Thwan. Line x is strong, in its correct place, and also the first line in Z/rien, the hexagram of strength, and the first line in Ta Zwang, The idea of the figure might seem to be concentrated in it; and hence we have it symbolised by ‘strength in the toes,’ or ‘advancing.’ But such a measure is too bold to be undertaken by one in the lowest place, and moreover there is no proper correlate in 4. Hence comes the evil auspice. Line 2 is strong, but the strength is tempered by its being in an even place, instead of being excited by it, as might be feared. Then the place is that in the centre. With firm correctness there will be good fortune, Line 3 is strong, and in its proper place. It is at the top more over of ZZen, A small man so symbolled will use his strength to the utmost; but not so the superior man. For him the position is beyond the safe middle, and he will be cautious ; and not injure himself, like the ram, by exerting his strength. Line 4 is still strong, but in the place of a weak line; and this gives occasion to the cautions with which the symbolism com mences, The subject of the line going forward thus cautious!)', his strength will produce good effects, such as are described, Line 5 is weak, and occupies a central place, Its subject will cease therefore to exert his strength; but this hexagram does not forbid the employment of strength, but would only control and THE Y$ ICING. THE 3 IN HEXAGRAM. 1. The first line, divided, shows one wishing to advance, and (at the same time) kept back. Let him be firm and correct, and there will be good fortune. If trust be not reposed in him, let him maintain a large and generous mind, and there will be no error. 2. The second line, divided, shows its subject with the appearance of advancing, and yet of being sorrowful. If he be firm and correct, there will be good fortune. He will receive this great blessing from his grandmother. 3. The third line, divided, shows its subject trusted by all (around him). All occasion for re pentance will disappear. 4. The fourth line, undivided, shows its subject with the appearance of advancing, but like a marmot. However firm and correct he may be, the position is one of peril. 5. The fifth line, divided, shows how all occasion for repentance disappears (from its subject). (But) let him not concern himself about whether he shall fail or succeed. To advance will be fortunate, and in every way advantageous. 6. The topmost line, undivided, shows one ad vancing his horns. But he only uses them to punish the (rebellious people of his own) city. The position direct it, All that is said about him is that he 'will give no occasion for repentance. Line 6 being at the top of Ain, the symbol of movement, and at the top of Td ATwang, its subject may be expected to be active in exerting his strength; and through his weakness, the result would be as described. But he becomes conscious of his weakness, re flects and rests, and good fortune results, as he desists from* the prosecution of his unwise efforts. sect, it, is perilous, but there will be good fortune. (Yet) however firm and correct he may be, there will be occasion for regret. XXXV. 1 he Thwan of this hexagram expresses its subject more fully and plainly than that of any of the previous thirty-four, It is about a feudal prince whose services to the country have made him acceptable to his king. The king’s favour has been shown to him by gifts and personal attentions such as form the theme of more than one ode in the Shih; see especially III, iii, y. The symbolism of the lines dimly indicates the qualities of such a prince. Bin means ‘ to advance.’ Hexagrams 46 and 53 agree with this in being called by names that indicate progress and ad vance. The advance in Bin is like that of the sun, ‘the shining light, shining more and more to the perfect day.’ Line 1 is weak, and in the lowest place, and its correlate in 4 is neither central nor in its correct position. This indicates the small and obstructed beginnings of his subject. But by his firm correct ness he pursues the way to good fortune; and though the king does not yet believe in him, he the more pursues his noble course. Line 2 is weak, and its correlate in 5 is also weak. Its subject therefore has still to mourn in obscurity. But his position is central and correct, and he holds on his way, till success comes ere long. The symbolism says he receives it ‘from his grand mother;’ and readers will be startled by the extraordinary state ment, as I was when I first read it. Literally the Text says ‘the king's mother/ as P, Regis rendered it,—‘ Istam magnam felicitatem a matre regis recipit.’ He also tries to give the name a historical referenceto TMi-A'iang, the grandmother of king Wan; Thdi- ^hn, his mother; or to Thdi-sze, hi9 wife, and the mother of king Wfi and the duke of A!u, all famous in Chinese history, and cele brated in the Shih. But ‘Icing’s father’ and ‘king’s mother’ are well-known Chinese appellations for ‘grandfather’ and ‘grand mother.’ This is the view given on the passage, by Alang-jze, Affi HsJ, and the Khang-hsi editors, the latter of whom, indeed, account for the use of the name, instead of ‘deceased mother/ which we find in hexagram 62, by the regulations observed in the ancestral temple. These authorities, moreover, all agree in saying that the name points us to line 5, the correlate of 2, and ‘the lord of the hexagram.’ Now the subject of line g is the sovereign, who at length acknowledges the worth of the feudal lord, and gives him *34",
    "normalized_summary": "Open rise and recognition. True progress here is public, supported by higher authority, and tied to service — not raw self-promotion. You advance because your presence brings stability and benefit, so the center calls you in and equips you. The warning: ego-driven or sneaky advancement is dangerous, and forceful, militant assertion at the top invites regret."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows one wishing to advance, and (at the same time) kept back. Let him be firm and correct, and there will be good fortune. If trust be not reposed in him, let him maintain a large and generous mind, and there will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：晉如，摧如，貞吉。罔孚，裕無咎。"
        }
      ],
      "normalized_meaning": "You’re ready to move forward but you’re blocked or overlooked. Don’t get bitter. Keep integrity, keep a generous heart even if others don’t trust you yet. That protects you and leads to good fortune.",
      "keywords": [
        "blocked progress",
        "patience under delay",
        "integrity under doubt",
        "magnanimity",
        "good fortune"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows its subject with the appearance of advancing, and yet of being sorrowful. If he be firm and correct, there will be good fortune. He will receive this great blessing from his grandmother.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：晉如，愁如，貞吉。受茲介福，於其王母。"
        }
      ],
      "normalized_meaning": "You’re moving ahead, but still anxious and not fully recognized. Stay correct. Endorsement and support from above (the one with authority to bless you) is coming.",
      "keywords": [
        "quiet advancement",
        "anxiety in success",
        "patience rewarded",
        "support from higher authority",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows its subject trusted by all (around him). All occasion for re pentance will disappear.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：眾允，悔亡。"
        }
      ],
      "normalized_meaning": "Collective confidence forms around you. Your alignment with others erases second-guessing and regret.",
      "keywords": [
        "earned trust",
        "group alignment",
        "social credibility",
        "no regret",
        "shared purpose"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows its subject with the appearance of advancing, but like a marmot. However firm and correct he may be, the position is one of peril.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：晉如碩鼠，貞厲."
        }
      ],
      "normalized_meaning": "Advancing in a furtive, rodent-like way — sneaky, self-protective, half-exposed. Even if you think you’re in the right, this style is dangerous and invites suspicion.",
      "keywords": [
        "stealthy ambition",
        "bad optics",
        "peril",
        "mismatch to noble role",
        "integrity under threat"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows how all occasion for repentance disappears (from its subject). (But) let him not concern himself about whether he shall fail or succeed. To advance will be fortunate, and in every way advantageous.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：悔亡，失得勿恤，往吉無不利。"
        }
      ],
      "normalized_meaning": "You’re aligned with the mandate. Don’t obsess over winning or losing. Move forward in service; everything favors you.",
      "keywords": [
        "mandated advance",
        "detachment from outcome",
        "service to the whole",
        "good fortune",
        "all benefits"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, undivided, shows one ad vancing his horns. But he only uses them to punish the (rebellious people of his own) city. The position direct it, All that is said about him is that he 'will give no occasion for repentance. Line 6 being at the top of Ain, the symbol of movement, and at the top of Td ATwang, its subject may be expected to be active in exerting his strength; and through his weakness, the result would be as described. But he becomes conscious of his weakness, re flects and rests, and good fortune results, as he desists from* the prosecution of his unwise efforts. sect, it, is perilous, but there will be good fortune. (Yet) however firm and correct he may be, there will be occasion for regret. XXXV. 1 he Thwan of this hexagram expresses its subject more fully and plainly than that of any of the previous thirty-four, It is about a feudal prince whose services to the country have made him acceptable to his king. The king’s favour has been shown to him by gifts and personal attentions such as form the theme of more than one ode in the Shih; see especially III, iii, y. The symbolism of the lines dimly indicates the qualities of such a prince. Bin means ‘ to advance.’ Hexagrams 46 and 53 agree with this in being called by names that indicate progress and ad vance. The advance in Bin is like that of the sun, ‘the shining light, shining more and more to the perfect day.’ Line 1 is weak, and in the lowest place, and its correlate in 4 is neither central nor in its correct position. This indicates the small and obstructed beginnings of his subject. But by his firm correct ness he pursues the way to good fortune; and though the king does not yet believe in him, he the more pursues his noble course. Line 2 is weak, and its correlate in 5 is also weak. Its subject therefore has still to mourn in obscurity. But his position is central and correct, and he holds on his way, till success comes ere long. The symbolism says he receives it ‘from his grand mother;’ and readers will be startled by the extraordinary state ment, as I was when I first read it. Literally the Text says ‘the king's mother/ as P, Regis rendered it,—‘ Istam magnam felicitatem a matre regis recipit.’ He also tries to give the name a historical referenceto TMi-A'iang, the grandmother of king Wan; Thdi- ^hn, his mother; or to Thdi-sze, hi9 wife, and the mother of king Wfi and the duke of A!u, all famous in Chinese history, and cele brated in the Shih. But ‘Icing’s father’ and ‘king’s mother’ are well-known Chinese appellations for ‘grandfather’ and ‘grand mother.’ This is the view given on the passage, by Alang-jze, Affi HsJ, and the Khang-hsi editors, the latter of whom, indeed, account for the use of the name, instead of ‘deceased mother/ which we find in hexagram 62, by the regulations observed in the ancestral temple. These authorities, moreover, all agree in saying that the name points us to line 5, the correlate of 2, and ‘the lord of the hexagram.’ Now the subject of line g is the sovereign, who at length acknowledges the worth of the feudal lord, and gives him *34",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：晉其角，維用伐邑，厲吉無咎，貞吝。"
        }
      ],
      "normalized_meaning": "Power peaks and shows itself as force. You assert authority and strike down disorder close to home. It works — but it’s risky, and even if you’re justified, there’s a cost and a lingering aftertaste.",
      "keywords": [
        "forceful assertion",
        "crackdown",
        "local authority",
        "dangerous success",
        "lingering regret"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.554053Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 155,
      "leaf_end": 158,
      "page_candidates": [
        "i",
        "1",
        "6",
        "I",
        "282",
        "283",
        "12",
        "284",
        "285",
        "14",
        "287"
      ],
      "page_confidence": 0.0
    }
  }
}