{
  "id": "hx36",
  "number": 36,
  "unicode_hexagram": "䷣",
  "name": "Darkening of the Light / Injury to Brightness (明夷, Míng Yí)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Ming 1 indicates that (in the circumstances which it denotes) it will be advantageous to realise the the great blessing. The ‘New Digest of Comments on the Yi (1686),’ in its paraphrase of the line, has, ‘He receives at last this great blessing from the mild and compliant ruler.’ I am not sure that ‘motherly king' would not be the best and fairest translation of the phrase. Canon McClatchie has a very astonishing note on the name, which he renders ‘Imperial Mother’ (p. 164):—‘That is, the wife of Imperial Heaven (Juno), who occupies the “ throne of the dia gram,\" viz. the fifth stroke, which is soft and therefore feminine. She is the Great Ancestress of the human race. See Imp. Ed. vol. iv, Sect, v, p. 25, Com.’ Why such additions to the written word? Line 3 is weak, and in an odd place; but the subjects of 1 and 2 are possessed by the same desire to advance as the subject of this. A common trust and aim possess them; and hence the not unfavourable auspice. Line 4 is strong, but it is in an even place, nor is it central. It suggests the idea of a marmot (? or rat), stealthily advancing. Nothing could be more opposed to the ideal of the feudal lord in the hexagram. In line 5 that lord and his intelligent sovereign meet happily. He holds on his right course, indifferent as to results, but things are so ordered that he is, and will continue to be, crowned with success. Line_6 is strong, and suggests the idea of its subject to the last continuing h,s advance, and that not only with firm correctness, te«h Wng force. The W are ao enrblem of threatening “ d ^ “ ,hem ™ and against the rebellions there, that such „ prince should have any occasion to use force is matter for regret. \" THE MING i HEXAGRAM. difficulty (of the position), and maintain firm cor rectness. 1. The first line, undivided, shows its subject, (in the condition indicated by) Ming 1 , flying, but with drooping wings. When the superior man (is re volving) his going away, he may be for three days without eating. Wherever he goes, the people there may speak (derisively of him). 2. The second line, divided, shows its subject, (in the condition indicated by) Ming !, wounded in the left thigh. He saves himself by the strength of a (swift) horse; and is fortunate. 3. The third line, undivided, shows its subject, (in the condition indicated by) Ming I, hunting in the south, and taking the great chief (of the dark ness). He should not be eager to make (all) correct (at once). 4. The fourth line, divided, shows its subject (just) entered into the left side of the belly (of the dark land). (But) he is able to carry out the mind appro priate (in the condition indicated by) Ming I, quitting the gate and courtyard (of the lord of darkness). 5. The fifth line, divided, shows how the count of Kl fulfilled the condition indicated by Ming 1 . It will be advantageous to be firm and correct. 6. The sixth line, divided, shows the case where there is no light, but (only) obscurity. (Its subject) had at first ascended to (the top of) the sky; his future shall be to go into the earth. XXXVI. In this hexagram we have the representation of a good and intelligent minister or officer going forward in the service of his country, notwithstanding the occupancy of the throne by a weak 136 THE y! KING. text.",
    "normalized_summary": "The light is injured. A wise person sees the danger, hides their brilliance, and endures hardship without betraying their core. This is not the time to shine openly — it’s the time to survive with integrity under oppressive power so that the light can return later."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject, (in the condition indicated by) Ming 1 , flying, but with drooping wings. When the superior man (is re volving) his going away, he may be for three days without eating. Wherever he goes, the people there may speak (derisively of him).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：明夷于飛，垂其翼。君子于行，三日不食，有攸往，主人有言。"
        }
      ],
      "normalized_meaning": "You’re under threat and have to escape quietly. You lower your profile, go hungry, get slandered. The work is to endure humiliation without blowing your cover.",
      "keywords": [
        "exile under suspicion",
        "concealed brilliance",
        "austerity and hunger",
        "public slander",
        "survival mode"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows its subject, (in the condition indicated by) Ming !, wounded in the left thigh. He saves himself by the strength of a (swift) horse; and is fortunate.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：明夷，夷于左股，用拯馬壯，吉。"
        }
      ],
      "normalized_meaning": "You’ve been hurt in hostile conditions, but you still have the means to get out fast. Quick, decisive withdrawal saves you.",
      "keywords": [
        "injury",
        "swift escape",
        "self-rescue",
        "using available strength",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows its subject, (in the condition indicated by) Ming I, hunting in the south, and taking the great chief (of the dark ness). He should not be eager to make (all) correct (at once).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：明夷于南狩，得其大首，不可疾貞。"
        }
      ],
      "normalized_meaning": "You confront the main source of corruption and strike effectively. But don’t try to fix everything overnight — don’t expose yourself by pushing total reform too fast.",
      "keywords": [
        "targeted strike",
        "confronting corruption",
        "decisive capture",
        "don’t rush reform",
        "measured justice"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows its subject (just) entered into the left side of the belly (of the dark land). (But) he is able to carry out the mind appro priate (in the condition indicated by) Ming I, quitting the gate and courtyard (of the lord of darkness).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：入于左腹，獲明夷之心，于出門庭。"
        }
      ],
      "normalized_meaning": "You are deep inside enemy territory, surrounded by oppression. You keep inner clarity and quietly extract yourself. Survival here means moving from the inside out without betraying yourself.",
      "keywords": [
        "operating under oppression",
        "covert integrity",
        "escape from within",
        "quiet resolve",
        "no open defiance"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows how the count of Kl fulfilled the condition indicated by Ming 1 . It will be advantageous to be firm and correct.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：箕子之明夷，利貞。"
        }
      ],
      "normalized_meaning": "The noble minister under a corrupt ruler hides his brilliance but does not betray his virtue. This is the model: endure, remain correct, and live to carry wisdom forward.",
      "keywords": [
        "righteous endurance",
        "loyalty without compliance",
        "moral firmness",
        "hidden wisdom",
        "advantage in integrity"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, divided, shows the case where there is no light, but (only) obscurity. (Its subject) had at first ascended to (the top of) the sky; his future shall be to go into the earth. XXXVI. In this hexagram we have the representation of a good and intelligent minister or officer going forward in the service of his country, notwithstanding the occupancy of the throne by a weak 136 THE y! KING. text.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：不明晦，初登于天，後入于地。"
        }
      ],
      "normalized_meaning": "Total blackout. Once visible and high, now you’re forced completely underground. This is the end stage of suppression: the light withdraws into secrecy to survive.",
      "keywords": [
        "complete obscurity",
        "fall from visibility",
        "going underground",
        "end of a cycle",
        "preserving the light in darkness"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.554468Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 158,
      "leaf_end": 161,
      "page_candidates": [
        "1",
        "287",
        "6",
        "288",
        "289",
        "17",
        "I",
        "290",
        "291",
        "5",
        "292",
        "293",
        "21"
      ],
      "page_confidence": 0.0
    }
  }
}