{
  "id": "hx41",
  "number": 41,
  "unicode_hexagram": "䷨",
  "name": "Decrease / Reduction (損, Sǔn)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "In (what is denoted by) Sun, if there be sincerity (in him who employs it), there will be great good fortune freedom from error; firmness and correct ness that can be maintained; and advantage in every further operations be necessary, let them be carried through with out delay. Nolhingissaidin the Thwan about the discountenancing and removal of small men,—unworthy ministers or officers; but that subject appears in more than one of the lines. There is a weak line, instead of a strong, in the first place; but this is compensated for by its strong correlate in 4. M Hsi says he does not understand the symbolism under line 2. The place is even, but the line itself is strong; the strength there fore is modified or tempered. And 2 is the correlate of the ruler in 5. We are to look to its subject therefore for a minister striving to realise the idea of the hexagram, and pacify the subdued king dom. He becomes a hunter, and disposes of unworthy men, represented by 'the three foxes.’ He also gets the yellow arrows,— the instruments used in war or in hunting, whose colour is ‘correct,’ and whose form is ‘ straight.’ His firm correctness will be good. Line 3 is weak, when it should be strong; and occupying, as it does, the topmost place of the lower trigram, it suggests the symbolism of a porter in a carriage. People will say, ‘ How did he get there f The things cannot be his own.’ And robbers will attack and plunder him. The subject of the line cannot protect himself, nor accomplish anything good. What is said on the fourth line appears in the form of an address to its subject, The line is strong in an even place, and 1, its corre late, is weak in an odd place. Such a union will not be productive of good. In the symbolism 1 becomes the toe of the subject of 4. How the friend or friends, who are to come to him on the removal of this toe, are represented, I do not perceive. Line 5 is weak in an odd place; but the place is that of the ruler, to whom it belongs to perfect the idea of the hexagram by SECT. II. THE SUN HEXAGRAM, I 47 • movement that shall be made. In what shall this (sincerity in the exercise of Sun) be employed? (Even) in sacrifice two baskets of grain, (though there be nothing else), may be presented. 1. The first line, undivided, shows its subject suspending his own affairs, and hurrying away (to help the subject of the fourth line). He will commit no error, but let him consider how far he should contribute of what is his (for the other). 2. The second line, undivided, shows that it will be advantageous for its subject to maintain a firm correctness, and that action on his part will be evil. He can give increase (to his correlate) without taking from himself. 3. The third line, divided, shows how of three men walking together, the number is diminished by one; and how one, walking, finds his friend. 4. The fourth line, divided, shows its subject diminishing the ailment under which he labours by making (the subject of the first line) hasten (to his help), and make him glad. There will be no error. 5. The fifth line, divided, shows parties adding to (the stores of) its subject ten pairs of tortoise shells, and accepting no refusal. There will be great good fortune. removing all that is contrary to the peace and good order of the kingdom. It will be his duty to remove especially all the small men represented by the divided lines, which he can do with the help of his strong correlate in 2. Then even the small men will change their ways, and repair to him. Line 6 is the highest line in the figure, but not the place of the ruler, Hence it appears as occupied by a feudal duke, who carries out the idea of the figure against small men, accoiding to the symbolism employed. I48 THE Y$ KING. TEXT. ___... . . I 6 . The topmost line, undivided, shows its subject j giving increase to others without taking from him- j self. There will be no error. With firm correct ness there will be good fortune. There will be advantage in every movement that shall be made. j He will find ministers more than can be counted by j their clans. XLI. The interpretation of this hexagram is encompassed with great difficulties. Sun is the symbol for the idea of diminishing or diminution; and what is said in Appendix I has made it to be accepted as teaching the duty of the subject to take of what is his and contribute to his ruler, or the expenses of the govern ment under which he lives; in other words, readily and cheerfully to pay his taxes. P. Regis says, ‘Sun seu (vectigalis causa) minuere .... est valde utileand Canon McClajtchie in translating Appendix I has‘Diminishing (by taxation for instance) . , , . is very lucky,' Possibly, king Wan may have seen in the figures the subject of taxation; but the symbolism of his son takes a much wider range. My own reading of the figure and Text comes near to the view of JOang-^ze, that ‘ every diminution and repression of what we have in excess to bring it into accordance with right and reason is comprehended under Sun.’ Let there be sincerity in doing this, and it will lead to the happiest results. It will lead to great success in great things; and if the correction, or it may be a contribution towards it, appear to be very small, yet it will be accepted;—as in the most solemn religious service. This is substantially the view of the hexagram approved by the I(hang-hsi editors. Line 1 is strong, and its correlate in 4 is weak. Its subject will wish to help the subject of 4; but will not leave anything of his own undone in doing so. Nor will he diminish of his own for the other without due deliberation. Line 2 is strong, and in the central place. But it is in the place of a weak line, and its subject should maintain his position without moving to help his correlate in 5. Maintaining his own firm cor- redness is the best way to help him. Paragraph 3 is to my mind full of obscurity. ATfi Hsf, adopting the v,ew in Appendix I, says that the lower trigram was originally A^ien, three undivided lines, like ‘three men walking together’ SF.CT. II. THE yf HEXAGRAM. 149",
    "normalized_summary": "Decrease, properly done, is sacred. You lessen yourself or your surplus to support what’s right — not out of shame, but out of sincerity. Even a very small, honest offering is powerful. The danger is showy sacrifice or reckless self-drain; the virtue is measured, willing contribution that restores balance and strengthens the whole."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject suspending his own affairs, and hurrying away (to help the subject of the fourth line). He will commit no error, but let him consider how far he should contribute of what is his (for the other).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：已事遄往，無咎，酌損之。"
        }
      ],
      "normalized_meaning": "You drop what you’re doing and rush to help. That’s not wrong — just make sure you only give what’s actually appropriate, not everything you have.",
      "keywords": [
        "urgent assistance",
        "self-sacrifice with limits",
        "no blame",
        "measured giving",
        "right timing"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows that it will be advantageous for its subject to maintain a firm correctness, and that action on his part will be evil. He can give increase (to his correlate) without taking from himself.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：利貞，征凶，弗損益之."
        }
      ],
      "normalized_meaning": "Hold your position. Don’t go charging out. You can still benefit the other side without hurting yourself or abandoning what’s right.",
      "keywords": [
        "stay centered",
        "don’t overextend",
        "quiet support",
        "correct stance",
        "avoid harmful action"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows how of three men walking together, the number is diminished by one; and how one, walking, finds his friend.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：三人行，則損一人；一人行，則得其友。"
        }
      ],
      "normalized_meaning": "Too many agendas create friction. When the group is trimmed, harmony appears. Sometimes decrease means letting one dynamic go so true companionship can emerge.",
      "keywords": [
        "crowd vs clarity",
        "shedding excess",
        "aligned partnership",
        "finding true ally",
        "social pruning"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows its subject diminishing the ailment under which he labours by making (the subject of the first line) hasten (to his help), and make him glad. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：損其疾，使遄有喜，無咎。"
        }
      ],
      "normalized_meaning": "Ask for help and let someone strong relieve your burden. There’s no shame in accepting support if it lightens real suffering and restores joy.",
      "keywords": [
        "seeking aid",
        "relief of hardship",
        "shared effort",
        "healing through support",
        "no blame"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows parties adding to (the stores of) its subject ten pairs of tortoise shells, and accepting no refusal. There will be great good fortune. removing all that is contrary to the peace and good order of the kingdom. It will be his duty to remove especially all the small men represented by the divided lines, which he can do with the help of his strong correlate in 2. Then even the small men will change their ways, and repair to him. Line 6 is the highest line in the figure, but not the place of the ruler, Hence it appears as occupied by a feudal duke, who carries out the idea of the figure against small men, accoiding to the symbolism employed. I48 THE Y$ KING. TEXT. ___... . . I 6 . The topmost line, undivided, shows its subject j giving increase to others without taking from him- j self. There will be no error. With firm correct ness there will be good fortune. There will be advantage in every movement that shall be made. j He will find ministers more than can be counted by j their clans. XLI. The interpretation of this hexagram is encompassed with great difficulties. Sun is the symbol for the idea of diminishing or diminution; and what is said in Appendix I has made it to be accepted as teaching the duty of the subject to take of what is his and contribute to his ruler, or the expenses of the govern ment under which he lives; in other words, readily and cheerfully to pay his taxes. P. Regis says, ‘Sun seu (vectigalis causa) minuere .... est valde utileand Canon McClajtchie in translating Appendix I has‘Diminishing (by taxation for instance) . , , . is very lucky,' Possibly, king Wan may have seen in the figures the subject of taxation; but the symbolism of his son takes a much wider range. My own reading of the figure and Text comes near to the view of JOang-^ze, that ‘ every diminution and repression of what we have in excess to bring it into accordance with right and reason is comprehended under Sun.’ Let there be sincerity in doing this, and it will lead to the happiest results. It will lead to great success in great things; and if the correction, or it may be a contribution towards it, appear to be very small, yet it will be accepted;—as in the most solemn religious service. This is substantially the view of the hexagram approved by the I(hang-hsi editors. Line 1 is strong, and its correlate in 4 is weak. Its subject will wish to help the subject of 4; but will not leave anything of his own undone in doing so. Nor will he diminish of his own for the other without due deliberation. Line 2 is strong, and in the central place. But it is in the place of a weak line, and its subject should maintain his position without moving to help his correlate in 5. Maintaining his own firm cor- redness is the best way to help him. Paragraph 3 is to my mind full of obscurity. ATfi Hsf, adopting the v,ew in Appendix I, says that the lower trigram was originally A^ien, three undivided lines, like ‘three men walking together’ SF.CT. II. THE yf HEXAGRAM. 149",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：或益之，十朋之龜弗克違，元吉。"
        }
      ],
      "normalized_meaning": "Others pour resources into you freely, insisting you receive them. This is real support, not a trap. Accepting blessing here is greatly fortunate.",
      "keywords": [
        "unexpected aid",
        "abundance offered",
        "generosity received",
        "prestige and trust",
        "great good fortune"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The topmost NINE, undivided, shows its subject giving increase to others without taking from himself. There will be no error. With firm correctness there will be good fortune. There will be advantage in every movement that shall be made. He will find ministers more than can be counted by their clans.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：弗損益之，無咎，貞吉，利有攸往，得臣無家。"
        }
      ],
      "normalized_meaning": "Highest form of Decrease: you can strengthen others without impoverishing yourself. This draws loyal helpers in numbers beyond counting, and your actions prosper everywhere.",
      "keywords": [
        "abundant leadership",
        "supporting others effortlessly",
        "loyal followers gather",
        "universal advantage",
        "firm correctness"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.556474Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 173,
      "leaf_end": 176,
      "page_candidates": [
        "316",
        "317",
        "41",
        "I",
        "31",
        "319",
        "42",
        "320",
        "321",
        "44",
        "1",
        "322",
        "323",
        "4",
        "6"
      ],
      "page_confidence": 0.0
    }
  }
}