{
  "id": "hx43",
  "number": 43,
  "unicode_hexagram": "䷪",
  "name": "Breakthrough / Decisive Declaration (夬, Guài)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Kw&i requires (in him who would fulfil its mean ing) the exhibition (of the culprit’s guilt) in the royal court, and a sincere and earnest appeal (for sym- so as to dispense benefits to, and increase the resources of all the people. Two indications are evident in the lines;—the strong line in the ruler’s seat, or the fifth line, and the weak line in the correlative place of 2. ■ Whether there be other indications in the figure or its component trigrams will be considered in dealing with the Appendixes. The writer might well say, on general grounds, of the ruler whom he had in mind, that he would be suc cessful in his enterprises and overcome the greatest difficulties. Line 1 is strong, but its low position might seem to debar its sub ject from any great enterprise. Favoured as he is, however, according to the general idea of the hexagram, and specially responding to the proper correlate in 4, it is natural that he should make a movement, and great success will make his rashness be forgotten. With paragraph 2 compare paragraph 5 of the preceding hexa gram. Line 2 is weak, but in the centre, and is the correlate of 5 . Friends give its subject the valuable gifts mentioned; ‘that is,’ says Kwo Yung (Sung dynasty), ‘men benefit him; the oracles of the divination are in his favour,—spirits, that is, benefit him; and finally, when the king sacrifices to God, He accepts. Heaven confers benefit from above.’ Line 3 is weak, neither central, nor in its correct position. It would seem therefore that its subject should have no increase given to him. But it is the time for giving increase, and the idea of his receiving it by means of evil things is put into the line. That such things serve for reproof and correction is well known to Chinese moralists. But the paragraph goes on also to caution and admonish. Line 4 is the place for a minister, near to that of the ruler. Its subject is weak, but his place is appropriate, and as he follows the THE YJ KING. pathy and support), with a consciousness of the peril (involved in cutting off the criminal). He should (also) make announcement in his own city, and show that it will not be well to have recourse at once to arms. (In this way) there will be advantage in whatever he shall go forward to. 1. The first line, undivided, shows its subject in (the pride of) strength advancing with his toes. He goes forward, but will not succeed. There will be ground for blame. 2. The second line, undivided, shows its subject full of apprehension and appealing (for sympathy and help). Late at night hostile measures may be (taken against him), but he need not be anxious about them. 3. The third line, undivided, shows its subject (about to advance) with strong (and determined) looks. There will be evil, (But) the superior man, bent on cutting off (the criminal), will walk alone and encounter the rain, (till he be hated by his proper associates) as if he were contaminated (by the others). (In the end) there will be no blame against him. due course, his ruler will listen to him, and he will be a support in the most critical movements. Changing the capital from place to place was frequent in the feudal times of China. That of Shang, which preceded ifau, was changed five times. Line 5 is strong, in its fitting position, and central. It is the seat of the ruler, who has his proper correlate in 2. Everything good, according to the conditions of the hexagram, therefore, may be said of him ;~as is done. Line 6 is also strong; but it should be weak. Occupying the topmost place of the figure, its subject will concentrate his powers in the increase of himself, and not think of benefiting those below him j and the consequence will be as described. SECT. 11, 4. The fourth line, undivided, shows one from whose buttocks the skin has been stripped, and who walks slowly and with difficulty. (If he could act) like a sheep led (after its companions), occasion for repentance would disappear. But though he hear these words, he will not believe them. 5. The fifth line, undivided, shows (the small men like) a bed of purslain, which ought to be uprooted with the utmost determination. (The subject of the line having such determination), his action, in harmony with his central position, will lead to no error or blame. 6. The sixth line, divided, shows its subject with out any (helpers) on whom to call. His end will be evil. XLIII. In Kwai we have the hexagram of the third month, when the last remnant, cold and dark, of winter, represented by the sixth line, is about to disappear before the advance of the warm and bright days of the approaching summer. In the yin line at the top king Win saw the symbol of a small or bad man, a feudal prince or high minister, lending his power to maintain a corrupt government, or, it might be, a dynasty that was waxen old and ready to vanish away; and in the five undivided lines he saw the representatives of good order, or, it might be, the dynasty which was to supersede the other. This then is the subject of the hexa gram,—how bad men, statesmen corrupt and yet powerful, are to be put out of the way. And he who would accomplish the task must do so by the force of his character more than by force of arms, and by producing a general sympathy on bis side. The Thwan says that he must openly denounce the criminal in the court, seek to awaken general sympathy, and at the same time go about his enterprise, conscious of its difficulty, and danger. Among his own adherents, moreover, as if it were in his own city, he must make it understood how unwillingly he takes up arms. Then let him go forward, and success will attend him. Line 1 is strong, the first line of that trigram, which expresses the idea of strength. But it is in the lowest place. The stage of i54 i j",
    "normalized_summary": "This is a decisive break. Corruption or harmful influence has to be called out publicly and removed — but with awareness of danger, not reckless force. You announce the truth openly, gather support, and act with firm justice. The aim is principled resolution, not personal rage or premature violence."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject in (the pride of) strength advancing with his toes. He goes forward, but will not succeed. There will be ground for blame.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：壯于前趾，往不勝為咎。"
        }
      ],
      "normalized_meaning": "Rushing ahead on raw force and ego — leading with your toes — fails. If you charge too fast just because you feel strong, you get blamed.",
      "keywords": [
        "impulsive advance",
        "overconfidence",
        "premature action",
        "failure risk",
        "blame"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows its subject full of apprehension and appealing (for sympathy and help). Late at night hostile measures may be (taken against him), but he need not be anxious about them.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：惕號，莫夜有戎，勿恤。"
        }
      ],
      "normalized_meaning": "You raise the alarm and call for support. Enemies may move under cover of night, but if you stay alert and sincere, you don’t actually need to panic.",
      "keywords": [
        "alertness",
        "calling for aid",
        "looming threat",
        "courage under pressure",
        "do not fear"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows its subject (about to advance) with strong (and determined) looks. There will be evil, (But) the superior man, bent on cutting off (the criminal), will walk alone and encounter the rain, (till he be hated by his proper associates) as if he were contaminated (by the others). (In the end) there will be no blame against him. due course, his ruler will listen to him, and he will be a support in the most critical movements. Changing the capital from place to place was frequent in the feudal times of China. That of Shang, which preceded ifau, was changed five times. Line 5 is strong, in its fitting position, and central. It is the seat of the ruler, who has his proper correlate in 2. Everything good, according to the conditions of the hexagram, therefore, may be said of him ;~as is done. Line 6 is also strong; but it should be weak. Occupying the topmost place of the figure, its subject will concentrate his powers in the increase of himself, and not think of benefiting those below him j and the consequence will be as described. SECT. 11,",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：壯于頄，有凶。君子夬夬，獨行，遇雨，若濡，有慍，無咎。"
        }
      ],
      "normalized_meaning": "You act with fierce resolve and may have to stand alone, getting ‘soaked’ and resented for it. People might distrust you for challenging corruption — but in the end you’re not blamed.",
      "keywords": [
        "lonely resolve",
        "moral courage",
        "public backlash",
        "enduring resentment",
        "no final blame"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows one from whose buttocks the skin has been stripped, and who walks slowly and with difficulty. (If he could act) like a sheep led (after its companions), occasion for repentance would disappear. But though he hear these words, he will not believe them.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：臀無膚，其行次且。牽羊悔亡，聞言不信。"
        }
      ],
      "normalized_meaning": "You’re exhausted, exposed, and hurting. If you would just let yourself be guided calmly (like a led sheep), regret could fade — but pride makes you resist that advice.",
      "keywords": [
        "wounded state",
        "exposed vulnerability",
        "stubborn pride",
        "accept guidance",
        "regret can end"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows (the small men like) a bed of purslain, which ought to be uprooted with the utmost determination. (The subject of the line having such determination), his action, in harmony with his central position, will lead to no error or blame.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：莧陸夬夬，中行無咎。"
        }
      ],
      "normalized_meaning": "Corruption has spread like weeds. You must root it out completely, but do it from a centered, rightful position — focused justice, not rage — and you stay blameless.",
      "keywords": [
        "purging corruption",
        "decisive action",
        "just authority",
        "weeding out",
        "no blame"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, divided, shows its subject with out any (helpers) on whom to call. His end will be evil. XLIII. In Kwai we have the hexagram of the third month, when the last remnant, cold and dark, of winter, represented by the sixth line, is about to disappear before the advance of the warm and bright days of the approaching summer. In the yin line at the top king Win saw the symbol of a small or bad man, a feudal prince or high minister, lending his power to maintain a corrupt government, or, it might be, a dynasty that was waxen old and ready to vanish away; and in the five undivided lines he saw the representatives of good order, or, it might be, the dynasty which was to supersede the other. This then is the subject of the hexa gram,—how bad men, statesmen corrupt and yet powerful, are to be put out of the way. And he who would accomplish the task must do so by the force of his character more than by force of arms, and by producing a general sympathy on bis side. The Thwan says that he must openly denounce the criminal in the court, seek to awaken general sympathy, and at the same time go about his enterprise, conscious of its difficulty, and danger. Among his own adherents, moreover, as if it were in his own city, he must make it understood how unwillingly he takes up arms. Then let him go forward, and success will attend him. Line 1 is strong, the first line of that trigram, which expresses the idea of strength. But it is in the lowest place. The stage of i54 i j",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：無號，終有凶。"
        }
      ],
      "normalized_meaning": "If you fail to rally others, stop calling out the danger, and end up isolated at the top, you fall. Silence plus isolation = misfortune.",
      "keywords": [
        "isolation",
        "loss of support",
        "silenced warning",
        "vulnerable ending",
        "misfortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.557134Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 179,
      "leaf_end": 183,
      "page_candidates": [
        "329",
        "50",
        "330",
        "331",
        "52",
        "4",
        "332",
        "333",
        "53",
        "334",
        "335",
        "337",
        "5"
      ],
      "page_confidence": 0.0
    }
  }
}