{
  "id": "hx45",
  "number": 45,
  "unicode_hexagram": "䷬",
  "name": "Gathering Together / Assembly (萃, Cuì)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "In (the state denoted by) 3 hui, the king will repair to his ancestral temple. It will be advan- of the country, His influence, if unchecked, would go on to grow, and he would displace one good man after another, and fill the vacant seats with others like-minded with himself. The object of Wan in his Thwan, therefore, was to enjoin resistance to the encroachment of this had man. Kau is defined as giving the idea of suddenly and casually encountering or meeting with, So does the divided line appear all at once in the figure. And this significance of the name rules in the interpretation of the lines, so as to set on one side the more common interpretation of them according to the correlation; showing how the meaning of the figures was put into them from the minds of Wan and Tan in the first place. The sentiments of the Text are not learned from them; but they are forced and twisted, often fantastically, and made to appear to give those sentiments forth of themselves. Here the first line, divided, where it ought to be the contrary, becomes the symbol of a bold, bad woman, who appears unex pectedly on the scene, and wishes to subdue or win all the five strong lines to herself. No one would contract a marriage with such a female; and every good servant of his country will try to repel the entrance into the government of every officer who can be so symbolised. Line 1 represents the bete noire of the figure. If its subject can be kept back, the method of firm government and order will j proceed. If he cannot be restrained, he will become disgusting ! and dangerous. It is not enough for the carriage to be stopt by the metal drag; it is also tied or bound to some steadfast object. Internal and external restraints should be opposed to the . [ bad man. ( The 1 wallet of fish' under line 2 is supposed to symbolise the tageous (also) to meet with the great man; and then there will be progress and success, though the advan tage must come through firm correctness. The use of great victims will conduce to good fortune; and in whatever direction movement is made, it will be advantageous. 1. The first line, divided, shows its subject with a sincere desire (for union), but unable to carry it out, so that disorder is brought into the sphere of his union. If he cry out (for help to his proper correlate), all at once (his tears) will give place subject of line 1. It has come into the possession of the subject of 2, by virtue of the meaning of the name Kau, which I have pointed out. With his strength therefore he can repress the advance of 1. He becomes in fact 1 the lord of the hexagram,’ and all the other strong lines are merely guests; and especially is it important that he should prevent 1 from approaching them. This is a common explanation of what is said under this second line. It seems far fetched ; but I can neither find nor devise anything better. With what is said on line 3, compare the fourth paragraph of the duke’s Text on the preceding hexagram. Line 3 is strong, but has gone beyond the central place; has no correlate above; and is cut off from 1 by the intervening 2. It cannot do much therefore against 1; but its aim being to repress that, there will be no great error. Line r is the proper correlate of 4 ; but it has already met and associated with 2. The subject of 4 therefore stands alone; and evil to him may be looked for. Line 5 is strong, and in the ruler’s place. Its relation to 1 is like that of a forest tree to the spreading gourd. But let not its subject use force to destroy or repress the growth of 1; but let him restrain himself and keep his excellence concealed, and Heaven will set its seal to his virtue. The symbolism of line 6 is difficult to understand, though the meaning of what is said is pretty clear. The Khang-hsr editors observe:—‘ The subject of this line is like an officer who has with drawn from the world. He can accomplish no service fin the time; but his person is removed from the workers of disorder. *5 8 THE Yf KING. to smiles. He need not mind (the temporary diffi culty) ; as he goes forward, there will be no error. 2. The second line, divided, shows its subject led forward (by his correlate). There will be good fortune, and freedom from error. There is entire sincerity, and in that case (even the small offerings of) the vernal sacrifice are acceptable. 3. The third line, divided, shows its subject striving after union and seeming to sigh, yet no where finding any advantage. If he go forward, he will not err, though there may be some small cause for regret. 4. The fourth line, undivided, shows its subject in such a state that, if he be greatly fortunate, he will receive no blame. 5. The fifth line, undivided, shows the union (of all) under its subject in the place of dignity. There will be no error. If any do not have confidence in him, let him see to it that (his virtue) be great, long- continued, and firmly correct, and all occasion for repentance will disappear. 6 . The topmost line, divided, shows its subject sighing and weeping; but there will be no error. XLV. 3 h u i denotes collecting together, or things so collected; and hence this hexagram concerns the state of the kingdom when a happy union prevails between the sovereign and his ministers, between high and low; and replies in a vague way to the question how this state is to be preserved; by the influence of religion, and the great man, who is a sage upon the throne. He, ‘ the king,’ will repair to his ancestral temple, and meet in spirit there with the spirits of his ancestors. Whatever he does, being conect and right, will succeed. His religious services will be distinguished by their dignity and splendour. His victims will SF.CT, II.",
    "normalized_summary": "Gathering and unification. People assemble around a legitimate center — ritual, shared purpose, trusted leadership. That unity is powerful and can move outward in any direction. But it only holds if it’s sincere, ethically guided, and not faked for advantage. True assembly requires devotion, offering, and steadiness; without that, the group scatters into confusion or resentment."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows its subject with a sincere desire (for union), but unable to carry it out, so that disorder is brought into the sphere of his union. If he cry out (for help to his proper correlate), all at once (his tears) will give place subject of line 1. It has come into the possession of the subject of 2, by virtue of the meaning of the name Kau, which I have pointed out. With his strength therefore he can repress the advance of 1. He becomes in fact 1 the lord of the hexagram,’ and all the other strong lines are merely guests; and especially is it important that he should prevent 1 from approaching them. This is a common explanation of what is said under this second line. It seems far fetched ; but I can neither find nor devise anything better. With what is said on line 3, compare the fourth paragraph of the duke’s Text on the preceding hexagram. Line 3 is strong, but has gone beyond the central place; has no correlate above; and is cut off from 1 by the intervening 2. It cannot do much therefore against 1; but its aim being to repress that, there will be no great error. Line r is the proper correlate of 4 ; but it has already met and associated with 2. The subject of 4 therefore stands alone; and evil to him may be looked for. Line 5 is strong, and in the ruler’s place. Its relation to 1 is like that of a forest tree to the spreading gourd. But let not its subject use force to destroy or repress the growth of 1; but let him restrain himself and keep his excellence concealed, and Heaven will set its seal to his virtue. The symbolism of line 6 is difficult to understand, though the meaning of what is said is pretty clear. The Khang-hsr editors observe:—‘ The subject of this line is like an officer who has with drawn from the world. He can accomplish no service fin the time; but his person is removed from the workers of disorder. *5 8 THE Yf KING. to smiles. He need not mind (the temporary diffi culty) ; as he goes forward, there will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：有孚不終，乃亂乃萃，若號一握為笑，勿恤，往無咎。"
        }
      ],
      "normalized_meaning": "Your wish to unite is real, but blocked, which creates chaos and mixed signals. Ask for support from the right ally; tension can flip quickly to joy. Don’t over-worry — moving ahead is still okay.",
      "keywords": [
        "frustrated union",
        "calling for help",
        "emotional swing (tears → smiles)",
        "temporary disorder",
        "no blame if you continue"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows its subject led forward (by his correlate). There will be good fortune, and freedom from error. There is entire sincerity, and in that case (even the small offerings of) the vernal sacrifice are acceptable.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：引吉，無咎，孚乃利用禴。"
        }
      ],
      "normalized_meaning": "You are guided into alignment by someone you trust. Because the sincerity is complete, even a modest offering is welcomed. Shared devotion matters more than display.",
      "keywords": [
        "being led in",
        "trust and sincerity",
        "modest offering accepted",
        "good fortune",
        "no blame"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows its subject striving after union and seeming to sigh, yet no where finding any advantage. If he go forward, he will not err, though there may be some small cause for regret.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：萃如，嗟如，無攸利，往無咎，小吝。"
        }
      ],
      "normalized_meaning": "You ache for connection and feel shut out. It’s discouraging. Keep moving toward honest union anyway — you won’t be wrong, even if it’s imperfect and a bit humiliating.",
      "keywords": [
        "longing to belong",
        "discouragement",
        "minor regret",
        "keep going",
        "still no real blame"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows its subject in such a state that, if he be greatly fortunate, he will receive no blame.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：大吉，無咎。"
        }
      ],
      "normalized_meaning": "You’re in a strong, exposed position near power. If things go very well, you’re praised; if they slip, you take the heat. High stakes, high reward.",
      "keywords": [
        "proximity to power",
        "high stakes",
        "visible responsibility",
        "great good fortune possible",
        "no blame if it succeeds"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows the union (of all) under its subject in the place of dignity. There will be no error. If any do not have confidence in him, let him see to it that (his virtue) be great, long- continued, and firmly correct, and all occasion for repentance will disappear. 6 . The topmost line, divided, shows its subject sighing and weeping; but there will be no error. XLV. 3 h u i denotes collecting together, or things so collected; and hence this hexagram concerns the state of the kingdom when a happy union prevails between the sovereign and his ministers, between high and low; and replies in a vague way to the question how this state is to be preserved; by the influence of religion, and the great man, who is a sage upon the throne. He, ‘ the king,’ will repair to his ancestral temple, and meet in spirit there with the spirits of his ancestors. Whatever he does, being conect and right, will succeed. His religious services will be distinguished by their dignity and splendour. His victims will SF.CT, II.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：萃有位，無咎。匪孚，元永貞，悔亡。"
        }
      ],
      "normalized_meaning": "Leadership gathers everyone. If some still doubt you, answer with steady, enduring integrity — not force. Over time that cancels regret and cements trust.",
      "keywords": [
        "center of the assembly",
        "earned legitimacy",
        "long-term integrity",
        "removing doubt",
        "no error"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The topmost SIX, divided, shows its subject sighing and weeping; but there will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：齎咨涕洟，無咎。"
        }
      ],
      "normalized_meaning": "At the outer edge of the gathering, someone grieves — feeling left out, late, or no longer needed. The sorrow is real but blameless.",
      "keywords": [
        "sorrow at the margin",
        "emotional release",
        "post-gathering letdown",
        "no blame",
        "closure"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.557763Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 186,
      "leaf_end": 189,
      "page_candidates": [
        "342",
        "343",
        "6",
        "344",
        "345",
        "63",
        "5",
        "346",
        "347",
        "64",
        "349",
        "I"
      ],
      "page_confidence": 0.0
    }
  }
}