{
  "id": "hx46",
  "number": 46,
  "unicode_hexagram": "䷭",
  "name": "Ascending / Pushing Upward (升, Shēng)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Shang indicates that (under its conditions) there will be great progress and success. Seeking by be the best that can be obtained, and other things will be in har mony with them. Line 1 is weak, and in the place of a strong line. It has a proper correlate in 4, but is separated from him by the intervention of two weak lines. The consequence of these things is supposed to be expressed in the first part of the symbolism; but the subject of the line is possessed by the desire for union, which is the theme of the hexagram. Calling out to his correlate for help, he obtains it, and his sorrow is turned into joy. Line 2 is in its proper place, and responds to the strong ruler in 5, who encourages and helps the advance of its subject. He possesses also the sincerity, proper to him in his central position; and though he were able to offer only the sacrifice of the spring, small compared with the fulness of the sacrifices in summer and autumn, it would be accepted. Line 3 is weak, in the place of a strong line, and advanced from the central place. The topmost line, moreover, is no proper correlate. But its subject is possessed by the desire for union; and though 2 and 4 decline to associate with him, he presses on to 6, which is also desirous of union. That common desire brings them together, notwithstanding 3 and 6 are both divided lines; and with difficulty the subject of 3 accomplishes his object. [But that an ordinary rule for interpreting the lineal indications may be thus overruled by extraordinary considerations shows how much of fancy there is in the symbolism or in the commentaries on it.] Line 4 has its correlate in 1, and is near to the ruling line in 5. We may expect a good auspice for it; but its being strong in an odd place, calls for the caution which is insinuated. Line 5 is strong, central, and in its correct position.. Through i6o THE Yl KING. (the qualities implied in it) to meet with the great man, its subject need have no anxiety. Advance to the south will be fortunate. 1. The first line, divided, shows its subject ad vancing upwards with the welcome (of those above him). There will be great good fortune. 2. The second line, undivided, shows its subject with that sincerity which will make even the (small) offerings of the vernal sacrifice acceptable. There will be no error. 3. The third line, undivided, shows its subject ascending upwards (as into) an empty city. 4. The fourth line, divided, shows its subject employed by the king to present his offerings on mount Khi There will be good fortune; there will be no mistake. 5. The fifth line, divided, shows its subject firmly correct, and therefore enjoying good fortune. He ascends the stairs (with all due ceremony). 6. The sixth line, divided, shows its subject ad vancing upwards blindly. Advantage will be found in a ceaseless maintenance of firm correctness. its subject there may be expected the full realisation of the idea of the hexagram, Line 6, weak, and at the extremity of the figure, is still anxious for union; but he has no proper correlate, and all below are united in 5. Its subject mourns his solitary condition; and his good feeling will preserve him from error and blame. XLVI. The character Shang is used of advancing in an upward direction, advancing and ascending.’ And here, as the name of the hexagram, it denotes the advance of a good officer to the highest pinnacle of distinction. The second line, in the centre of the lower trigram, is strong, but the strength is tempered by its being in an even place. As the representative of the subject of the SECT. 11. l6l",
    "normalized_summary": "Steady rise. Humble, sincere effort gets recognized by those in power and is actively supported. You don’t have to force your way up; you ascend step by step, with legitimacy. Seek honorable allies, act with devotion, serve something larger than ego, and keep climbing in the light. Overreaching blindly at the top, though, is risky — you still need integrity."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows its subject ad vancing upwards with the welcome (of those above him). There will be great good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：允升，大吉。"
        }
      ],
      "normalized_meaning": "Your rise is welcomed. You’re being allowed upward because you’re modest and willing to serve, not because you shoved your way in. This support brings great good fortune.",
      "keywords": [
        "welcomed advancement",
        "humility rewarded",
        "sponsor/mentor support",
        "great good fortune",
        "green light to rise"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows its subject with that sincerity which will make even the (small) offerings of the vernal sacrifice acceptable. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：孚乃利用禴，無咎。"
        }
      ],
      "normalized_meaning": "Pure sincerity is enough. You don’t need a grand performance. A small, honest offering is accepted, and there’s no blame. Devoted heart > flashy display.",
      "keywords": [
        "sincere offering",
        "devotion",
        "quiet merit",
        "no blame",
        "earnest service"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows its subject ascending upwards (as into) an empty city.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：升虛邑。"
        }
      ],
      "normalized_meaning": "You advance boldly into open space. No resistance, no defenders — the territory is just there. This is fearless, maybe a little presumptuous, but also a real opportunity.",
      "keywords": [
        "bold advance",
        "no opposition",
        "claiming open ground",
        "fearless movement",
        "slight overreach risk"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows its subject employed by the king to present his offerings on mount Khi There will be good fortune; there will be no mistake.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：王用亨於岐山，吉無咎。"
        }
      ],
      "normalized_meaning": "You’re entrusted with sacred duty by the ruler — literally representing the center in holy service. This is public recognition and elevation, and it’s auspicious, not blameworthy.",
      "keywords": [
        "royal trust",
        "sacred service",
        "public legitimacy",
        "good fortune",
        "no blame"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows its subject firmly correct, and therefore enjoying good fortune. He ascends the stairs (with all due ceremony).",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：貞吉，升階。"
        }
      ],
      "normalized_meaning": "Now you’re literally on the steps of high rank. Keep your bearing clean, ceremonial, principled. Proper conduct at this stage brings good fortune.",
      "keywords": [
        "ritual ascent",
        "holding dignity",
        "firm correctness",
        "recognized status",
        "good fortune"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, divided, shows its subject ad vancing upwards blindly. Advantage will be found in a ceaseless maintenance of firm correctness. its subject there may be expected the full realisation of the idea of the hexagram, Line 6, weak, and at the extremity of the figure, is still anxious for union; but he has no proper correlate, and all below are united in 5. Its subject mourns his solitary condition; and his good feeling will preserve him from error and blame. XLVI. The character Shang is used of advancing in an upward direction, advancing and ascending.’ And here, as the name of the hexagram, it denotes the advance of a good officer to the highest pinnacle of distinction. The second line, in the centre of the lower trigram, is strong, but the strength is tempered by its being in an even place. As the representative of the subject of the SECT. 11. l6l",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：冥升，利於不息之貞。"
        }
      ],
      "normalized_meaning": "At the very top, you keep pushing upward even though you can’t see clearly anymore. This is dangerous ambition. Only relentless, unbroken integrity keeps it from going bad.",
      "keywords": [
        "blind ambition",
        "danger at the peak",
        "continuous vigilance",
        "unyielding integrity",
        "sustain correctness"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.558066Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 189,
      "leaf_end": 192,
      "page_candidates": [
        "349",
        "I",
        "350",
        "31",
        "2",
        "352",
        "353",
        "4",
        "354",
        "355",
        "i"
      ],
      "page_confidence": 0.0
    }
  }
}