{
  "id": "hx48",
  "number": 48,
  "unicode_hexagram": "䷯",
  "name": "The Well (井, Jǐng)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "(Looking at) fling, (we think of) how (the site of) a town may be changed, while (the fashion of) its to render it help; hence conies the unfavourable auspice. 1 Three years ’ is used, as often, for a long time. The three strong lines in the figure (2, 4, and 5) are all held to represent‘ superior men; ’ and their being straitened is not in their persons or estates, but in their principles which are denied develop ment. Hence the subject of 2 is straitened while he fares sumptu ously. His correlate in 5, though not quite proper, occupies the ruler's place, and comes to his help. That it is the ruler who comes appears from his red or vermillion knee-covers, different from the scarlet knee-covers worn by nobles, as in paragraph 5. Let 2 cultivate his sincerity and do the work of the hexagram as if he were sacrificing to spiritual beings; and then, if he keep quiet, all will be well. For ‘ a full explanation ’ of paragraph 3 Zfi Hsi refers his readers to what Confucius is made to say on it in Appendix III, ii, 35, The reader, however, will probably not find much light in that passage. The Khang-hst editors say hereThe subjects of the three divided lines (1,3, and 6) are all unable to deal aright with the straitened state indicated by the figure. The first is at the bottom, sitting and distressed. The second, occupies the third place, where he may either advanqe or retreat; and he advances and is distressed. Wounded abroad, he returns to his family, and finds none to receive him; so graphically is there set forth the distress which reckless action brings.’ f Line 4 is the proper correlate of 1, but it is a strong line in an even place, and its assistance is given dilatorily. Then 1 is over- j ridden by 2, which is represented by ‘ a chariot of metal,’ It is difficult for the subjects of 1 and 4 to come together, and effect much; but 4 is near 5, which is also a strong line. Through a P SECT. II. THE 3ING HEXAGRAM. 1 65 wells undergoes no change. (The water of a well) never disappears and never receives (any great) in crease, and those who come and those who go can draw and enjoy the benefit. If (the drawing) have nearly been accomplished, but, before the rope has quite reached the water, the bucket is broken, this is evil. 1. The first line, divided, shows a well so muddy that men will not drink of it; or an old well to which neither birds (nor other creatures) resort. 2. The second line, undivided, shows a well from which by a hole the water escapes and flows away to the shrimps (and such small creatures among the grass), or one the water of which leaks away from a broken basket. 3. The third line, undivided, shows a well, which has been cleared out, but is not used. Our hearts are sorry for this, for the water might be drawn out and used. If the king were (only) intelligent, both he and we might receive the benefit of it. common sympathy, the subject of 5 will have a measure of suc cess. So the symbolism of this line has been explained,—not very satisfactorily. Line 5 is repressed by 6, and pressed on by 4. Above and below its subject is wounded. Especially is he straitened by the minister in 4, with his scarlet knee-covers. But the upper trigram is T ui, with the quality of complacent satisfaction. And this indi cates, it is said, that the subject of 5 gets on notwithstanding his straits, especially by his sincerity, This explanation is not more satisfactory than the last. Line 6 is at the top of the figure, where the distress may be supposed to reach its height. Its subject appears bound and on a perilous summit. But his extremity is also his opportunity. He is moved to think of repenting; and if he do repent, and go forward, his doing so will be fortunate. 4. The fourth line, divided, shows a well, the lining of which is well laid. There will be no error. 5. The fifth line, undivided, shows a clear, limpid well, (the waters from) whose cold spring are (freely) drunk. 6. The topmost line, divided, shows (the water from) the well brought to the top, which is not allowed to be covered. This suggests the idea of sincerity. There will be great good fortune. XLVIII. Sing, which gives its name to this hexagram, is the symbol of a well. The character originally was pictorial (c^), intended to represent a portion of land, divided into nine parts, the central portion belonging to the government, and being culti vated by the joint labour of the eight families settled on the other divisions. In the centre of it, moreover, was a well, which was the joint property of all the occupants. What is said on 3 ing might be styled ‘ Moralisings on a well,’ or ‘Lessons to be learned from a well for the good order and government of a country.’ What a well is to those in its neighbour hood, and indeed to men in general, that is government to a people, If rulers would only rightly appreciate the principles of government handed down from the good ages of the past, and faithfully apply them to the regulation of the present, they would be blessed them selves and their people with them, In the Thwan we have the well, substantially the same through many changes of society; a sure source of dependance to men, for their refreshment and for use in their cultivation of the ground. Its form is what I have seen in the plains of northern China; what may be seen among ourselves in many places in Europe. It is deep, and the water is drawn up by a vessel let down from the top; and the value of the well depends on the water being actually raised. And so the principles of government must be actually carried out. Line 1, being weak, and at the very bottom of the figure, suggests, or is made to suggest, the symbolism of it. Many men in authority are like such a well; corrupt, useless, unregarded. Line 2 is strong, and might very well symbolise an active spring, ever feeding the well and, through it, the ground and its cultivators; but it is in an inappropriate place, and has no proper correlate. SECT. n. \\",
    "normalized_summary": "The Well is a shared source. Cities move, regimes change, but the well remains — a constant source meant to nourish everyone. The problem is not the source itself, but failure in access and maintenance: the rope doesn’t reach, the bucket breaks, the water isn’t drawn or shared. This hexagram says: repair the structure, keep the source clear, and make sure the life-giving resource actually reaches the people. Wasted potential is the true misfortune."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows a well so muddy that men will not drink of it; or an old well to which neither birds (nor other creatures) resort.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：井泥不食，旧井无禽。"
        }
      ],
      "normalized_meaning": "The well is neglected, polluted, abandoned. A resource that should nourish has become unusable. This is talent, virtue, or infrastructure allowed to rot at the bottom.",
      "keywords": [
        "neglect",
        "corruption at the source",
        "abandonment",
        "useless resource",
        "desolation"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows a well from which by a hole the water escapes and flows away to the shrimps (and such small creatures among the grass), or one the water of which leaks away from a broken basket.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：井谷射鲋，瓮敝漏。"
        }
      ],
      "normalized_meaning": "The well has water, but it’s leaking out sideways to small, trivial things. The value is draining where it does no real good. This is mismanagement: you have supply, but no containment.",
      "keywords": [
        "leakage of value",
        "wasted resources",
        "poor administration",
        "support going to the small",
        "structural flaw"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows a well, which has been cleared out, but is not used. Our hearts are sorry for this, for the water might be drawn out and used. If the king were (only) intelligent, both he and we might receive the benefit of it. common sympathy, the subject of 5 will have a measure of suc cess. So the symbolism of this line has been explained,—not very satisfactorily. Line 5 is repressed by 6, and pressed on by 4. Above and below its subject is wounded. Especially is he straitened by the minister in 4, with his scarlet knee-covers. But the upper trigram is T ui, with the quality of complacent satisfaction. And this indi cates, it is said, that the subject of 5 gets on notwithstanding his straits, especially by his sincerity, This explanation is not more satisfactory than the last. Line 6 is at the top of the figure, where the distress may be supposed to reach its height. Its subject appears bound and on a perilous summit. But his extremity is also his opportunity. He is moved to think of repenting; and if he do repent, and go forward, his doing so will be fortunate.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：井渫不食，为我民恻，可用汲，王明，并受其福。"
        }
      ],
      "normalized_meaning": "The well is finally clean and good — and still nobody draws from it. This is heartbreaking unrealized potential. With wise leadership, everyone could benefit. Without it, the good just sits unused.",
      "keywords": [
        "untapped potential",
        "wasted competence",
        "need for wise leadership",
        "public benefit unrealized",
        "collective frustration"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows a well, the lining of which is well laid. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：井甃，无咎。"
        }
      ],
      "normalized_meaning": "The structure is sound and maintained. Maybe it’s not glorious, but it’s correct and safe. Quiet repair work prevents blame.",
      "keywords": [
        "maintenance",
        "infrastructure made solid",
        "quiet competence",
        "no blame",
        "stability"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows a clear, limpid well, (the waters from) whose cold spring are (freely) drunk.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：井冽，寒泉食。"
        }
      ],
      "normalized_meaning": "This is the ideal well: pure, refreshing, shared. In governance terms, it’s leadership that truly nourishes the people. Everyone can drink safely.",
      "keywords": [
        "pure resource",
        "public good",
        "rightful leadership",
        "nourishment for all",
        "open access"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, divided, shows (the water from) the well brought to the top, which is not allowed to be covered. This suggests the idea of sincerity. There will be great good fortune. XLVIII. Sing, which gives its name to this hexagram, is the symbol of a well. The character originally was pictorial (c^), intended to represent a portion of land, divided into nine parts, the central portion belonging to the government, and being culti vated by the joint labour of the eight families settled on the other divisions. In the centre of it, moreover, was a well, which was the joint property of all the occupants. What is said on 3 ing might be styled ‘ Moralisings on a well,’ or ‘Lessons to be learned from a well for the good order and government of a country.’ What a well is to those in its neighbour hood, and indeed to men in general, that is government to a people, If rulers would only rightly appreciate the principles of government handed down from the good ages of the past, and faithfully apply them to the regulation of the present, they would be blessed them selves and their people with them, In the Thwan we have the well, substantially the same through many changes of society; a sure source of dependance to men, for their refreshment and for use in their cultivation of the ground. Its form is what I have seen in the plains of northern China; what may be seen among ourselves in many places in Europe. It is deep, and the water is drawn up by a vessel let down from the top; and the value of the well depends on the water being actually raised. And so the principles of government must be actually carried out. Line 1, being weak, and at the very bottom of the figure, suggests, or is made to suggest, the symbolism of it. Many men in authority are like such a well; corrupt, useless, unregarded. Line 2 is strong, and might very well symbolise an active spring, ever feeding the well and, through it, the ground and its cultivators; but it is in an inappropriate place, and has no proper correlate. SECT. n. \\",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：井收勿幕，有孚元吉。"
        }
      ],
      "normalized_meaning": "The water is lifted up and offered openly, not hidden or privatized. Honest availability, transparent service to all — that’s great good fortune.",
      "keywords": [
        "full delivery",
        "nothing concealed",
        "public trust",
        "sincere service",
        "great good fortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.558683Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 195,
      "leaf_end": 198,
      "page_candidates": [
        "360",
        "I",
        "362",
        "363",
        "45",
        "i",
        "48",
        "364",
        "365",
        "9",
        "43",
        "366",
        "367",
        "49"
      ],
      "page_confidence": 0.0
    }
  }
}