{
  "id": "hx49",
  "number": 49,
  "unicode_hexagram": "䷰",
  "name": "Revolution / Radical Change (革, Gé)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "(What takes place as indicated by) K 0 is believed in only after it has been accomplished. There will be great progress and success. Advantage will come from being firm and correct. (In that case) occasion for repentance will disappear. 1. The first line, undivided, shows its subject (as if he were) bound with the skin of a yellow ox. Its cool waters cannot be brought to the top. So important is it that the ministers of a country should be able and willing rightly to administer its government. In the account of the ancient Shun it is stated that he once saved his life by an opening in the lining of a well. Line 3 is a strong line, in its proper place; and must represent an able minister or officer. But though the well is clear, no use is made of it. I do not find anything in the figure that can be con nected with this fact, The author was wise beyond his lines. After the first sentence of the paragraph, the duke of Khw ceases from his function of making emblems; reflects and moralises. Line 4 is weak, but in its proper place. Its subject is not to be condemned, but neither is he to be praised. He takes care of himself, but does nothing for others. Line 5 is strong, and in its right place. The place is that of the ruler, and suggests the well, full of clear water, which is drawn up, and performs its useful work. Such is the good Head of government to his people. Line 6 is in its proper place, but weak. If the general idea of the figure was different, a bad auspice might be drawn from it. But here we see in it the symbol of the water drawn up, and the top uncovered so that the use of the well is free to all. Then the mention of ‘sincerity’ suggests the inexhaustibleness of the elemental supply. i68 2. The second line, divided, shows its subject making his changes after some time has passed. Action taken will be fortunate. There will be no error. 3. The third line, undivided, shows that action taken by its subject will be evil. Though he be firm and correct, his position is perilous. If the change (he contemplates) have been three times fully discussed, he will be believed in. 4. The fourth line, undivided, shows occasion for repentance disappearing (from its subject). Let him be believed in; and though he change (existing) ordinances, there will be good fortune. 5. The fifth line, undivided, shows the great man (producing his changes) as the tiger (does when he) changes (his stripes). Before he divines (and proceeds to action), faith has been reposed in him. 6. The sixth line, divided, shows the superior man producing his changes as the leopard (does when he) changes (his spots), while small men change their faces (and show their obedience). To go forward (now) would lead to evil, but there will be good fortune in abiding firm and correct. XLIX. The character called K 0 orKeh is used herein the sense of changing. Originally used for the skin of an animal or bird, alive or dead, it received the significance of changing at a very early time. Its earliest appearance, indeed, in the first Book of the Shfi, is in that sense. How the transition was made from the idea of a skin or hide to that of change is a subject that need not be entered on here. The author has before him the subject of changes occurring—called for—in the state of the country; it may be on the greatest scale. The necessity of them is recognised, and hints are SECT. 11.",
    "normalized_summary": "True revolution is justified, but not casual. It must be necessary, rightly timed, and carried out with integrity. At first, people resist change — they only believe once the change is real and working. When the change is correct, regret and second-guessing fall away. The message: prepare carefully, wait for the right moment, then act decisively and cleanly — and afterwards, stabilize, don’t just keep overthrowing."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject (as if he were) bound with the skin of a yellow ox. Its cool waters cannot be brought to the top. So important is it that the ministers of a country should be able and willing rightly to administer its government. In the account of the ancient Shun it is stated that he once saved his life by an opening in the lining of a well. Line 3 is a strong line, in its proper place; and must represent an able minister or officer. But though the well is clear, no use is made of it. I do not find anything in the figure that can be con nected with this fact, The author was wise beyond his lines. After the first sentence of the paragraph, the duke of Khw ceases from his function of making emblems; reflects and moralises. Line 4 is weak, but in its proper place. Its subject is not to be condemned, but neither is he to be praised. He takes care of himself, but does nothing for others. Line 5 is strong, and in its right place. The place is that of the ruler, and suggests the well, full of clear water, which is drawn up, and performs its useful work. Such is the good Head of government to his people. Line 6 is in its proper place, but weak. If the general idea of the figure was different, a bad auspice might be drawn from it. But here we see in it the symbol of the water drawn up, and the top uncovered so that the use of the well is free to all. Then the mention of ‘sincerity’ suggests the inexhaustibleness of the elemental supply. i68",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：鞏用黃牛之革。"
        }
      ],
      "normalized_meaning": "Beginning phase: lock things down. Secure the situation, hold steady, do not act prematurely. Power is restrained — like binding with thick yellow oxhide — because it’s not yet time to break loose.",
      "keywords": [
        "restraint",
        "holding position",
        "premature action is blocked",
        "stability first",
        "contained force"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows its subject making his changes after some time has passed. Action taken will be fortunate. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：己日乃革之，征吉，無咎。"
        }
      ],
      "normalized_meaning": "Wait until the moment is actually yours — then move. When timing ripens and you act in alignment with it, the change is lucky and blameless. No need to rush before that point.",
      "keywords": [
        "right timing",
        "mature moment",
        "initiating reform",
        "good fortune",
        "no blame"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows that action taken by its subject will be evil. Though he be firm and correct, his position is perilous. If the change (he contemplates) have been three times fully discussed, he will be believed in.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：征凶，貞厲，革言三就，有孚。"
        }
      ],
      "normalized_meaning": "Charging ahead right now is dangerous, even if you’re personally upright. You could be right and still get crushed. Build consensus first — talk it through thoroughly — and only then will people trust and follow.",
      "keywords": [
        "danger of premature action",
        "need for consensus",
        "risk despite integrity",
        "earn credibility",
        "peril"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows occasion for repentance disappearing (from its subject). Let him be believed in; and though he change (existing) ordinances, there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：悔亡，有孚改命，吉。"
        }
      ],
      "normalized_meaning": "Now the mandate is real. Regret falls away. If the people trust you, you can rewrite laws, even alter the mandate of rule, and it’s auspicious. Legitimacy turns revolution into lawful reform.",
      "keywords": [
        "remorse dissolves",
        "trusted leadership",
        "mandate to reform",
        "changing the order",
        "good fortune"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows the great man (producing his changes) as the tiger (does when he) changes (his stripes). Before he divines (and proceeds to action), faith has been reposed in him.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：大人虎變，未占有孚。"
        }
      ],
      "normalized_meaning": "This is charismatic, visible transformation — like a tiger’s new stripes, impossible to miss. The true leader doesn’t need to plead a case; trust is already given, so decisive change is naturally accepted.",
      "keywords": [
        "rightful ruler",
        "awe and authority",
        "transformation made obvious",
        "pre-existing trust",
        "leadership mandate"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, divided, shows the superior man producing his changes as the leopard (does when he) changes (his spots), while small men change their faces (and show their obedience). To go forward (now) would lead to evil, but there will be good fortune in abiding firm and correct. XLIX. The character called K 0 orKeh is used herein the sense of changing. Originally used for the skin of an animal or bird, alive or dead, it received the significance of changing at a very early time. Its earliest appearance, indeed, in the first Book of the Shfi, is in that sense. How the transition was made from the idea of a skin or hide to that of change is a subject that need not be entered on here. The author has before him the subject of changes occurring—called for—in the state of the country; it may be on the greatest scale. The necessity of them is recognised, and hints are SECT. 11.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：君子豹變，小人革面，征凶，居貞吉。"
        }
      ],
      "normalized_meaning": "After the revolution: the noble refines himself deeply, the opportunist just changes face to survive. This is not the moment for more campaigns. Hold steady, institutionalize the gains, and stick to principle.",
      "keywords": [
        "post-revolution stabilization",
        "integrity vs opportunism",
        "don’t keep pushing",
        "hold the new order",
        "good fortune in steadiness"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.558987Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 198,
      "leaf_end": 201,
      "page_candidates": [
        "366",
        "367",
        "49",
        "I",
        "369",
        "10",
        "53",
        "37",
        "371",
        "m",
        "372",
        "373",
        "69"
      ],
      "page_confidence": 0.0
    }
  }
}