{
  "id": "hx50",
  "number": 50,
  "unicode_hexagram": "䷱",
  "name": "The Cauldron / The Ting (鼎, Dǐng)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Ting gives the intimation of great progress and success. I. The first line, divided, shows the caldron over thrown and its feet turned up. (But) there will be given as to the spirit and manner in which they should be brought about. For the way in which the notion of change is brought out of the trigrams of the figure, see Appendixes I and II. It is assumed in the Thwan that change is viewed by people generally with suspicion and dislike, and should not be made hastily. When made as a necessity, and its good effects appear, the issues will be great and good. A proved necessity for them beforehand; and a firm correctness in the conduct of them:—these are the conditions by which changes should be regulated. Line 1, at the bottom of the figure, may be taken as denoting- change made at too early a period. It has no proper correlate or helper, moreover, above. Hence its subject is represented as tied up, unable to take any action. Line 2, though weak, is in its correct place. It is in the centre also of the trigram Li, signifying brightness and intelligence, and has a proper correlate in the strong 5. Let its subject take action in the way of change. The symbolism of paragraph 3 is twofold. The line is strong, and in the correct position, but it has passed the centre of Sun and is on its outward verge. These conditions may dispose its subject to reckless and violent changing which would be bad. But if he act cautiously and with due deliberation, he may take action, and he will be believed in. Line 4 is strong, but in the place of a weak line. This might vitiate any action of its subject in the way of change, and give occasion for repentance, But other conditions are intimated that I/O advantage in its getting - rid of what was bad in it. (Or it shows us) the concubine (whose position is improved) by means of her son. There will be no error. 2. The second line, undivided, shows the caldron with the things (to be cooked) in it. (If its subject can say), ‘ My enemy dislikes me, but he cannot approach me,’ there will be good fortune. 3. The third line, undivided, shows the caldron with (the places of) its ears changed. The progress (of its subject) is (thus) stopped. The fat flesh of the pheasant (which is in the caldron) will not be eaten. But the (genial) rain will come, and the grounds for repentance will disappear. There will be good fortune in the end. 4. The fourth line, undivided, shows the caldron with its feet broken; and its contents, designed for the ruler’s use, overturned and spilt. Its subject will be made to blush for shame. There will be evil. will have a contrary effect; and if he have further secured general confidence, he may proceed to the greatest changes, even to change the dynasty,—‘ with good fortune.' The conditions favourable to his action are said to be such as theseThe line has passed from the lower trigram into the upper; water and fire come in it into contact; the fourth place is that of the minister immediately below the ruler’s seat. All these considerations demand action from the subject of 4 in harmony with the idea of the hexagram. Line 5 has every quality proper to ‘ the lord of the hexagram,’ and his action will be in every way beneficial. He is symbolled by the tiger; and the changes which he makes by the bright stripes of the tiger when he has changed his coat. » Line 6 is weak, but its subject is penetrated with the spirit of the hexagram, If its subject be a superior man, only inferior to 1 the great man,’ immediately below, the changes he makes will be inferior only to his. If he be a small man, he will be compliant and submissive. The lesson for him, however, is to abide firm and correct without taking any action of his own, SECT. 11. THE TING HEYAURAM. 5. The fifth line, divided, shows the caldron with yellow ears and rings of metal in them. There will be advantage through being firm and correct. 6. The sixth line, undivided, shows the caldron with rings of jade. There will be great good for tune, and all action taken will be in every way advantageous. L, T i ng was originally a pictorial character,representing acaldron with three feet and two ears, used for cooking and preparing food for the table (the mat in old times) and the altar. The picture has disappeared from the character, but it is said that in the hexa gram we have an outline from which fancy may construct the vessel. The lower line, divided, represents its feet; lines 2,3, 4, all undivided, represent the body of it; line 5, divided, represents its two ears; and line 6, undivided, the handle by which it was carried, or suspended from a hook, Appendix VI makes Ting follow Ko in the order of the hexagrams, because there is no changer of the appearance and character of things equal to the furnace and caldron! Ting and Bing (48) are the only two hexagrams named from things in ordinary use with men; and they are both descriptive of the government’s work of nourishing. There are three hexagrams of which that is the theme, 1 (27), under which we are told in Ap pendix I that ‘ the sages nourished men of worth, by means of them to reach to the myriads of the people.’ 3i n g treats of the nourish ment of the people generally by the government through its agri cultural and other methods; Ting treats of the nourishment of men of talents and virtue; and that being understood, it is said, without more ado, that it ‘ intimates great progress and success.’ The Text that follows, however, is more difficult to interpret than that of Sing- Line 1 is weak, and little or nothing can be expected from its subject. But it has a proper correlate in the strong 4; and the disastrous overthrow, causing the feet to be directed towards 4, is understood to be lucky, as accelerating the co-operation of their two lines! The overturned caldron is thereby emptied of bad stuff that had accumulated in it! j The writer uses another illustration, which comes to the same thing. A concubine is less honourable than a wife,—like the overthrown caldron. But if she have a son, THE VI KING.",
    "normalized_summary": "The Cauldron is civilization’s sacred vessel. It symbolizes nourishing the worthy, refining what is crude into something elevated, and establishing legitimate order. The message: you’re not just fixing survival anymore (that was the Well); you’re cooking culture. Clean out corruption, stabilize the vessel, and let true talent be offered to rightful purpose. When the 'cauldron' is upright, filled well, and handled with grace, it becomes a source of prestige, mandate, and blessing."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The first SIX, divided, shows the caldron overthrown and its feet turned up. (But) there will be advantage in its getting rid of what was bad in it. (Or it shows us) the concubine (whose position is improved) by means of her son. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：鼎顛趾，利出否，得妾以其子，無咎。"
        }
      ],
      "normalized_meaning": "Flip the cauldron, dump out the filth. This is cleanup and reordering. A lower-ranked person rises because of real value (the son) — usefulness overrides status. Clearing corruption and elevating hidden talent is not a mistake.",
      "keywords": [
        "purge corruption",
        "upend the old order",
        "merit over status",
        "renewal through disruption",
        "no blame"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows the caldron with the things (to be cooked) in it. (If its subject can say), ‘ My enemy dislikes me, but he cannot approach me,’ there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：鼎有實，我仇有疾，不我能即，吉。"
        }
      ],
      "normalized_meaning": "You’re well provisioned, solid, and protected. Envy exists, but rivals can’t actually touch you. Keeping your position steady like this is good fortune.",
      "keywords": [
        "resources secured",
        "protected position",
        "envy without access",
        "quiet strength",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows the caldron with (the places of) its ears changed. The progress (of its subject) is (thus) stopped. The fat flesh of the pheasant (which is in the caldron) will not be eaten. But the (genial) rain will come, and the grounds for repentance will disappear. There will be good fortune in the end.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：鼎耳革，其行塞，雉膏不食，方雨虧悔，終吉。"
        }
      ],
      "normalized_meaning": "Right now the handles are in the wrong place — you can’t lift the vessel, so the good stuff inside can’t be served. It’s frustrating. But after a delay (the rain that finally comes), regret fades and the outcome ends well.",
      "keywords": [
        "temporary blockage",
        "misaligned structure",
        "talent not yet served",
        "patience through frustration",
        "ends in good fortune"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows the caldron with its feet broken; and its contents, designed for the ruler’s use, overturned and spilt. Its subject will be made to blush for shame. There will be evil. will have a contrary effect; and if he have further secured general confidence, he may proceed to the greatest changes, even to change the dynasty,—‘ with good fortune.' The conditions favourable to his action are said to be such as theseThe line has passed from the lower trigram into the upper; water and fire come in it into contact; the fourth place is that of the minister immediately below the ruler’s seat. All these considerations demand action from the subject of 4 in harmony with the idea of the hexagram. Line 5 has every quality proper to ‘ the lord of the hexagram,’ and his action will be in every way beneficial. He is symbolled by the tiger; and the changes which he makes by the bright stripes of the tiger when he has changed his coat. » Line 6 is weak, but its subject is penetrated with the spirit of the hexagram, If its subject be a superior man, only inferior to 1 the great man,’ immediately below, the changes he makes will be inferior only to his. If he be a small man, he will be compliant and submissive. The lesson for him, however, is to abide firm and correct without taking any action of his own, SECT. 11. THE TING HEYAURAM.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：鼎折足，覆公餗，其形渥，凶。"
        }
      ],
      "normalized_meaning": "Catastrophic failure in service. The vessel collapses under responsibility, the offering for the ruler is spilled, and the one in charge is disgraced. This is a warning about incompetence in a high position.",
      "keywords": [
        "structural collapse",
        "public embarrassment",
        "failure in duty",
        "lost offering",
        "misfortune"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows the caldron with yellow ears and rings of metal in them. There will be advantage through being firm and correct.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：鼎黃耳金鉉，利貞。"
        }
      ],
      "normalized_meaning": "Now the cauldron is well fitted — elegant, balanced, worthy of noble use. Holding to upright conduct here makes your position both dignified and stable.",
      "keywords": [
        "noble refinement",
        "proper fittings",
        "earned authority",
        "dignity through integrity",
        "advantage in correctness"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, shows the caldron with rings of jade. There will be great good for tune, and all action taken will be in every way advantageous. L, T i ng was originally a pictorial character,representing acaldron with three feet and two ears, used for cooking and preparing food for the table (the mat in old times) and the altar. The picture has disappeared from the character, but it is said that in the hexa gram we have an outline from which fancy may construct the vessel. The lower line, divided, represents its feet; lines 2,3, 4, all undivided, represent the body of it; line 5, divided, represents its two ears; and line 6, undivided, the handle by which it was carried, or suspended from a hook, Appendix VI makes Ting follow Ko in the order of the hexagrams, because there is no changer of the appearance and character of things equal to the furnace and caldron! Ting and Bing (48) are the only two hexagrams named from things in ordinary use with men; and they are both descriptive of the government’s work of nourishing. There are three hexagrams of which that is the theme, 1 (27), under which we are told in Ap pendix I that ‘ the sages nourished men of worth, by means of them to reach to the myriads of the people.’ 3i n g treats of the nourish ment of the people generally by the government through its agri cultural and other methods; Ting treats of the nourishment of men of talents and virtue; and that being understood, it is said, without more ado, that it ‘ intimates great progress and success.’ The Text that follows, however, is more difficult to interpret than that of Sing- Line 1 is weak, and little or nothing can be expected from its subject. But it has a proper correlate in the strong 4; and the disastrous overthrow, causing the feet to be directed towards 4, is understood to be lucky, as accelerating the co-operation of their two lines! The overturned caldron is thereby emptied of bad stuff that had accumulated in it! j The writer uses another illustration, which comes to the same thing. A concubine is less honourable than a wife,—like the overthrown caldron. But if she have a son, THE VI KING.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：鼎玉鉉，大吉，無不利。"
        }
      ],
      "normalized_meaning": "This is the highest form: strength with grace. The ‘jade handle’ means pure, resonant authority. What you carry and offer now benefits everyone, and it’s universally auspicious.",
      "keywords": [
        "exalted service",
        "prestige and virtue",
        "flawless presentation",
        "universal benefit",
        "great good fortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.559296Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 201,
      "leaf_end": 204,
      "page_candidates": [
        "372",
        "373",
        "69",
        "374",
        "12",
        "76",
        "377",
        "79",
        "1"
      ],
      "page_confidence": 0.0
    }
  }
}