{
  "id": "hx51",
  "number": 51,
  "unicode_hexagram": "䷲",
  "name": "Shock / The Arousing (震, Zhèn)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "/Tan gives the intimation of ease and develop ment. When (the time of) movement (which it indicates) comes, (the subject of the hexagram) will be found looking out with apprehension, and yet while the proper wife has none, he will be his father’s heir, and the mother, the concubine, will share in the honour of his position, Thus the issue of what was so unpromising is good. At least ‘ there is no mistake.’ The above is what is found in the best commentaries on the paragraph. I give it, but am myself dis satisfied with it, Line 2 is strong. ‘ The enemy ’ is the first line, which solicits 1. One, however, is able to resist the solicitation; and the whole paragraph gives a good auspice. The personal pronoun seems to show that the whole was, or was intended to be, understood as an oracular response in divination. This paragraph is rhymed, more over, as are also i, 3, and 4;— ‘ In the caldron is good fare, See my foe with angry glare; But touch me he does not dare.’ Line 3 is also strong, and in the proper place; and if its corre late were the divided 5, its auspice would be entirely good. But instead of 5, its correlate is the strong 6, The place of the ears at 5 has been changed. Things promise badly. The advance of 3 is stopped. The good meat in the caldron which it symbolises will not be eaten, But 3 keeping firm 5 will by and by seek its society 1 1 he yin and the yang will mingle, and their union will be followed by genial rain. The issue will be good. Line 4 is in the place of a great minister, who is charged with the most difficult duties, which no single man can sustain. Then the strength ol 4 is weakened by being in an even place, and its corre late is the weak 1 in the lowest place. Its subject is insufficient of SECT. II. THE KW HEXAGRAM. 173 smiling and talking cheerfully. When the move ment (like a crash of thunder) terrifies all within a hundred li, he will be (like the sincere worshipper) who is not (startled into) letting go his ladle and (cup of) sacrificial spirits. 1. The first line, undivided, shows its subject, when the movement approaches, looking out and around with apprehension, and afterwards smiling and talking cheerfully. There will be good fortune. 2. The second line, divided, shows its subject, when the movement approaches, in a position of peril. He judges it better to let go the articles (in his possession), and to ascend a very lofty height, There is no occasion for him to pursue after (the things he has let go); in seven days he will find them. 3. The third line, divided, shows its subject dis traught amid the startling movements going on, If those movements excite him to (right) action, there will be no mistake. himself for his work, and he has no sufficient help; and the result will be evil. ‘ Paragraph 5,’ says the Daily Lecture, ‘ praises the ruler as con descending to the worthy with his humble virtue.’ 1 Yellow’ has occurred repeatedly as ‘a correct colour;' and here ‘the yellow ears and strong rings of metal ’ are intended to intensify our appre ciation of the occupant of 5. As the line is divided, a caution is added about being firm and correct. Line 6 is strong, but the strength is tempered by its being in an even place. It is this which makes the handle to be of jade, which, though very hard, is supposed to have a peculiar and rich softness of its own. The auspice of the line is very good. ‘The great minister,’ it is said, ‘ the subject of 6,’ performs for the ruler, the subject of 5, in helping his government and nourishing the worthy, the part which the handle does for the caldron. 4. The fourth line, undivided, shows its subject, amid the startling movements, supinely sinking (deeper) in the mud. 5. The fifth line, divided, shows its subject going and coming amidst the startling movements (of the time), and always in peril; but perhaps he will not incur loss, and find business (which he can accomplish). b. The topmost line, divided, shows its subject, amidst the startling movements (of the time), in breathless dismay and looking round him with trembling apprehension. If he take action, there will be evil. If, while the startling movements have not reached his own person and his neighbourhood, (he were to take precautions), there would be no error, though his relatives might (still) speak against him. LI. Zan among the trigrams represents thunder, and, according to Wan’s arrangement and significance of them, ‘ the oldest son.’ It is a phonetic character in which the significant constituent is Yu, meaning rain, and with which are formed most characters that denote atmospherical phenomena. The hexagram is formed of the trigram Zhn redoubled, and may be taken as representing the crash or peal of thunder; but we have seen that the attribute or virtue of the trigram is 'moving, exciting power;’ and thence, symbolically, the character is indicative of movement taking place in society or in the kingdom. This is the meaning of the hexagram; and the subject is the conduct to be pursued in a time of movement—such as insurrection or revolution—by the party promoting, and most interested in, the situation. It is shown how he ought to be aware of the dangers of the time, and how by precaution and the regula tion of himself he may overcome them, The indication of a successful issue given by the figure is sup posed to be given by the undivided line at the bottom of the trigram. The subject of it must be superior to the subjects of the two divided lines above. It is in the idea of the hexagram that he should be moving and advancing;—and what can his movement be but successful ? LI I, The Kan Hexagram. When one’s resting is like that of the back, and he loses all consciousness of self; when he walks The next sentence shows him sensible of the danger of the occasion, but confident and self-possessed. The concluding sen tence shows him rapt in his own important affairs, like a sincere worshipper, thinking only of the service in which he is engaged. Such a symbol is said to be suggested by Wan’s significance of K an as ' the oldest son (page 33).’ It is his to succeed to his father, and the hexagram, as following Ting, shows him presiding over the sacrifices that have been prepared in the caldron. This is too fanciful. What is said on line 1 is little more than a repetition of the principal part of the Th wan. The line is undivided, and gives the auspice of good fortune. ‘ The position of peril ’ to the subject of line 2 is suggested, as Appendix II says, by its position, immediately above r. But the rest of the symbolism is obscure, and Zu Hsi says he does not understand it. The common interpretation appears in the version. The subject of the line does what he can to get out of danger; and finally, as is signified by the central position of the line, the issue is better than could have been expected, On the specification of ‘ seven days,’ see what is said in the treatise on the Thwan of hexagram 24. On its use here ZAang-jze says:—‘The places of a diagram amount to 6. The number 7 is the first of another. When the movement symbolised by Zan is gone by, things will be as they were before.’ Line 3 is divided, and where an undivided line should be; but if its subject move on to the fourth place, which would be right foi him, the issue will not be bad. The 4th line, however, has a bad auspice of its own. It is undi vided in an even place, and it is pressed by the divided line on in his courtyard, and does not see any (of the per sons) in it,—there will be no error. 1. The first line, divided, shows its subject keep ing his toes at rest. There will be no error; but it will be advantageous for him to be persistently firm and correct. 2. The second line, divided, shows its subject keeping the calves of his legs at rest. He cannot help (the subject of the line above) whom he fol lows, and is dissatisfied in his mind. 3. The third line, undivided, shows its subject keeping his loins at rest, and separating the ribs (from the body below). The situation is perilous, and the heart glows with suppressed excitement. 4. The fourth line, divided, shows its subject keeping his trunk at rest. There will be no error. 5. 1 he fifth line, divided, shows its subject keep ing his jawbones at rest, so that his words are (all) orderly. Occasion for repentance will disappear. 6. The sixth line, undivided, shows its subject either side, hence its subject is represented as supinely sinking in the mud. Line g is divided, in an odd place, and that in which the action of the hexagram may be supposed to be concentrated. Hence its subject is always in peril; but his central position indicates safety in the end. Line 6 is weak, and has to abide the concluding terrors of the movement. Action on the part of its subject is sure to be evil, If, however, he were to take precautions, he might escape with only the censures of his relatives, But I do not see anything in the figure to indicate this final symbolism. The writer, probably, had a case in his mind, which it suited; but what that was we do devotedly maintaining his restfulness. There will be good fortune. LII. The trigram Kan represents a mountain. Mountains rise up grandly from the surface of the earth, and their masses rest on it in quiet and solemn majesty; and they serve also to arrest the on ward progress of the traveller. Hence the attribute ascribed to Kan is twofold; it is both active and passive—resting and arresting. The character is used in this hexagram with both of those signifi cations. As the name of the figure, it denotes the mental charac teristic of resting in what is right; especially resting, as it is expressed by Chinese critics, ‘ in principle,'—that which is right, on the widest scale, and in the absolute conception of the mind; and that which is right in every different position in which a man can be placed. We find this treated of in the Great Learning (Commentary, chapter 3), and in the Doctrine of the Mean, chapter 14, and other places. This is the theme of the hexa gram ; and the symbolism of it is all taken from different parts of the human body, as in hexagram 31, and the way in which they are dealt with. Several of the paragraphs are certainly not easy to translate and interpret. The other parts of the body, such as the mouth, eyes, and ears, have their appetencies, which lead them to what is without them selves. The back alone has nothing to do with anything beyond itself—hardly with itself even; all that it has to do is to stand straight and strong. So should it he with us, resting in principle, free from the intrusion of selfish thoughts and external objects. Amidst society, he who realises the idea of the hexagram is still alone, and does not allow himself to be distracted from the con templation and following of principle. He is not a recluse, how ever, who keeps aloof from social life; but his distinction is that he maintains a supreme regard to principle, when alone, and when mingling with others. In the symbolism the author rises from one part of the body to the other. The first line at the bottom of the figure fitly suggests ‘ the toes.' The lesson is that from the first men should rest in, and be anxious to do, what is right in all their affairs. The weakness of the line and its being in an odd place give occasion for the caution, with which the paragraph concludes. Above the toes are the calves, represented by the second line, weak, but in its proper place. Above this, again, are the loins, represented by 3, strong, and in danger of being violent. Line 2 THE Vi KING. TEXT, I78 LI II. The /Lien Hexagram. /Lien suggests to us the marriage of a young lady, and the good fortune (attending it). There will be advantage in being firm and correct. 1. The first line, divided, shows the wild geese gradually approaching the shore. A young officer (in similar circumstances) will be in a position of danger, and be spoken against; but there will be no error. follows 3, and should help it; but is unable to do so; and there results dissatisfaction. When the calves are kept at rest, advance is stopped, but no other harm ensues, Not so when the loins are kept at rest, and unable to bend, for the connexion between the upper and lower parts of the body is then broken. The dissatisfaction increases to an angry heat, Paragraph 3 is unusually difficult. For 1 loins ' P. Regis has scapulae, and for ribs renes; Canon McClatchie saysThird Nine is stopping at a limit, and separating what is in continued succession (i,e, the backbone); thus the mind,’ &c. Line 4 is a weak line resting in a proper place; hence it gives a good auspice! The Khang-hst editors, however, call attention to the resting of the trunk as being inferior to the resting of the back in the Thwan. The place of the weak fifth line is not proper for it; and this accounts for the mention of its subject ‘repenting/ for which, however, there is not occasion. The third line of the trigrams, and the sixth of the hexagram, is what makes Kan what it is,—the symbol of a mountain, The subject of it therefore will carry out the resting required by the whole figure in the highest style, 2. The second line, divided, shows the geese gradually approaching the large rocks, where they eat and drink joyfully and at ease. There will be good fortune. 3. The third line, undivided, shows them gradu ally advanced to the dry plains. (It suggests also the idea of) a husband who goes on an expedition from which he does not return, and of a wife who is pregnant, but will not nourish her child. There will be evil. (The case symbolised) might be advan tageous in resisting plunderers. 4. The fourth line, divided, shows the geese gradually advanced to the trees. They may light on the flat branches. There will be no error. 5. The fifth line, undivided, shows the geese gradually advanced to the high mound. (It sug gests the idea of) a wife who for three years does not become pregnant; but in the end the natural issue cannot be prevented. There will be good fortune. 6. The sixth line, undivided, shows the geese gradually advanced to the large heights (beyond). } Their feathers can be used as ornaments. There I will be good fortune. r- ; LIII. /Tien is ordinarily used in the sense of gradually; but 1 there is connected with that the idea also of progress or advance, j. The element of meaning in the character is the symbol of water; l and the whole of it denotes gradual advance, like the soaking in I of water. Three hexagrams contain in them the idea of advance,— gin (35), Shang (46), and this /Tien; but each has its peculiarity „ of meaning, and that of /Tien is the gradual manner in which the advance takes place. The subject then of the hexagram is the advance of men to offices in the state, how it should take place gradually and by successive steps, as well as on certain other THE Yi ICING. SECT. IT. the kwei mei hexagram.",
    "normalized_summary": "Sudden shock, like thunder. A jolt hits: fear, adrenaline, chaos. The teaching is not ‘don’t be afraid’ — it’s ‘stay composed in the fear.’ Even when events shake the world, you keep your role, your ritual, your duty. Panic scatters you; disciplined steadiness carries you through danger without losing what matters."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows the wild geese gradually approaching the shore. A young officer (in similar circumstances) will be in a position of danger, and be spoken against; but there will be no error. follows 3, and should help it; but is unable to do so; and there results dissatisfaction. When the calves are kept at rest, advance is stopped, but no other harm ensues, Not so when the loins are kept at rest, and unable to bend, for the connexion between the upper and lower parts of the body is then broken. The dissatisfaction increases to an angry heat, Paragraph 3 is unusually difficult. For 1 loins ' P. Regis has scapulae, and for ribs renes; Canon McClatchie saysThird Nine is stopping at a limit, and separating what is in continued succession (i,e, the backbone); thus the mind,’ &c. Line 4 is a weak line resting in a proper place; hence it gives a good auspice! The Khang-hst editors, however, call attention to the resting of the trunk as being inferior to the resting of the back in the Thwan. The place of the weak fifth line is not proper for it; and this accounts for the mention of its subject ‘repenting/ for which, however, there is not occasion. The third line of the trigrams, and the sixth of the hexagram, is what makes Kan what it is,—the symbol of a mountain, The subject of it therefore will carry out the resting required by the whole figure in the highest style,",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：震來虩虩，後笑言啞啞，吉。"
        }
      ],
      "normalized_meaning": "The first hit of shock startles you — totally natural. But you regain composure and even laugh. Courage isn’t absence of fear; it’s recovery after fear. That’s auspicious.",
      "keywords": [
        "initial fright",
        "regaining calm",
        "emotional recovery",
        "good fortune",
        "resilience"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows the geese gradually approaching the large rocks, where they eat and drink joyfully and at ease. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：震來厲，億喪貝，躋于九陵，勿逐，七日得。"
        }
      ],
      "normalized_meaning": "Crisis hits and you drop valuables to get to safety fast. Don’t cling to possessions or status in the moment of shock. If you get clear and survive, what’s truly yours returns in time.",
      "keywords": [
        "danger response",
        "drop the baggage",
        "seek higher ground",
        "safety first",
        "recovery later"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows them gradu ally advanced to the dry plains. (It suggests also the idea of) a husband who goes on an expedition from which he does not return, and of a wife who is pregnant, but will not nourish her child. There will be evil. (The case symbolised) might be advan tageous in resisting plunderers.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：震蘇蘇，震行無眚。"
        }
      ],
      "normalized_meaning": "You’re shaken, anxious, maybe trembling — but if you channel that state into appropriate, constructive action instead of panic, you avoid blame and harm.",
      "keywords": [
        "anxiety",
        "agitation",
        "act correctly under stress",
        "no mistake",
        "using fear as fuel"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows the geese gradually advanced to the trees. They may light on the flat branches. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：震遂泥。"
        }
      ],
      "normalized_meaning": "Instead of responding, you go limp and bog down. Shock turns into paralysis. This is the danger of letting fear turn you passive — you get dragged into the mud.",
      "keywords": [
        "paralysis",
        "stuck in crisis",
        "loss of initiative",
        "sinking lower",
        "danger of collapse"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows the geese gradually advanced to the high mound. (It sug gests the idea of) a wife who for three years does not become pregnant; but in the end the natural issue cannot be prevented. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：震往來厲，億無喪，有事。"
        }
      ],
      "normalized_meaning": "You’re moving through danger constantly — back and forth in the storm — but you’re still functional. You may keep what matters and even find meaningful work to do in the midst of chaos.",
      "keywords": [
        "operating in crisis",
        "constant danger",
        "retaining what matters",
        "duty in turmoil",
        "possible no-loss"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, shows the geese gradually advanced to the large heights (beyond). } Their feathers can be used as ornaments. There I will be good fortune. r- ; LIII. /Tien is ordinarily used in the sense of gradually; but 1 there is connected with that the idea also of progress or advance, j. The element of meaning in the character is the symbol of water; l and the whole of it denotes gradual advance, like the soaking in I of water. Three hexagrams contain in them the idea of advance,— gin (35), Shang (46), and this /Tien; but each has its peculiarity „ of meaning, and that of /Tien is the gradual manner in which the advance takes place. The subject then of the hexagram is the advance of men to offices in the state, how it should take place gradually and by successive steps, as well as on certain other THE Yi ICING. SECT. IT. the kwei mei hexagram.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：震索索，視矍矍，征凶。震不於其躬，于其鄰，無咎。婚媾有言。"
        }
      ],
      "normalized_meaning": "Full panic: heart racing, eyes darting. If you act blindly from that state, you create misfortune. Better to secure yourself and your immediate circle early, even if others criticize you for being cautious.",
      "keywords": [
        "panic",
        "breathless fear",
        "do not rush out",
        "protect your ground",
        "criticism from others"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.559647Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 204,
      "leaf_end": 207,
      "page_candidates": [
        "1",
        "380",
        "381",
        "382",
        "383",
        "2",
        "I",
        "384"
      ],
      "page_confidence": 0.0
    }
  }
}