{
  "id": "hx54",
  "number": 54,
  "unicode_hexagram": "䷵",
  "name": "The Marrying Maiden (歸妹, Guī Mèi)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Kwei Mei indicates that (under the conditions which it denotes) action will be evil, and in no wise advantageous. conditions that may be gathered from the Text. P. Regis gives this exposition of the subject, as taken by him from the symbolism, which he ascribes to Confucius‘ Viri probi, seu republics digni, in virtutis soliditate instituendi sunt a sapiente, bonisque regulis ut altis radicibus firmandi, nec alii ad rempublicam tractandam promovendi, nisi qui paulatim per varios minoresque gradus ad magnum .hoc regimen periculo facto ascendere digni sint. 1 He then illustrates this sentiment by the words of Pliny‘ Eligetur multis experiments eruditus, et qui futura possit ex praeteritis praevidere. 1 But how does the lineal figure give the idea of a gradual advance? We shall see how it is attempted in the Great Sym bolism to get this from the component trigrams. The account theie is not satisfactory ; and still less so is what else I have been able to find on the subject, E.g,, the trigrams were originally Khwan and ZZen; but the third line of Khwan and the first of it Zen have changed places; and the trigrams now denote ‘the youngest son/ and ‘the eldest daughter.’ If all this, which is a mere farrago, were admitted, it would not help us to the idea of an advance. Again, the lines 2, 3,4, 5 are all in the places proper to them as strong or weak; we ascend by them as by regular steps to the top of the hexagram; .and this, it is said, gives the notion of the graduabteps of the advance. But neither does this carry con viction with it to the mind. We must leave the question. King f Wan, for reasons which we cannot discover, or without such reasons, determined that the hexagram Zien should denote the i gradual advance of men to positions of influence and office. The marriage of a young lady is mentioned in the Thwan as an illustration of an important event taking place with various i. The first line, undivided, shows the younger sister married off in a position ancillary to the real wife. (It suggests the idea of) a person lame on i preliminary steps, continued from its initiation to its consummation. | But all must be done in an orderly and correct manner. And so must it be with the rise of a man in the service of the state, \\ The goose from the most ancient times played an important part in the marriage ceremonies of the Chinese; and this may have suggested the use of it in the symbolism of the different lines. Its habits as a bird of passage, and flying in processional order, admirably suited the writer's purpose. In paragraph 1 it appears for the first time in the season approaching the shore. Then comes the real subject of the line; and the facts of its being weak, and without a proper correlate, agree with, if they do not suggest, what is said about him, and the caution added. The geese have advanced in line 2, and so has the officer, though he is not mentioned. The line is weak or humble, and central, and has a proper correlate in 5. Hence comes the good auspice. Line 3 is strong, and has passed the central place, to the top of the lower trigram, and has not a proper correlate in 6. Its subject is likely to be violent and at the same time unsuccessful in his movements. He is like a husband who does not care for his wife, or a wife who does not care for her child. But in the case supposed, his strength in the end would be useful. The web-footed goose is not suited for taking hold on the branches; but on flat branches it can rest. Line 4, weak, but in an even place, does not promise a good auspice for its subject; but it is the first line in the trigram of humility, and it is concluded that he will not fall into error. Line g is a strong line in the ruler’s seat; and yet it appears here as the symbol of a wife. Somehow its subject has been at variance with, and kept in disgrace by, calumniating enemies such as the plunderers of paragraph 3; but things come right in the end. The wife, childless for three years, becomes at last a mother; and there is good fortune. The subject of line 6 has reached the top of the hexagram. There is no more advance for him; and he has no conelate. But he may still do some good work for the state, and verify the auspice derived from the ornamental plumes of the geese. THE Yt KING. t f one leg who yet manages to tramp along. Going forward will be fortunate. | 2. The second line, undivided, shows her blind of one eye, and yet able to see. There will be j advantage in her maintaining the firm correctness I of a solitary widow. 3. The third line, divided, shows the younger | sister who was to be married off in a mean position. f She returns and accepts an ancillary position. | 4. The fourth line, undivided, shows the younger | sister who is to be married off protracting the time. j She may be late in being married, but the time will come. ( > 5. The fifth line, divided, reminds us of the \\ marrying of the younger sister of (king) Ti-yi, when the sleeves of her the princess were not ?■ equal to those of the (still) younger sister who accompanied her in an inferior capacity. (The case suggests the thought of) the moon almost full. There will be good fortune. 6. The sixth line, divided, shows the young lady bearing the basket, but without anything in it, and the gentleman slaughtering the sheep, but without blood flowing from it. There will be no advantage in any way. LIV. Mei Kwei is a common way of saying that a young lady is married, or, literally, ‘is going home.’ If the order of the chaiaclers be reversed, the verb kwei will be transitive, and the phrase will signify ‘the marrying away of a daughter,’ or ‘the giving the young lady in marriage.’ In the name of this hexagram, Kwei is used with this transitive force. But Mei means ‘ a younger sister,’ and not merely a young lady or a daughter. Kwei Mei might be equivalent to our ‘giving in marriage;' but we shall find",
    "normalized_summary": "Misaligned position. Don’t push for advancement or control; accept proper place and timing. Most moves now backfire—except where modesty and right relation restore order."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The first NINE, undivided, shows the younger sister married off in a position ancillary to the real wife. (It suggests the idea of) a person lame on one leg who yet manages to tramp along. Going forward will be fortunate.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：歸妹以娣，跛能履，征吉。"
        }
      ],
      "normalized_meaning": "Begin from a subordinate role and proceed carefully. Though imperfect, movement aligned to duty can still be favorable.",
      "keywords": [
        "subordinate role",
        "humility",
        "tentative progress",
        "duty first",
        "good to proceed"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows her blind of one eye, and yet able to see. There will be j advantage in her maintaining the firm correctness I of a solitary widow.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：眇能視，利幽人之貞。"
        }
      ],
      "normalized_meaning": "Hold to solitary integrity. Limited perspective is offset by steadfast correctness.",
      "keywords": [
        "widow-like rectitude",
        "limited vision",
        "inner discipline",
        "self-containment",
        "advantage in firmness"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows the younger | sister who was to be married off in a mean position. f She returns and accepts an ancillary position. |",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：歸妹以須，反歸以娣。"
        }
      ],
      "normalized_meaning": "Forcing status fails. Return, accept a lesser place, and reset expectations.",
      "keywords": [
        "overreach",
        "retreat",
        "accept limits",
        "reset role",
        "humbling"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows the younger | sister who is to be married off protracting the time. j She may be late in being married, but the time will come. ( >",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：歸妹愆期，遲歸有時。"
        }
      ],
      "normalized_meaning": "Delay is appropriate. Wait for right timing rather than push prematurely.",
      "keywords": [
        "patience",
        "timing",
        "holding back",
        "avoid haste",
        "eventual fulfillment"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, reminds us of the \\ marrying of the younger sister of (king) Ti-yi, when the sleeves of her the princess were not ?■ equal to those of the (still) younger sister who accompanied her in an inferior capacity. (The case suggests the thought of) the moon almost full. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：帝乙歸妹，其君之袂，不如其娣之袂良，月幾望，吉。"
        }
      ],
      "normalized_meaning": "Modesty and balance. Nobility shows through restraint; near-completion brings auspicious results.",
      "keywords": [
        "modesty",
        "near fullness",
        "right decorum",
        "honor through restraint",
        "good fortune"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, divided, shows the young lady bearing the basket, but without anything in it, and the gentleman slaughtering the sheep, but without blood flowing from it. There will be no advantage in any way. LIV. Mei Kwei is a common way of saying that a young lady is married, or, literally, ‘is going home.’ If the order of the chaiaclers be reversed, the verb kwei will be transitive, and the phrase will signify ‘the marrying away of a daughter,’ or ‘the giving the young lady in marriage.’ In the name of this hexagram, Kwei is used with this transitive force. But Mei means ‘ a younger sister,’ and not merely a young lady or a daughter. Kwei Mei might be equivalent to our ‘giving in marriage;' but we shall find",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：女承筐無實，士刲羊無血，無攸利。"
        }
      ],
      "normalized_meaning": "Empty gestures. Ceremony without substance yields no benefit. Do not proceed.",
      "keywords": [
        "hollow ritual",
        "lack of substance",
        "no benefit",
        "abort action",
        "misalignment"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.561127Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 213,
      "leaf_end": 217,
      "page_candidates": [
        "396",
        "397",
        "7",
        "48",
        "398",
        "399",
        "8",
        "400",
        "401",
        "9",
        "53",
        "402",
        "403",
        "1",
        "404",
        "405",
        "12",
        "72"
      ],
      "page_confidence": 0.0
    }
  }
}