{
  "id": "hx55",
  "number": 55,
  "unicode_hexagram": "䷶",
  "name": "Abundance / Fullness (豐, Fēng)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "F ang intimates progress and development. When a king has reached the point (which the name denotes) that the special term has a special appropriateness. The Thwan makes the hexagram give a bad auspice concerning its subject; and for this the following reasons are given:—According to Wan's symbolism of the trigrams, Tui, the lower trigram here, denotes the youngest daughter, and Zan, the upper trigram, the oldest son. And as the action of the hexagram begins with that of the lower trigram, we have in the figure two violations of propriety, First, the marriage represented is initiated by the lady and her friends, She goes to her future home instead of the bridegroom coming to fetch her. Second, the parties are unequally matched. There ought not to be such disparity of age between them. Another reason assigned for the bad auspice is that lines 2,3, 4, and 5 are all in places not suited to them, quite different from the corres ponding lines in the preceding hexagram. Is then such a marriage as the above, or marriage in general, the theme of the hexagram p I think not. The marriage comes in, as in the preceding essay, by way of illustration. With all the abuses belonging to it as an institution of his country, as will imme diately appear, the writer acknowledged it without saying a word in deprecation or correction of those abuses; but from the case he selected he wanted to set forth some principles which should obtain in the relation between a ruler and his ministers. This view is insisted on in Wan Zing’s ‘New Collection of Comments on the Yi (a.d. 1686).’ A feudal prince was said to marry nine ladies at once. The principal of them was the bride who was to be tne proper wife, and she was attended by two others, virgins from her father s harem; a cousin, and a half-sister, a daughter of her father by another mother of inferior rank. Under line 1 the younger sister THE Yf KING. there is no occasion to be anxious (through fear of a change). Let him be as die sun at noon. of the hexagram appears in the inferior position of this half-sister. But the line is strong, indicative in a female of firm virtue. The mean condition and its duties are to be deplored, and give the auspice of lameness; but notwithstanding, the secondary wife will in a measure discharge her service. There will be good fortune. Notwithstanding apparent disadvantages, an able officer may do his ruler good service. Line 2 is strong, and in the centre. The proper correlate is 5, which, however, is weak, and in the place of a strong line. With such a correlate, the able lady in 2 cannot do much in the dis charge of her proper work. But if she think only of her husband, like the widow who will die rather than marry again, such devo tion will have its effect and its reward. Though blind of one eye, she yet manages to see. And so devoted loyalty in an officer will compensate for many disadvantages, Line 3 is weak, where it should be strong; and the attribute of pleased satisfaction belonging to Tui culminates in its subject. She turns out to be of so mean a character and such a slave of passion that no one will many her. She returns and accepts the position of a concubine. Line 4 is strong, where it should be weak; but in the case of a female the indication is not bad. The subject of the line, how ever, is in 110 haste. She waits, and the good time will come. King Ti-yf has been already mentioned under the fifth line of hexagram n, and in connexion with some regulation which he made about, the marriage of daughters of the royal house. His sister here is honourably mentioned, so as to suggest that the adorning which she preferred was ‘the ornament of the hidden man of the heart, The comparison of her to ‘the moon almost full ’ I am ready to hail as an instance where the duke of Aau is for once poetical. A^angfe, however, did not see poetry, but a symbol in it, ‘The moon is not full,’ he says, ‘but only nearly full. A wife ought not to eclipse her husband I 1 However, the sister of Ti-yi gets happily married, as she deserved to do, being represented by the line in the place of honour, having its proper correlate in 2. Line 6 is weak, at the top of the hexagram, and without a proper correlate, Hence its auspice is evil. The marriage-contract is broken, according tb Affi Hsi, and does not take effect. The SECT. II. THE FANG HEXAGRAM. 185 1. The first line, undivided, shows its subject meeting with his mate. Though they are both of the same character, there will be no error. Advance will call forth approval, 2. The second line, divided, shows its subject surrounded by screens so large and thick that at midday he can see from them the constellation of the Bushel. If he go (and try to enlighten his ruler who is thus emblemed), he will make himself to be viewed with suspicion and dislike. Let him cherish his feeling of sincere devotion that he may thereby move (his ruler’s mind), and there will be good fortune. 3. The third line, undivided, shows its subject with an (additional) screen of a large and thick banner, through which at midday he can see (the small) Mei star. (In the darkness) he breaks his right arm; but there will be no error. 4. The fourth line, undivided, shows its subject in a tent so large and thick that at midday he can see from it the constellation of the Bushel. But he meets with the subject of the (first) line, undivided like himself. There will be good fortune. 5. The fifth line, divided, shows its subject bring ing around him the men of brilliant ability. There will be occasion for congratulation and praise. There will be good fortune, 6. The topmost line, divided, shows its subject parties mentioned in the paragraph appear engaged in the temple, offering or sacrificing to the spirits of theii ancestors. But t e woman’s basket which should contain her offerings (The Shih.I, ii ode 4) is empty, and the man attempts to perform his part m slaying the victim (The Shih, II, vi, ode 6 .5) without effect. THE Yt KING. with his house made large, but only serving as a | screen to his household. When he looks at his door, l it is still, and there is nobody about it. For three j years no one is to be seen. There will be evil. ~ ■\" ..\"\" — 1 r ' ' ' t i LV. The character Fang is the symbol of being large and j abundant, and, as the name of this hexagram, denotes a condition of | abundant prosperity. In the changes of human affairs a condition of prosperity has often given place to one of an opposite character, j The lesson of the hexagram is to show to rulers how they may preserve the prosperity of their state and people. The component trigrams have the attributes of intelligence and of motive force, and j the second is under the direction of the first. A ruler with these attributes is not likely to fail in maintaining his crown and pros perity, and it may well be said that the figure intimates progress I and development. The king is told not to be anxious, but to study • how he may always be like the sun in his meridian height, cheering and enlightening all. The explanation of the Thwan is thus natural and easy. It will he found that a change is introduced in explaining the symbolism of the lines, which it is as well to point out here. Thus far we have found that to constitute a proper correlation between two lines, one of them must be whole, and the other divided. Here two undivided lines make a correlation. The law, evidently made for the occasion, goes far to upset altogether the doctrine of correlated lines. I have been surprised that the rules about the lines stated in the Introduction, pp. 15,16, have held good so often. There have been various deviations from them, but none so gross as that in this hexagram. Line 1 is strong, and in an odd place. Its correlate is 4, which would in other figures be deemed unfortunate. But here even the Text calls 4 (for the reference must be to it) the mate of 1, and makes their belonging to different categories of no account. The lesson taught is that mutual helpfulness is the great instrument for the maintenance of prosperity. The subject of line 1 is encouraged to go forward, Line 2 is divided, and in its proper place. Occupying the centre 1 of the trigram of brightness, the intelligence of it should be con- : centiated in its subject; but his correlate is the weak g, weak and j in an improper place, so that he becomes the benighted ruler, and darkness is shed from him down on 2, which is strangely symbolised. s",
    "normalized_summary": "Abundance at its height. Illuminate, organize, and distribute while the light is strongest. Screens, distractions, and overreach can dim the noon sun—lead clearly and steady the order so prosperity serves the whole."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows its subject meeting with his mate. Though they are both of the same character, there will be no error. Advance will call forth approval,",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：遇其配主，雖旬無咎，往有尚。"
        }
      ],
      "normalized_meaning": "Right partners meet at the outset. Same nature, no blame. Move forward and you’ll be endorsed.",
      "keywords": [
        "alliance",
        "matched forces",
        "no blame",
        "advance approved",
        "good pairing"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows its subject surrounded by screens so large and thick that at midday he can see from them the constellation of the Bushel. If he go (and try to enlighten his ruler who is thus emblemed), he will make himself to be viewed with suspicion and dislike. Let him cherish his feeling of sincere devotion that he may thereby move (his ruler’s mind), and there will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：豐其蔀，日中見斗。往得疑疾，有孚發若，吉。"
        }
      ],
      "normalized_meaning": "Obstructions darken noon. Don’t force your counsel; keep sincere devotion and influence gently—then good fortune.",
      "keywords": [
        "obscuration",
        "court suspicion",
        "devotion",
        "indirect influence",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows its subject with an (additional) screen of a large and thick banner, through which at midday he can see (the small) Mei star. (In the darkness) he breaks his right arm; but there will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：豐其沛，日中見沬。折其右肱，無咎。"
        }
      ],
      "normalized_meaning": "Even more veiling; tiny lights at noon. You take a hit but avoid fault. Endure and keep integrity.",
      "keywords": [
        "obstacles increase",
        "injury without blame",
        "endurance",
        "dimmed clarity",
        "restraint"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows its subject in a tent so large and thick that at midday he can see from it the constellation of the Bushel. But he meets with the subject of the (first) line, undivided like himself. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：豐其蔀，日中見斗，遇其夷主，吉。"
        }
      ],
      "normalized_meaning": "Still under screens, but the right ally appears. Connection pierces the gloom—auspicious.",
      "keywords": [
        "meeting an equal",
        "ally appears",
        "breakthrough",
        "good fortune",
        "cooperation"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows its subject bring ing around him the men of brilliant ability. There will be occasion for congratulation and praise. There will be good fortune,",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：來章，有慶譽，吉。"
        }
      ],
      "normalized_meaning": "Gather the able and radiant. Recognition and praise follow—good fortune.",
      "keywords": [
        "talent assembly",
        "merit recognized",
        "praise",
        "leadership",
        "good fortune"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, divided, shows its subject parties mentioned in the paragraph appear engaged in the temple, offering or sacrificing to the spirits of theii ancestors. But t e woman’s basket which should contain her offerings (The Shih.I, ii ode 4) is empty, and the man attempts to perform his part m slaying the victim (The Shih, II, vi, ode 6 .5) without effect. THE Yt KING. with his house made large, but only serving as a | screen to his household. When he looks at his door, l it is still, and there is nobody about it. For three j years no one is to be seen. There will be evil. ~ ■\" ..\"\" — 1 r ' ' ' t i LV. The character Fang is the symbol of being large and j abundant, and, as the name of this hexagram, denotes a condition of | abundant prosperity. In the changes of human affairs a condition of prosperity has often given place to one of an opposite character, j The lesson of the hexagram is to show to rulers how they may preserve the prosperity of their state and people. The component trigrams have the attributes of intelligence and of motive force, and j the second is under the direction of the first. A ruler with these attributes is not likely to fail in maintaining his crown and pros perity, and it may well be said that the figure intimates progress I and development. The king is told not to be anxious, but to study • how he may always be like the sun in his meridian height, cheering and enlightening all. The explanation of the Thwan is thus natural and easy. It will he found that a change is introduced in explaining the symbolism of the lines, which it is as well to point out here. Thus far we have found that to constitute a proper correlation between two lines, one of them must be whole, and the other divided. Here two undivided lines make a correlation. The law, evidently made for the occasion, goes far to upset altogether the doctrine of correlated lines. I have been surprised that the rules about the lines stated in the Introduction, pp. 15,16, have held good so often. There have been various deviations from them, but none so gross as that in this hexagram. Line 1 is strong, and in an odd place. Its correlate is 4, which would in other figures be deemed unfortunate. But here even the Text calls 4 (for the reference must be to it) the mate of 1, and makes their belonging to different categories of no account. The lesson taught is that mutual helpfulness is the great instrument for the maintenance of prosperity. The subject of line 1 is encouraged to go forward, Line 2 is divided, and in its proper place. Occupying the centre 1 of the trigram of brightness, the intelligence of it should be con- : centiated in its subject; but his correlate is the weak g, weak and j in an improper place, so that he becomes the benighted ruler, and darkness is shed from him down on 2, which is strangely symbolised. s",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：豐其屋，蔀其家，闚其戶，闃其無人，三歲不覿，凶。"
        }
      ],
      "normalized_meaning": "Grandeur becomes isolation. A big house that hides emptiness—prolonged absence and misfortune.",
      "keywords": [
        "hollow abundance",
        "isolation",
        "blocked access",
        "prolonged decline",
        "misfortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.561460Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 217,
      "leaf_end": 220,
      "page_candidates": [
        "404",
        "405",
        "12",
        "72",
        "6",
        "407",
        "24",
        "409",
        "1",
        "3",
        "410",
        "411",
        "2",
        "9"
      ],
      "page_confidence": 0.0
    }
  }
}