{
  "id": "hx56",
  "number": 56,
  "unicode_hexagram": "䷷",
  "name": "The Wanderer / The Traveler (旅, Lǚ)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Lu intimates that (in the condition which it denotes) there may be some little attainment and progress. If the stranger or traveller be firm and correct as he ought to be, there will be good fortune. 1. The first line, divided, shows the stranger mean and meanly occupied. It is thus that he brings on himself (further) calamity. The subject of 2 therefore, if he advance, will not be acceptable to his ruler, and will not be employed. The only way in which he can be useful by developing the light that is in him is pointed out in the conclusion. The constellation of the Bushel corresponds to our Ursa Major, or perhaps part of Sagittarius. Line 3 is strong, in its proper place. It is the last line more over of the trigram of Brightness. All these conditions are favourable to the employment of its subject; but its correlate is the weak 6, which is at the extremity of the trigram of movement. There is no more power therefore in 6, and the subject of 3 has no one to co-operate with him. His symbolism and auspice are worse than those of 2; but his own proper goodness and capacity will save him from error. Mei is a small star in or near the Bushel. The symbolism of line 4 is the same as that of 2, till we come to the last sentence. Then there is the strange correlation of the two strong lines in 4 and 1; and the issue is good. The subject of line 5 is in the ruler’s place, himself weak, but t the lord ’ of the trigram of movement. He can do little unhelped, but if he can bring into the work and employ in his service the talents of 1, 3, and 4, and even of 2, his correlate, the results will be admirable. Nothing consolidates the prosperity of a countiy so much as the co-operation of the ruler and able ministers. All the conditions of line 6 are unfavourable, and its subject is left to himself without any helpers. He is isolated for long, and undone. The issue is only evil. THE yt KING. 2. The second line, divided, shows the stranger, occupying his lodging-house, carrying with him his means of livelihood, and provided with good and trusty servants. 3. The third line, undivided, shows the stranger, burning his lodging-house, and having lost his ser vants. However firm and correct he (try to) be, he will be in peril. 4. The fourth line, undivided, shows the traveller in a resting-place, having (also) the means of liveli hood and the axe, (but still saying), ‘I am not at ease in my mind.’ 5. The fifth line, divided, shows its subject shoot ing a pheasant. He will lose his arrow, but in the end he will obtain praise and a (high) charge. 6. The sixth line, undivided, suggests the idea of a bird burning its nest. The stranger, (thus represented), first laughs and then cries out. He has lost his ox(-like docility) too readily and easily. There will be evil. LVI, The name Lii denotes people travelling abroad, and is often translated by ‘ strangers.’ As early as the time of king W&n, there ■was a class of men who went about from one state to another, pur suing their business as pedlars or travelling merchants; but in Mencius II, i, chap, 5.3, it is used for travellers generally, whatever it was that took them out of their own states. Confucius himself is adduced as a travelling stranger; and in this hexagram king WUn is supposed to have addressed himself to the class of such men, and told them how they ought to comport themselves. They ought to cultivate two qualities,—-those of humility and integrity (firm correctness). By means of these they would escape harm, and would make some little attainment and progress. Their rank was too low to speak of great things in connexion with them. It is interesting to find travellers, strangers in a strange land, having thus a place in the Yi, For the manner in which the component trigrams are supposed",
    "normalized_summary": "Travel and exile. Small success if you’re disciplined, humble, and correct. Guard resources, respect hosts, avoid arrogance, don’t burn bridges; decorum brings good fortune."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, divided, shows the stranger mean and meanly occupied. It is thus that he brings on himself (further) calamity. The subject of 2 therefore, if he advance, will not be acceptable to his ruler, and will not be employed. The only way in which he can be useful by developing the light that is in him is pointed out in the conclusion. The constellation of the Bushel corresponds to our Ursa Major, or perhaps part of Sagittarius. Line 3 is strong, in its proper place. It is the last line more over of the trigram of Brightness. All these conditions are favourable to the employment of its subject; but its correlate is the weak 6, which is at the extremity of the trigram of movement. There is no more power therefore in 6, and the subject of 3 has no one to co-operate with him. His symbolism and auspice are worse than those of 2; but his own proper goodness and capacity will save him from error. Mei is a small star in or near the Bushel. The symbolism of line 4 is the same as that of 2, till we come to the last sentence. Then there is the strange correlation of the two strong lines in 4 and 1; and the issue is good. The subject of line 5 is in the ruler’s place, himself weak, but t the lord ’ of the trigram of movement. He can do little unhelped, but if he can bring into the work and employ in his service the talents of 1, 3, and 4, and even of 2, his correlate, the results will be admirable. Nothing consolidates the prosperity of a countiy so much as the co-operation of the ruler and able ministers. All the conditions of line 6 are unfavourable, and its subject is left to himself without any helpers. He is isolated for long, and undone. The issue is only evil. THE yt KING.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：旅琐琐，斯其所取灾。"
        }
      ],
      "normalized_meaning": "Petty conduct while abroad invites trouble. Keep standards high, even in small matters.",
      "keywords": [
        "pettiness",
        "self-inflicted trouble",
        "low aims",
        "early warning",
        "conduct abroad"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, shows the stranger, occupying his lodging-house, carrying with him his means of livelihood, and provided with good and trusty servants.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：旅即次，怀其资，得童仆贞。"
        }
      ],
      "normalized_meaning": "Secure lodging, resources, and reliable help. Modest, orderly travel goes well.",
      "keywords": [
        "settled lodging",
        "resources in hand",
        "reliable support",
        "orderliness",
        "stability"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, shows the stranger, burning his lodging-house, and having lost his ser vants. However firm and correct he (try to) be, he will be in peril.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：旅焚其次，丧其童仆，贞厉。"
        }
      ],
      "normalized_meaning": "Rash acts destroy your base and allies. Even rectitude can’t spare you from danger now.",
      "keywords": [
        "self-sabotage",
        "loss of support",
        "peril",
        "rashness",
        "burning bridges"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows the traveller in a resting-place, having (also) the means of liveli hood and the axe, (but still saying), ‘I am not at ease in my mind.’",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九四：旅于处，得其资斧，我心不快。"
        }
      ],
      "normalized_meaning": "You’re equipped and sheltered, yet uneasy. Maintain vigilance; don’t relax into carelessness.",
      "keywords": [
        "temporary shelter",
        "tools on hand",
        "unease",
        "caution",
        "watchfulness"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, divided, shows its subject shoot ing a pheasant. He will lose his arrow, but in the end he will obtain praise and a (high) charge.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六五：射雉一矢亡，终以誉命."
        }
      ],
      "normalized_meaning": "A small loss precedes recognition. Offer the right token or service; esteem and appointment follow.",
      "keywords": [
        "initial loss",
        "winning favor",
        "recognition",
        "appointment",
        "right offering"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The sixth line, undivided, suggests the idea of a bird burning its nest. The stranger, (thus represented), first laughs and then cries out. He has lost his ox(-like docility) too readily and easily. There will be evil. LVI, The name Lii denotes people travelling abroad, and is often translated by ‘ strangers.’ As early as the time of king W&n, there ■was a class of men who went about from one state to another, pur suing their business as pedlars or travelling merchants; but in Mencius II, i, chap, 5.3, it is used for travellers generally, whatever it was that took them out of their own states. Confucius himself is adduced as a travelling stranger; and in this hexagram king WUn is supposed to have addressed himself to the class of such men, and told them how they ought to comport themselves. They ought to cultivate two qualities,—-those of humility and integrity (firm correctness). By means of these they would escape harm, and would make some little attainment and progress. Their rank was too low to speak of great things in connexion with them. It is interesting to find travellers, strangers in a strange land, having thus a place in the Yi, For the manner in which the component trigrams are supposed",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：鸟焚其巢，旅人先笑后号啕。丧牛于易，凶。"
        }
      ],
      "normalized_meaning": "Arrogance and frivolity end in ruin. Losing humility turns laughter to lament—misfortune.",
      "keywords": [
        "hubris",
        "ruin",
        "from levity to grief",
        "lost humility",
        "misfortune"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.561866Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 220,
      "leaf_end": 223,
      "page_candidates": [
        "410",
        "411",
        "2",
        "9",
        "412",
        "413",
        "3",
        "7",
        "44",
        "21",
        "6",
        "47",
        "I"
      ],
      "page_confidence": 0.0
    }
  }
}