{
  "id": "hx57",
  "number": 57,
  "unicode_hexagram": "䷸",
  "name": "The Gentle / Penetrating (巽, Xùn)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Sun intimates that (under the conditions which it denotes) there will be some little attainment and progress. There will be advantage in movement to give the idea that is in Lti, see Appendix II. In Appendix I there is an endeavour to explain the Thwan by means of the lines and their relation to one another. Line 1 is weak, in an odd place, and at the very bottom or commencement of the hexagram. These conditions are supposed to account for the unfavourable symbolism and auspice. Line 2 is weak, but in its proper place. That place, moreover, is the central. Hence the traveller—and he might here very well be a travelling merchant—is represented in the symbolism as provided with everything he can require; and though the auspice is not mentioned, we must understand it as being good. Line 3 is strong, and in an even place. But it occupies the topmost place in the lower trigram; and its strength may be expected to appear as violence. So it does in the symbolism, and extraordinary violence as well. It seems unreasonable to suppose, as in the conclusion, that one so described could be in any way correct. The Khang-hsi editors remark that the subjects of 2 and 3 are represented as having ‘lodging-houses,’ and not any of those of the other lines, because these are the only two lines in the places proper to them! Line 4 is strong, but in an even place. Hence its subject has not ‘ a lodging-house; ’ but has found a situation where he has shelter, though he is exposed to perils. Hence he is represented as having an axe, which may be available for defence. Still he is not at peace in his mind. The Khang-hsi editors observe well that the mention of an axe makes us think of caution as a quality desirable in a traveller. , Line 5, though weak, is in the centre of the upper tngram, which THE Y$ KING. SECT, II. onward in whatever direction. It will be advanta geous (also) to see the great man. 1. The first line, divided, shows its subject (now) advancing, (now) receding. It would be advanta geous for him to have the firm correctness of a brave soldier. 2. The second line, undivided, shows the repre sentative of Sun beneath a couch, and employing diviners and exorcists in a way bordering on confu sion. There will be good fortune and no error. 3. The third line, undivided, shows its subject penetrating (only) by violent and repeated efforts. There will be occasion for regret. 4. The fourth line, divided, shows all occasion for repentance (in its subject) passed away. He takes game for its threefold use in his hunting. 5. The fifth line, undivided, shows that with firm correctness there will be good fortune (to its has the quality of brightness and elegance. It is held to be the lord of the trigram Lt; and lines 4 and 6 are on either side in loyal duty to defend and help. Then the shooting a pheasant is supposed to be suggested; an elegant bird,—by the trigram of elegance, When an officer was travelling abroad in ancient times, his gift of intro duction at any feudal court was a pheasant. The traveller here emblemed is praised by his attached friends, and exalted to a place of dignity by the ruler to whom he is acceptable, It will be seen how the idea of the fifth line being the ruler’s seat is dropt here as being alien from the idea of the hexagram, so arbitrary is the interpretation of the symbolism. Line 6 is strong, in an even place, at the extremity of Li and of the whole hexagram. Its subject will be arrogant and violent; the opposite of what a traveller should be; and the issue will be evil, The symbolism must be allowed to be extravagant. What bird ever burned its nest? And the character for ‘ox’ is strangely used for 1 ox-like docility. 5 subject). All occasion for repentance will disap pear, and all his movements will be advantageous. There may have been no (good) beginning, but there will be a (good) end. Three days before making any changes, (let him give notice of them); and three days after, (let him reconsider them). There will (thus) be good fortune. 6. The sixth line, undivided, shows the repre sentative of penetration beneath a couch, and having lost the axe with which he executed his decisions. However firm and correct he may (try to) be, there will be evil. LVII. With Sun as the fifth of the Ffi-hsi trigrams we have become familiar. It symbolises both wind and wood; and has the attributes of flexibility (nearly allied to docility) and pene tration. In this hexagram we are to think of it as representing wind with its penetrating power, finding its way into every corner and cranny. Confucius once said (Analects 12.19):—‘The relation between superiors and inferiors is like that between the wind and the grass. The grass must bend when the wind blows upon it. 1 In accordance with this, the subject of the hexagram must be understood as the influence and orders of government designed to remedy what is wrong in the people. The ‘Daily Lecture’ says that the upper trigram denotes the orders issuing from the ruler, and the lower the obedience rendered to them by the people; but this view is hardly borne out by the Text. But how is it that the figure represents merely ‘ some little attain ment ? 1 This is generally explained by taking the first line of the trigram as indicating what the subject of it can do. But over the weak first line are two strong lines, so that its subject can accom plish but little, The Khang-hsi editors, rejecting this view, contend that, the idea of the whole figure being penetration, line 1, the symbol of weakness and what is bad, will not be able to offei much resistance to the subjects of the other lines, which will enter and dispel its influence. They illustrate this from processes of nature, education, and politics; the effect they say is described as small, because the process is not to revolutionise or renew, but only to LV III. The Tui Hexagram. Tui intimates that (under its conditions) there will be progress and attainment. (But) it will be. advantageous to be firm and correct. correct and improve. Such as it is, however, it requires the operation of the strong and virtuous, 1 the great man.’ Even all this criticism is not entirely satisfactory. Line i is weak, where it should be strong. The movements of its subject are expressive of perplexity. He wants vigour and decision. Line 2 is strong, and in the right place, and has a good auspice. Things are placed or hidden beneath a couch or bed; and the subject of the line appears as searching for them. lie calls in divi nation to assist his judgment, and exorcists to expel for him what is bad, The work is great and difficult, so that he appears almost distracted by it; but the issue is good, For this successful expla nation of the line, 1 am indebted to the Khang-hsi editors. The writer of the Text believed of course in divination and exorcism; which was his misfortune rather than his fault or folly. Line 3 is in the right place for a strong line. But its position at the top of the lower trigram is supposed to indicate the restlessness, and here the vehemence, of its subject, And 6 is no proper correlate, All Hie striving is ineffective, and there is occasion for regret, Line 4 is weak, as is its correlate in 1. But 4 is a proper place for a weak line, and it rests under the shadow of the strong and central 5. Hence the omens of evil are counteracted; and a good auspice is obtained. The game caught in hunting was divided into three portions:—the first for use in sacrifices; the second for the entertainment of visitors; and the third for the kitchen generally. A hunt which yielded enough for all these purposes was deemed very successful, On line 5 /ffing-jze says‘ 1 It is the seat of honour, and the F SECT. II. THE TUI HEXAGRAM. I93 1. The first line, undivided, shows the pleasure of (inward) harmony. There will be good fortune. 2. The second line, undivided, shows the pleasure arising from (inward) sincerity. There will be good fortune. Occasion for repentance will disappear. 3. The third line, divided, shows its subject bringing round himself whatever can give pleasure. There will be evil. 4. The fourth line, undivided, shows its subject deliberating about what to seek his pleasure in, and not at rest. He borders on what would be injurious, but there will be cause for joy. 5. The fifth line, undivided, shows its subject trusting in one who would injure him. The situa tion is perilous. 6. The topmost line, divided, shows the pleasure of its subject in leading and attracting others. place for the lord of Sun, from whom there issue all charges and commands. It is central and correct; we must find in its subject the qualities denoted by Sun in their greatest excellence, But those qualities are docility and accordance with what is right; and the advantage of firm correctness is insisted on. With this all ■will be right.’ With the concluding sentence compare the conclusion of the Th wan of hexagram 18. The evil that paragraph 6 concludes with would arise from the quality of Sun being carried to excess. I have followed the Khang-hsi editors in adopting a change of one character in the received Text. LVIII. The trigram Tui symbolises water as collected in a marsh or lake; and its attribute or virtus is pleasure or com placent satisfaction. It is a matter of some difficulty to determine in one’s mind how this attribute came to be connected with the trigram. The Khang-hsi editors sayWhen the airs of spring begin to blow, from the collections of water on the earth the moistening vapours rise up (and descend again); so, when the breath of health is vigorous in a man’s person, the hue of it is THE Yt KING.",
    "normalized_summary": "Gentle penetration: influence through steady, subtle advance. Go where needed, align with worthy counsel, and avoid force. Patient correctness dissolves obstacles and regret."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, shows the pleasure of (inward) harmony. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：進退，利武人之貞。"
        }
      ],
      "normalized_meaning": "Wavering weakens penetration. Adopt disciplined firmness — like a soldier — before proceeding.",
      "keywords": [
        "hesitation",
        "firm discipline",
        "commitment",
        "right timing",
        "stability first"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows the pleasure arising from (inward) sincerity. There will be good fortune. Occasion for repentance will disappear.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：巽在床下，用史巫紛若，吉，無咎。"
        }
      ],
      "normalized_meaning": "Search deeply and clear hidden factors. Thorough, even messy inquiry leads to harmless, favorable results.",
      "keywords": [
        "due diligence",
        "root-cause search",
        "hidden influences",
        "thoroughness",
        "good fortune"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows its subject bringing round himself whatever can give pleasure. There will be evil.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：頻巽，吝。"
        }
      ],
      "normalized_meaning": "Forcing it defeats the spirit of Xùn. Repeated pushes bring embarrassment and regret.",
      "keywords": [
        "overforce",
        "pressure backfires",
        "impatience",
        "humiliation risk",
        "pull back"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, undivided, shows its subject deliberating about what to seek his pleasure in, and not at rest. He borders on what would be injurious, but there will be cause for joy.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：悔亡，田獲三品。"
        }
      ],
      "normalized_meaning": "Correction made. Efforts now yield balanced results that serve sacrifice, guests, and household.",
      "keywords": [
        "repentance ended",
        "balanced yield",
        "proper distribution",
        "restored order",
        "auspice returns"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows its subject trusting in one who would injure him. The situa tion is perilous.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：貞吉，悔亡，無不利。無初有終。先庚三日，後庚三日，吉。"
        }
      ],
      "normalized_meaning": "Center the mandate with firm correctness. Announce changes, then review them: deliberation turns shaky starts into good endings.",
      "keywords": [
        "central authority",
        "firm correctness",
        "procedural timing",
        "announce & review",
        "good ending"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, divided, shows the pleasure of its subject in leading and attracting others. place for the lord of Sun, from whom there issue all charges and commands. It is central and correct; we must find in its subject the qualities denoted by Sun in their greatest excellence, But those qualities are docility and accordance with what is right; and the advantage of firm correctness is insisted on. With this all ■will be right.’ With the concluding sentence compare the conclusion of the Th wan of hexagram 18. The evil that paragraph 6 concludes with would arise from the quality of Sun being carried to excess. I have followed the Khang-hsi editors in adopting a change of one character in the received Text. LVIII. The trigram Tui symbolises water as collected in a marsh or lake; and its attribute or virtus is pleasure or com placent satisfaction. It is a matter of some difficulty to determine in one’s mind how this attribute came to be connected with the trigram. The Khang-hsi editors sayWhen the airs of spring begin to blow, from the collections of water on the earth the moistening vapours rise up (and descend again); so, when the breath of health is vigorous in a man’s person, the hue of it is THE Yt KING.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：巽在床下，喪其資斧，貞凶。"
        }
      ],
      "normalized_meaning": "Subtlety taken too far becomes weakness. Lose your tool and authority, and persistence turns to misfortune.",
      "keywords": [
        "excessive subtlety",
        "loss of agency",
        "authority weakened",
        "misfortune",
        "over-yielding"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.562190Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 223,
      "leaf_end": 226,
      "page_candidates": [
        "6",
        "47",
        "I",
        "8",
        "419",
        "2",
        "420",
        "421",
        "48",
        "423",
        "4"
      ],
      "page_confidence": 0.0
    }
  }
}