{
  "id": "hx59",
  "number": 59,
  "unicode_hexagram": "䷺",
  "name": "Dispersion / Dissolution (渙, Huàn)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "Hwan intimates that (under its conditions) there will be progress and success. The king goes to his ancestral temple; and it will be advantageous to displayed in his complexion. Akin to this is the significance of the hexagram Tui representing a marsh, as denoting pleasure. Although the yin lines give it its special character they owe their power and effect to the yang; so when the qualities of mildness and harmony prevail in a man, without true-heartedness and in tegrity to control and direct them, they will fail to be correct, and may degenerate into what is evil. Hence it is said that it will be advantageous to be firm and correct 1 ’ The feeling then of pleasure is the subject of this hexagram. The above quotation sufficiently explains the concluding characters of the Th wan; but where is the intimation in Tui of progress and attainments ? It is supposed to be in the one weak line surmount ing each trigram and supported by the two strong lines. Fancy sees in that mildness and benignity energised by a double portion of strength. Line i, strong in the place of strength, with no proper correlate above, is thus confined to itself. But its subject is sufficient for himself. There will be good fortune. Line 2, by the rule of place, should be weak, but it is strong, Without any proper correlate, and contiguous to the weak 3, the subject of it might be injuriously affected, and there would be cause for repentance. But the sincerity natural in his central position counteracts all this, The view of the third paragraph that appears in the translation is derived from the Khang-hsf editors. The evil threatened in it would be a consequence of the excessive devotion of its subject to pleasure, ‘ The bordering on what is injurious ’ in paragraph 4 has refer ence to the contiguity of line 4 to the weak 3. That might have SECT. 11, cross the great stream. It will be advantageous to be firm and correct. r. The first line, divided, shows its subject en gaged in rescuing (from the impending evil) and having (the assistance of) a strong horse. There will be good fortune. 2. The second line, undivided, shows its subject, amid the dispersion, hurrying to his contrivance (for security). All occasion for repentance will disappear. 3. The third line, divided, shows its subject discarding any regard to his own person. There will be no occasion for repentance. 4. The fourth line, divided, shows its subject scattering the (different) parties (in the state); which leads to great good fortune. From the dispersion (he collects again good men standing out, a crowd) like a mound, which is what ordinary men would not have thought of. 5. The fifth line, undivided, shows its subject amidst the dispersion issuing his great announce ments as the perspiration (flows from his body). an injurious effect; but the subject of 4 reflects and deliberates before he will yield to the seduction of pleasure, and there is cause for joy. The danger to the subject of line 5 is from the weak 6 above, in whom he is represented as ‘ trusting.’ Possibly his own strength and sincerity of mind may be perverted into instruments of evil; but possibly, they may operate beneficially. The symbolism of paragraph 6 is akin to that of 3, though no positive auspice is expressed, The subject of line 3 attracts others round itself for the sake of pleasure; the subject of this leads them to follow himself in quest of it. THE Yt KING. He scatters abroad (also) the accumulations in the royal granaries. There will be no error. 6 . The topmost line, undivided, shows its subject disposing of (what may be called) its bloody wounds, and going and separating himself from its anxious fears. There will be no error. LIX. Hwfin, the name of this hexagram, denotes a state of dissipation or dispersion. It is descriptive primarily of men’s minds alienated from what is right and good. This alienation is sure to go on to disorder in the commonwealth; and an attempt is made to show how it should be dealt with and remedied. The figure is made up of one of the trigrams for water and over it that for wind, Wind moving over water seems to disperse it, and awakes naturally in the beholder the idea of dissipation. The intimation of progress and success is supposed to be given by the strong lines occupying the central places. The king goes to the ancestral temple, there to meet with the spirits of his ancestors. His filial piety moves them by the sincerity of its manifestation. Those spirits come and are present. Let filial piety—in our language, let sincere religion—rule in men’s minds, and there will be no alienation in them from what is right and good or from one another. And if the state of . the country demand a great or hazardous enterprise, let it be undertaken. But whatever is done, must be done with due attention to what is right, firmly and correctly. Line 1, at the commencement of the hexagram, tells us that the evil has not yet made great progress, and that dealing with it will be easy. But the subject of the line is weak, and in an odd place, He cannot cope with the evil himself, He must have help, and he finds that in a strong horse, which description is understood to be symbolical of the subject of the strong second line. Line 2 is strong, but in an even place. That place is, indeed, the central, but the attribute of the lower trigram Khan is peril, These conditions indicate evil, and action will be dangerous; but the subject of 2 looks to 1 below him, and takes shelter in union with its subject. Since the commentary of A^ang-^ze, this has been the interpretation of the line. Line 3 is weak, and in an odd place. A regard for himself that would unfit its subject for contributing any service to the work of sect. n.",
    "normalized_summary": "Dissolve division. Clear fear and faction through sincere rites, public proclamation, and just distribution. Cross big thresholds with disciplined correctness; dispersal paves the way for renewed unity."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The first SIX, divided, shows its subject engaged in rescuing (from the impending evil) and having (the assistance of) a strong horse. There will be good fortune.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初六：用拯馬壯，吉。"
        }
      ],
      "normalized_meaning": "Act to save; strong support appears. Timely intervention in dispersal brings good fortune.",
      "keywords": [
        "timely rescue",
        "aid arrives",
        "decisive action",
        "good fortune",
        "mobilization"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, undivided, shows its subject, amid the dispersion, hurrying to his contrivance (for security). All occasion for repentance will disappear.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九二：渙奔其機，悔亡。"
        }
      ],
      "normalized_meaning": "In the midst of scattering, get to your safe setup/strategy fast. Proper refuge removes regret.",
      "keywords": [
        "seek refuge",
        "regret dissolves",
        "rapid response",
        "preparedness",
        "stabilization"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, divided, shows its subject discarding any regard to his own person. There will be no occasion for repentance.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六三：渙其躬，無悔。"
        }
      ],
      "normalized_meaning": "Let go of ego and self-protection for the greater good; no regret.",
      "keywords": [
        "selflessness",
        "ego release",
        "public duty",
        "no regret",
        "service"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows its subject scattering the (different) parties (in the state); which leads to great good fortune. From the dispersion (he collects again good men standing out, a crowd) like a mound, which is what ordinary men would not have thought of.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：渙其群，元吉。渙有丘，匪夷所思。"
        }
      ],
      "normalized_meaning": "Break up factions, then regather the worthy into a visible body. Uncommon statecraft; great good fortune.",
      "keywords": [
        "defuse factions",
        "reconsolidate",
        "visionary leadership",
        "great good fortune",
        "uncommon strategy"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows its subject amidst the dispersion issuing his great announce ments as the perspiration (flows from his body). an injurious effect; but the subject of 4 reflects and deliberates before he will yield to the seduction of pleasure, and there is cause for joy. The danger to the subject of line 5 is from the weak 6 above, in whom he is represented as ‘ trusting.’ Possibly his own strength and sincerity of mind may be perverted into instruments of evil; but possibly, they may operate beneficially. The symbolism of paragraph 6 is akin to that of 3, though no positive auspice is expressed, The subject of line 3 attracts others round itself for the sake of pleasure; the subject of this leads them to follow himself in quest of it. THE Yt KING. He scatters abroad (also) the accumulations in the royal granaries. There will be no error. 6 . The topmost line, undivided, shows its subject disposing of (what may be called) its bloody wounds, and going and separating himself from its anxious fears. There will be no error. LIX. Hwfin, the name of this hexagram, denotes a state of dissipation or dispersion. It is descriptive primarily of men’s minds alienated from what is right and good. This alienation is sure to go on to disorder in the commonwealth; and an attempt is made to show how it should be dealt with and remedied. The figure is made up of one of the trigrams for water and over it that for wind, Wind moving over water seems to disperse it, and awakes naturally in the beholder the idea of dissipation. The intimation of progress and success is supposed to be given by the strong lines occupying the central places. The king goes to the ancestral temple, there to meet with the spirits of his ancestors. His filial piety moves them by the sincerity of its manifestation. Those spirits come and are present. Let filial piety—in our language, let sincere religion—rule in men’s minds, and there will be no alienation in them from what is right and good or from one another. And if the state of . the country demand a great or hazardous enterprise, let it be undertaken. But whatever is done, must be done with due attention to what is right, firmly and correctly. Line 1, at the commencement of the hexagram, tells us that the evil has not yet made great progress, and that dealing with it will be easy. But the subject of the line is weak, and in an odd place, He cannot cope with the evil himself, He must have help, and he finds that in a strong horse, which description is understood to be symbolical of the subject of the strong second line. Line 2 is strong, but in an even place. That place is, indeed, the central, but the attribute of the lower trigram Khan is peril, These conditions indicate evil, and action will be dangerous; but the subject of 2 looks to 1 below him, and takes shelter in union with its subject. Since the commentary of A^ang-^ze, this has been the interpretation of the line. Line 3 is weak, and in an odd place. A regard for himself that would unfit its subject for contributing any service to the work of sect. n.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：渙汗其大號，渙王居，無咎。"
        }
      ],
      "normalized_meaning": "Proclaim clearly and distribute stores for the people. Open-handed governance in crisis—no blame.",
      "keywords": [
        "public proclamation",
        "relief measures",
        "open granaries",
        "benevolent rule",
        "no blame"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "The topmost NINE, undivided, shows its subject disposing of (what may be called) its bloody wounds, and going and separating himself from its anxious fears. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上九：渙其血，去逖出，無咎。"
        }
      ],
      "normalized_meaning": "Clean away harm and depart far from danger. Remove yourself from the threat—no blame.",
      "keywords": [
        "remove danger",
        "cleanse harm",
        "strategic withdrawal",
        "safety",
        "no blame"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.562926Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 229,
      "leaf_end": 232,
      "page_candidates": [
        "7",
        "429",
        "10",
        "431",
        "50",
        "432",
        "16",
        "434",
        "435",
        "2"
      ],
      "page_confidence": 0.0
    }
  }
}