{
  "id": "hx63",
  "number": 63,
  "unicode_hexagram": "䷾",
  "name": "After Completion / Already Fording (既濟, Jì Jì)",
  "component": "I_CHING",
  "version": "1.0",
  "last_updated": "2025-10-28",
  "core_meaning": {
    "legge_1899_public_domain": "K\\ 3 i intimates progress and success in small matters. There will be advantage in being firm had in his mind our distinction of essentials and non-essentials. Is it ever good to deviate from what is recognised as the established course of procedure ? The reply is—never in the matter of right; but in what is conventional and ceremonial—in what is non- essential—the deviation may be made, and will be productive of good. The form may be given up, but not the substance. But the thing must be done very carefully,—humbly and reverently, and in small matters. The symbolism of the bird is rather obscure. The whole of it is intended to teach humility. It is better for the bird to descend, keeping near to where it can perch and rest, than to hold on ascending into the homeless regions of the air. Line i is weak, in an odd place, and possessed by the ‘ idea of exceeding,' which belongs to the hexagram. Its correlate is the strong 4, belonging to the trigram ifan, the attribute of which is movement. There is nothing to repress the tendency of i; rather it is stimulated; and hence the symbolism. Line 2 is weak, but in its proper place, and in the centre. Its correlate is 5, which is also a weak line. The lines 3 and 4 between them are both strong; and are supposed to represent the father and grandfather of the subject of 2; but he or she goes past them, and meets with the grandmother in g. Again, 5 is the ruler’s seat. The subject of 2 moves on to him, but not as an enemy; but humbly and loyally, as his minister according to the attributes of a weak line in the central place. It must be allowed that this view of the symbolism and its interpretation is obscure and strained. The subject of line 3 is too confident in his own strength, and too defiant of the weak and small enemies that seek his hurt. SECT. ir. THE id fit HEXAGRAM. and correct. There has been good fortune in the beginning; there may be disorder in the end. 1. The first line, undivided, (shows its subject as a driver) who drags back his wheel, (or as a fox) which has wet his tail. There will be no error. 2. The second line, divided, (shows its subject as) a wife who has lost her (carriage-)screen. There is no occasion to go in pursuit of it. In seven days she will find it. 3. The third line, undivided, (suggests the case of) Kao Sung who attacked the Demon region, but was three years in subduing it. Small men should not be employed (in such enterprises). Line 4 is also strong, but the exercise of his strength by its subject is tempered by the position in an even place, He is warned, however, to continue quiet and restrain himself. Line g, though in the ruler’s seat, is weak, and incapable of doing anything great. Its subject is called king or duke because of the ruler’s seat; and the one whom in the concluding sentence he is said to capture is supposed to be the subject of 2. The first part of the symbolism is the same as that of the Thwan under hexagram 9, q. v. I said there that it probably gave a testimony of the merit of the house of Kin, as deserving the throne rather than the kings of Shang. That was because the Thwan contained the sentiments of Wan, while he was yet only lord of Ki u. But the symbolism here was the work of the duke of Kin, after his brother king Wu had obtained the throne. How did the symbolism then occur to him ? May we not conclude that at least the hsiang of this hexagram was written during the troubled period of his regency, after the accession of Wu s son, king Khi ng ? The Khang-hsi editors find in the concluding symbolism an incentive to humility;—* The duke, leaving birds on the wing, is content to use his arrows against those in a cave! ’ Line 6 is weak, and is at the top of the trigram of movement. He is possessed by the idea of the hexagram in an extreme degree, and is incapable of keeping himself under restraint. 206 THE YI KING. text. 4. The fourth line, divided, shows its subject with rags provided against any leak (in his boat), and on his guard all day long. 5. The fifth line, undivided, shows its subject (as) the neighbour in the east who slaughters an ox (for his sacrifice); but this is not equal to the (small) spring sacrifice of the neighbour in the west, whose sincerity receives the blessing. 6. The topmost line, divided, shows its subject with (even) his head immersed. The position is perilous. LXIII. The character called Ki is used as a symbol of being past or completed. $5 denotes primarily crossing a stream, and has the secondary meaning of helping and completing. The two characters, combined, will express the successful accom plishment of whatever the writer has in his mind. In dealing with this lineal figure, king Wan was thinking of the condition of the kingdom, at length at rest and quiet. The vessel of the state has been brought safely across the great and dangerous stream. The distresses of the kingdom have been relieved, and its disorders have been repressed, Does anything remain to be done still? Yes, in small things. The new government has to be consolidated. Its ruler must, without noise or clamour, go on to perfect what has been wrought, with firmness and correctness, and ever keeping in mind the instability of all human affairs. That every line of the hexagram is in its correct place, and has its proper correlate is also supposed to harmonize with the intimation of progress and success. Line 1, the first of the hexagram, represents the time im mediately after the successful achievement of the enterprise it denotes- the time for resting and being quiet. For a season, at least, all movement should be hushed. Hence we have the sym bolism of a driver trying to stop his carriage, and a fox who has wet his tail, and will not tempt the stream again. Line 2 is weak, and in its proper place. It also has the strong correlate 5; and might be expected to be forward to act. But it occupies its correct and central place, and suggests the symbol of a lady whose carriage has lost its screen. She will not advance THE WEI fit HEXAGRAM.",
    "normalized_summary": "Completion achieved—now guard it. Success in small matters; keep firm and correct. Beginnings are auspicious, but without vigilance endings can unravel."
  },
  "lines": [
    {
      "line": 1,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "1. The first line, undivided, (shows its subject as a driver) who drags back his wheel, (or as a fox) which has wet his tail. There will be no error.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "初九：曳其輪，濡其尾，無咎。"
        }
      ],
      "normalized_meaning": "Slow down at the threshold. Restrain momentum after success; caution prevents mistakes.",
      "keywords": [
        "restraint",
        "post-success caution",
        "no blame",
        "consolidation",
        "threshold"
      ]
    },
    {
      "line": 2,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "2. The second line, divided, (shows its subject as) a wife who has lost her (carriage-)screen. There is no occasion to go in pursuit of it. In seven days she will find it.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六二：婦喪其茀，勿逐，七日得。"
        }
      ],
      "normalized_meaning": "Hold your place; let time restore what’s missing. Patience and propriety bring it back.",
      "keywords": [
        "patience",
        "right timing",
        "propriety",
        "recovery",
        "non-chasing"
      ]
    },
    {
      "line": 3,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "3. The third line, undivided, (suggests the case of) Kao Sung who attacked the Demon region, but was three years in subduing it. Small men should not be employed (in such enterprises). Line 4 is also strong, but the exercise of his strength by its subject is tempered by the position in an even place, He is warned, however, to continue quiet and restrain himself. Line g, though in the ruler’s seat, is weak, and incapable of doing anything great. Its subject is called king or duke because of the ruler’s seat; and the one whom in the concluding sentence he is said to capture is supposed to be the subject of 2. The first part of the symbolism is the same as that of the Thwan under hexagram 9, q. v. I said there that it probably gave a testimony of the merit of the house of Kin, as deserving the throne rather than the kings of Shang. That was because the Thwan contained the sentiments of Wan, while he was yet only lord of Ki u. But the symbolism here was the work of the duke of Kin, after his brother king Wu had obtained the throne. How did the symbolism then occur to him ? May we not conclude that at least the hsiang of this hexagram was written during the troubled period of his regency, after the accession of Wu s son, king Khi ng ? The Khang-hsi editors find in the concluding symbolism an incentive to humility;—* The duke, leaving birds on the wing, is content to use his arrows against those in a cave! ’ Line 6 is weak, and is at the top of the trigram of movement. He is possessed by the idea of the hexagram in an extreme degree, and is incapable of keeping himself under restraint. 206 THE YI KING. text.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九三：高宗伐鬼方，三年克之，小人勿用。"
        }
      ],
      "normalized_meaning": "A major campaign requires endurance and capable allies. Do not rely on petty help.",
      "keywords": [
        "long effort",
        "endurance",
        "leadership",
        "avoid petty aides",
        "strategy"
      ]
    },
    {
      "line": 4,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "4. The fourth line, divided, shows its subject with rags provided against any leak (in his boat), and on his guard all day long.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "六四：繻有衣袽，終日戒。"
        }
      ],
      "normalized_meaning": "Keep the seals patched and stay alert. Preventive measures maintain completion.",
      "keywords": [
        "prevention",
        "maintenance",
        "vigilance",
        "risk management",
        "prudence"
      ]
    },
    {
      "line": 5,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "5. The fifth line, undivided, shows its subject (as) the neighbour in the east who slaughters an ox (for his sacrifice); but this is not equal to the (small) spring sacrifice of the neighbour in the west, whose sincerity receives the blessing.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "九五：東鄰殺牛，不如西鄰之禴祭，實受其福。"
        }
      ],
      "normalized_meaning": "Sincerity outweighs show. Modest, timely offerings with true heart draw real blessing.",
      "keywords": [
        "sincerity",
        "modesty",
        "authenticity",
        "blessing",
        "quality over quantity"
      ]
    },
    {
      "line": 6,
      "translations": [
        {
          "translator_id": "legge_1899_public_domain",
          "text": "6. The topmost line, divided, shows its subject with (even) his head immersed. The position is perilous. LXIII. The character called Ki is used as a symbol of being past or completed. $5 denotes primarily crossing a stream, and has the secondary meaning of helping and completing. The two characters, combined, will express the successful accom plishment of whatever the writer has in his mind. In dealing with this lineal figure, king Wan was thinking of the condition of the kingdom, at length at rest and quiet. The vessel of the state has been brought safely across the great and dangerous stream. The distresses of the kingdom have been relieved, and its disorders have been repressed, Does anything remain to be done still? Yes, in small things. The new government has to be consolidated. Its ruler must, without noise or clamour, go on to perfect what has been wrought, with firmness and correctness, and ever keeping in mind the instability of all human affairs. That every line of the hexagram is in its correct place, and has its proper correlate is also supposed to harmonize with the intimation of progress and success. Line 1, the first of the hexagram, represents the time im mediately after the successful achievement of the enterprise it denotes- the time for resting and being quiet. For a season, at least, all movement should be hushed. Hence we have the sym bolism of a driver trying to stop his carriage, and a fox who has wet his tail, and will not tempt the stream again. Line 2 is weak, and in its proper place. It also has the strong correlate 5; and might be expected to be forward to act. But it occupies its correct and central place, and suggests the symbol of a lady whose carriage has lost its screen. She will not advance THE WEI fit HEXAGRAM.",
          "citation_status": "public_domain"
        },
        {
          "translator_id": "chinese_original",
          "text": "上六：濡其首，厲。"
        }
      ],
      "normalized_meaning": "Overextension at the end brings danger. Don’t push past the safe limit.",
      "keywords": [
        "final-stage risk",
        "overreach",
        "immersion",
        "peril",
        "pull back"
      ]
    }
  ],
  "_meta": {
    "verification": "legge-1899.sync.v1",
    "verified_at": "2025-11-03T17:38:32.564284Z",
    "legge_source": {
      "index_file": "s3-data/hexagrams/legge-hx.json",
      "leaf_start": 241,
      "leaf_end": 244,
      "page_candidates": [
        "xxi",
        "100",
        "209",
        "19",
        "594",
        "436",
        "30",
        "16"
      ],
      "page_confidence": 0.0
    }
  }
}